zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz3/pic32cx5109bz31048-pinctrl.h
/*
 * Copyright (c) 2025 Microchip Technology Inc.
 * SPDX-License-Identifier: Apache-2.0
 */
 
#ifndef MICROCHIP_PIC32CX5109BZ31048_PINCTRL_H_
#define MICROCHIP_PIC32CX5109BZ31048_PINCTRL_H_

#include <dt-bindings/pic32c/pic32cx_bz/common/mchp_pinctrl_pinmux_pic32cxbz.h>

/* Indicates that direct mode is enabled; use this macro when configuring for direct mode
 * instead of PPS. */
#define PIN_DIRECT_MODE MCHP_PINMUX(direct, NA, NA, NA, directmode)
/* pa0_cclin1_in */
#define PA0_CCLIN1_IN MCHP_PINMUX(a, 0, 0x9c, 15, periph)
/* pa0_cclin2_in */
#define PA0_CCLIN2_IN MCHP_PINMUX(a, 0, 0xa0, 7, periph)
/* pa0_cclin4_in */
#define PA0_CCLIN4_IN MCHP_PINMUX(a, 0, 0xa8, 15, periph)
/* pa0_cclin5_in */
#define PA0_CCLIN5_IN MCHP_PINMUX(a, 0, 0xac, 7, periph)
/* pa0_cclout0_out */
#define PA0_CCLOUT0_OUT MCHP_PINMUX(a, 0, 0x204, 27, periph)
/* pa0_cclout1_out */
#define PA0_CCLOUT1_OUT MCHP_PINMUX(a, 0, 0x200, 27, periph)
/* pa0_extint1_in */
#define PA0_EXTINT1_IN MCHP_PINMUX(a, 0, 0x4, 15, periph)
/* pa0_extint2_in */
#define PA0_EXTINT2_IN MCHP_PINMUX(a, 0, 0x8, 7, periph)
/* pa0_qcs_out */
#define PA0_QCS_OUT MCHP_PINMUX(a, 0, 0x204, 23, periph)
/* pa0_qd0_out */
#define PA0_QD0_OUT MCHP_PINMUX(a, 0, 0x200, 24, periph)
/* pa0_qd1_out */
#define PA0_QD1_OUT MCHP_PINMUX(a, 0, 0x204, 24, periph)
/* pa0_qd2_in */
#define PA0_QD2_IN MCHP_PINMUX(a, 0, 0x8c, 15, periph)
/* pa0_qd2_out */
#define PA0_QD2_OUT MCHP_PINMUX(a, 0, 0x200, 26, periph)
/* pa0_qd3_in */
#define PA0_QD3_IN MCHP_PINMUX(a, 0, 0x90, 7, periph)
/* pa0_qd3_out */
#define PA0_QD3_OUT MCHP_PINMUX(a, 0, 0x200, 25, periph)
/* pa0_qspics_out */
#define PA0_QSPICS_OUT MCHP_PINMUX(a, 0, 0x200, 23, periph)
/* pa0_scom0p0_in */
#define PA0_SCOM0P0_IN MCHP_PINMUX(a, 0, 0x40, 15, periph)
/* pa0_scom0p0_out */
#define PA0_SCOM0P0_OUT MCHP_PINMUX(a, 0, 0x200, 1, periph)
/* pa0_scom0p2_out */
#define PA0_SCOM0P2_OUT MCHP_PINMUX(a, 0, 0x200, 3, periph)
/* pa0_scom0p3_out */
#define PA0_SCOM0P3_OUT MCHP_PINMUX(a, 0, 0x200, 2, periph)
/* pa0_scom1p0_in */
#define PA0_SCOM1P0_IN MCHP_PINMUX(a, 0, 0x50, 7, periph)
/* pa0_scom1p2_out */
#define PA0_SCOM1P2_OUT MCHP_PINMUX(a, 0, 0x200, 6, periph)
/* pa0_scom1p3_in */
#define PA0_SCOM1P3_IN MCHP_PINMUX(a, 0, 0x5c, 15, periph)
/* pa0_scom1p3_out */
#define PA0_SCOM1P3_OUT MCHP_PINMUX(a, 0, 0x200, 5, periph)
/* pa0_tc0wo0g2_in */
#define PA0_TC0WO0G2_IN MCHP_PINMUX(a, 0, 0xb4, 15, periph)
/* pa0_tc0wo0_out */
#define PA0_TC0WO0_OUT MCHP_PINMUX(a, 0, 0x204, 15, periph)
/* pa0_tc0wo1g3_in */
#define PA0_TC0WO1G3_IN MCHP_PINMUX(a, 0, 0xb8, 7, periph)
/* pa0_tc0wo1_out */
#define PA0_TC0WO1_OUT MCHP_PINMUX(a, 0, 0x200, 15, periph)
/* pa0_tc1wo0_out */
#define PA0_TC1WO0_OUT MCHP_PINMUX(a, 0, 0x204, 16, periph)
/* pa0_tc1wo1g2_in */
#define PA0_TC1WO1G2_IN MCHP_PINMUX(a, 0, 0xc4, 15, periph)
/* pa0_tc1wo1_out */
#define PA0_TC1WO1_OUT MCHP_PINMUX(a, 0, 0x200, 16, periph)
/* pa0_tc2wo0g3_in */
#define PA0_TC2WO0G3_IN MCHP_PINMUX(a, 0, 0xcc, 7, periph)
/* pa0_tc2wo0_out */
#define PA0_TC2WO0_OUT MCHP_PINMUX(a, 0, 0x204, 17, periph)
/* pa0_tc2wo1g2_in */
#define PA0_TC2WO1G2_IN MCHP_PINMUX(a, 0, 0xd0, 15, periph)
/* pa0_tc2wo1_out */
#define PA0_TC2WO1_OUT MCHP_PINMUX(a, 0, 0x200, 17, periph)
/* pa0_tc3wo0g3_in */
#define PA0_TC3WO0G3_IN MCHP_PINMUX(a, 0, 0xdc, 7, periph)
/* pa0_tc3wo0_out */
#define PA0_TC3WO0_OUT MCHP_PINMUX(a, 0, 0x204, 18, periph)
/* pa0_tc3wo1g2_in */
#define PA0_TC3WO1G2_IN MCHP_PINMUX(a, 0, 0xe0, 15, periph)
/* pa0_tc3wo1_out */
#define PA0_TC3WO1_OUT MCHP_PINMUX(a, 0, 0x200, 18, periph)
/* pa0_tc4wo0g3_in */
#define PA0_TC4WO0G3_IN MCHP_PINMUX(a, 0, 0xec, 7, periph)
/* pa0_tc4wo0_out */
#define PA0_TC4WO0_OUT MCHP_PINMUX(a, 0, 0x204, 19, periph)
/* pa0_tc4wo1g2_in */
#define PA0_TC4WO1G2_IN MCHP_PINMUX(a, 0, 0xf0, 15, periph)
/* pa0_tc4wo1_out */
#define PA0_TC4WO1_OUT MCHP_PINMUX(a, 0, 0x200, 19, periph)
/* pa0_tc5wo0g3_in */
#define PA0_TC5WO0G3_IN MCHP_PINMUX(a, 0, 0xfc, 7, periph)
/* pa0_tc5wo0_out */
#define PA0_TC5WO0_OUT MCHP_PINMUX(a, 0, 0x204, 20, periph)
/* pa0_tc5wo1g2_in */
#define PA0_TC5WO1G2_IN MCHP_PINMUX(a, 0, 0x100, 15, periph)
/* pa0_tc5wo1_out */
#define PA0_TC5WO1_OUT MCHP_PINMUX(a, 0, 0x200, 20, periph)
/* pa0_tc6wo0g3_in */
#define PA0_TC6WO0G3_IN MCHP_PINMUX(a, 0, 0x10c, 7, periph)
/* pa0_tc6wo0_out */
#define PA0_TC6WO0_OUT MCHP_PINMUX(a, 0, 0x204, 21, periph)
/* pa0_tc6wo1g2_in */
#define PA0_TC6WO1G2_IN MCHP_PINMUX(a, 0, 0x110, 15, periph)
/* pa0_tc6wo1_out */
#define PA0_TC6WO1_OUT MCHP_PINMUX(a, 0, 0x200, 21, periph)
/* pa0_tc7wo0g3_in */
#define PA0_TC7WO0G3_IN MCHP_PINMUX(a, 0, 0x11c, 7, periph)
/* pa0_tc7wo0_out */
#define PA0_TC7WO0_OUT MCHP_PINMUX(a, 0, 0x204, 22, periph)
/* pa0_tc7wo1g2_in */
#define PA0_TC7WO1G2_IN MCHP_PINMUX(a, 0, 0x120, 15, periph)
/* pa0_tc7wo1_out */
#define PA0_TC7WO1_OUT MCHP_PINMUX(a, 0, 0x200, 22, periph)
/* pa0_tcc0wo0_out */
#define PA0_TCC0WO0_OUT MCHP_PINMUX(a, 0, 0x204, 8, periph)
/* pa0_tcc0wo1_out */
#define PA0_TCC0WO1_OUT MCHP_PINMUX(a, 0, 0x200, 7, periph)
/* pa0_tcc0wo2_out */
#define PA0_TCC0WO2_OUT MCHP_PINMUX(a, 0, 0x204, 7, periph)
/* pa0_tcc0wo3_out */
#define PA0_TCC0WO3_OUT MCHP_PINMUX(a, 0, 0x200, 9, periph)
/* pa0_tcc0wo4_out */
#define PA0_TCC0WO4_OUT MCHP_PINMUX(a, 0, 0x204, 9, periph)
/* pa0_tcc0wo5_out */
#define PA0_TCC0WO5_OUT MCHP_PINMUX(a, 0, 0x200, 8, periph)
/* pa0_tcc1wo0_out */
#define PA0_TCC1WO0_OUT MCHP_PINMUX(a, 0, 0x204, 11, periph)
/* pa0_tcc1wo1_out */
#define PA0_TCC1WO1_OUT MCHP_PINMUX(a, 0, 0x200, 10, periph)
/* pa0_tcc1wo2_out */
#define PA0_TCC1WO2_OUT MCHP_PINMUX(a, 0, 0x204, 10, periph)
/* pa0_tcc1wo3_out */
#define PA0_TCC1WO3_OUT MCHP_PINMUX(a, 0, 0x200, 12, periph)
/* pa0_tcc1wo4_out */
#define PA0_TCC1WO4_OUT MCHP_PINMUX(a, 0, 0x204, 12, periph)
/* pa0_tcc1wo5_out */
#define PA0_TCC1WO5_OUT MCHP_PINMUX(a, 0, 0x200, 11, periph)
/* pa0_tcc2wo0_out */
#define PA0_TCC2WO0_OUT MCHP_PINMUX(a, 0, 0x204, 13, periph)
/* pa0_tcc2wo1_out */
#define PA0_TCC2WO1_OUT MCHP_PINMUX(a, 0, 0x200, 13, periph)
/* pa1_cclin2_in */
#define PA1_CCLIN2_IN MCHP_PINMUX(a, 1, 0xa0, 15, periph)
/* pa1_cclin5_in */
#define PA1_CCLIN5_IN MCHP_PINMUX(a, 1, 0xac, 15, periph)
/* pa1_cclout0_out */
#define PA1_CCLOUT0_OUT MCHP_PINMUX(a, 1, 0x208, 27, periph)
/* pa1_cclout1_out */
#define PA1_CCLOUT1_OUT MCHP_PINMUX(a, 1, 0x20c, 27, periph)
/* pa1_extint2_in */
#define PA1_EXTINT2_IN MCHP_PINMUX(a, 1, 0x8, 15, periph)
/* pa1_extint3_in */
#define PA1_EXTINT3_IN MCHP_PINMUX(a, 1, 0xc, 7, periph)
/* pa1_nmi_in */
#define PA1_NMI_IN MCHP_PINMUX(a, 1, 0x3c, 7, periph)
/* pa1_qcs_out */
#define PA1_QCS_OUT MCHP_PINMUX(a, 1, 0x208, 23, periph)
/* pa1_qd0_in */
#define PA1_QD0_IN MCHP_PINMUX(a, 1, 0x84, 7, periph)
/* pa1_qd0_out */
#define PA1_QD0_OUT MCHP_PINMUX(a, 1, 0x208, 25, periph)
/* pa1_qd1_out */
#define PA1_QD1_OUT MCHP_PINMUX(a, 1, 0x208, 24, periph)
/* pa1_qd2_out */
#define PA1_QD2_OUT MCHP_PINMUX(a, 1, 0x20c, 24, periph)
/* pa1_qd3_in */
#define PA1_QD3_IN MCHP_PINMUX(a, 1, 0x90, 15, periph)
/* pa1_qd3_out */
#define PA1_QD3_OUT MCHP_PINMUX(a, 1, 0x208, 26, periph)
/* pa1_scom0p0_out */
#define PA1_SCOM0P0_OUT MCHP_PINMUX(a, 1, 0x208, 2, periph)
/* pa1_scom0p2_in */
#define PA1_SCOM0P2_IN MCHP_PINMUX(a, 1, 0x48, 7, periph)
/* pa1_scom0p2_out */
#define PA1_SCOM0P2_OUT MCHP_PINMUX(a, 1, 0x20c, 1, periph)
/* pa1_scom0p3_out */
#define PA1_SCOM0P3_OUT MCHP_PINMUX(a, 1, 0x208, 3, periph)
/* pa1_scom1p0_in */
#define PA1_SCOM1P0_IN MCHP_PINMUX(a, 1, 0x50, 15, periph)
/* pa1_scom1p0_out */
#define PA1_SCOM1P0_OUT MCHP_PINMUX(a, 1, 0x20c, 6, periph)
/* pa1_scom1p2_out */
#define PA1_SCOM1P2_OUT MCHP_PINMUX(a, 1, 0x208, 4, periph)
/* pa1_scom1p3_out */
#define PA1_SCOM1P3_OUT MCHP_PINMUX(a, 1, 0x208, 6, periph)
/* pa1_tc0wo0_out */
#define PA1_TC0WO0_OUT MCHP_PINMUX(a, 1, 0x208, 15, periph)
/* pa1_tc0wo1g3_in */
#define PA1_TC0WO1G3_IN MCHP_PINMUX(a, 1, 0xb8, 15, periph)
/* pa1_tc0wo1g4_in */
#define PA1_TC0WO1G4_IN MCHP_PINMUX(a, 1, 0xbc, 7, periph)
/* pa1_tc1wo0_out */
#define PA1_TC1WO0_OUT MCHP_PINMUX(a, 1, 0x208, 16, periph)
/* pa1_tc1wo1_out */
#define PA1_TC1WO1_OUT MCHP_PINMUX(a, 1, 0x20c, 16, periph)
/* pa1_tc2wo0g3_in */
#define PA1_TC2WO0G3_IN MCHP_PINMUX(a, 1, 0xcc, 15, periph)
/* pa1_tc2wo0_out */
#define PA1_TC2WO0_OUT MCHP_PINMUX(a, 1, 0x208, 17, periph)
/* pa1_tc2wo1g4_in */
#define PA1_TC2WO1G4_IN MCHP_PINMUX(a, 1, 0xd4, 7, periph)
/* pa1_tc2wo1_out */
#define PA1_TC2WO1_OUT MCHP_PINMUX(a, 1, 0x20c, 17, periph)
/* pa1_tc3wo0g3_in */
#define PA1_TC3WO0G3_IN MCHP_PINMUX(a, 1, 0xdc, 15, periph)
/* pa1_tc3wo0_out */
#define PA1_TC3WO0_OUT MCHP_PINMUX(a, 1, 0x208, 18, periph)
/* pa1_tc3wo1g4_in */
#define PA1_TC3WO1G4_IN MCHP_PINMUX(a, 1, 0xe4, 7, periph)
/* pa1_tc3wo1_out */
#define PA1_TC3WO1_OUT MCHP_PINMUX(a, 1, 0x20c, 18, periph)
/* pa1_tc4wo0g3_in */
#define PA1_TC4WO0G3_IN MCHP_PINMUX(a, 1, 0xec, 15, periph)
/* pa1_tc4wo0_out */
#define PA1_TC4WO0_OUT MCHP_PINMUX(a, 1, 0x208, 19, periph)
/* pa1_tc4wo1g4_in */
#define PA1_TC4WO1G4_IN MCHP_PINMUX(a, 1, 0xf4, 7, periph)
/* pa1_tc4wo1_out */
#define PA1_TC4WO1_OUT MCHP_PINMUX(a, 1, 0x20c, 19, periph)
/* pa1_tc5wo0g3_in */
#define PA1_TC5WO0G3_IN MCHP_PINMUX(a, 1, 0xfc, 15, periph)
/* pa1_tc5wo0_out */
#define PA1_TC5WO0_OUT MCHP_PINMUX(a, 1, 0x208, 20, periph)
/* pa1_tc5wo1g4_in */
#define PA1_TC5WO1G4_IN MCHP_PINMUX(a, 1, 0x104, 7, periph)
/* pa1_tc5wo1_out */
#define PA1_TC5WO1_OUT MCHP_PINMUX(a, 1, 0x20c, 20, periph)
/* pa1_tc6wo0g3_in */
#define PA1_TC6WO0G3_IN MCHP_PINMUX(a, 1, 0x10c, 15, periph)
/* pa1_tc6wo0_out */
#define PA1_TC6WO0_OUT MCHP_PINMUX(a, 1, 0x208, 21, periph)
/* pa1_tc6wo1g4_in */
#define PA1_TC6WO1G4_IN MCHP_PINMUX(a, 1, 0x114, 7, periph)
/* pa1_tc6wo1_out */
#define PA1_TC6WO1_OUT MCHP_PINMUX(a, 1, 0x20c, 21, periph)
/* pa1_tc7wo0g3_in */
#define PA1_TC7WO0G3_IN MCHP_PINMUX(a, 1, 0x11c, 15, periph)
/* pa1_tc7wo0_out */
#define PA1_TC7WO0_OUT MCHP_PINMUX(a, 1, 0x208, 22, periph)
/* pa1_tc7wo1g4_in */
#define PA1_TC7WO1G4_IN MCHP_PINMUX(a, 1, 0x124, 7, periph)
/* pa1_tc7wo1_out */
#define PA1_TC7WO1_OUT MCHP_PINMUX(a, 1, 0x20c, 22, periph)
/* pa1_tcc0wo0_out */
#define PA1_TCC0WO0_OUT MCHP_PINMUX(a, 1, 0x208, 8, periph)
/* pa1_tcc0wo1_out */
#define PA1_TCC0WO1_OUT MCHP_PINMUX(a, 1, 0x20c, 8, periph)
/* pa1_tcc0wo2_out */
#define PA1_TCC0WO2_OUT MCHP_PINMUX(a, 1, 0x208, 7, periph)
/* pa1_tcc0wo3_out */
#define PA1_TCC0WO3_OUT MCHP_PINMUX(a, 1, 0x20c, 7, periph)
/* pa1_tcc0wo4_out */
#define PA1_TCC0WO4_OUT MCHP_PINMUX(a, 1, 0x208, 9, periph)
/* pa1_tcc0wo5_out */
#define PA1_TCC0WO5_OUT MCHP_PINMUX(a, 1, 0x20c, 9, periph)
/* pa1_tcc1wo0_out */
#define PA1_TCC1WO0_OUT MCHP_PINMUX(a, 1, 0x208, 11, periph)
/* pa1_tcc1wo1_out */
#define PA1_TCC1WO1_OUT MCHP_PINMUX(a, 1, 0x20c, 11, periph)
/* pa1_tcc1wo2_out */
#define PA1_TCC1WO2_OUT MCHP_PINMUX(a, 1, 0x208, 10, periph)
/* pa1_tcc1wo3_out */
#define PA1_TCC1WO3_OUT MCHP_PINMUX(a, 1, 0x20c, 10, periph)
/* pa1_tcc1wo4_out */
#define PA1_TCC1WO4_OUT MCHP_PINMUX(a, 1, 0x208, 12, periph)
/* pa1_tcc1wo5_out */
#define PA1_TCC1WO5_OUT MCHP_PINMUX(a, 1, 0x20c, 12, periph)
/* pa1_tcc2wo0_out */
#define PA1_TCC2WO0_OUT MCHP_PINMUX(a, 1, 0x208, 13, periph)
/* pa1_tcc2wo1_out */
#define PA1_TCC2WO1_OUT MCHP_PINMUX(a, 1, 0x20c, 13, periph)
/* pa2_cclin0_in */
#define PA2_CCLIN0_IN MCHP_PINMUX(a, 2, 0x98, 8, periph)
/* pa2_cclin3_in */
#define PA2_CCLIN3_IN MCHP_PINMUX(a, 2, 0xa4, 8, periph)
/* pa2_cclout1_out */
#define PA2_CCLOUT1_OUT MCHP_PINMUX(a, 2, 0x214, 27, periph)
/* pa2_extint0_in */
#define PA2_EXTINT0_IN MCHP_PINMUX(a, 2, 0x0, 8, periph)
/* pa2_extint3_in */
#define PA2_EXTINT3_IN MCHP_PINMUX(a, 2, 0xc, 15, periph)
/* pa2_nmi_in */
#define PA2_NMI_IN MCHP_PINMUX(a, 2, 0x3c, 15, periph)
/* pa2_qcs_out */
#define PA2_QCS_OUT MCHP_PINMUX(a, 2, 0x214, 23, periph)
/* pa2_qd0_in */
#define PA2_QD0_IN MCHP_PINMUX(a, 2, 0x84, 15, periph)
/* pa2_qd0_out */
#define PA2_QD0_OUT MCHP_PINMUX(a, 2, 0x214, 26, periph)
/* pa2_qd1_in */
#define PA2_QD1_IN MCHP_PINMUX(a, 2, 0x88, 8, periph)
/* pa2_qd1_out */
#define PA2_QD1_OUT MCHP_PINMUX(a, 2, 0x214, 25, periph)
/* pa2_qd2_out */
#define PA2_QD2_OUT MCHP_PINMUX(a, 2, 0x214, 24, periph)
/* pa2_scom0p0_out */
#define PA2_SCOM0P0_OUT MCHP_PINMUX(a, 2, 0x214, 3, periph)
/* pa2_scom0p2_in */
#define PA2_SCOM0P2_IN MCHP_PINMUX(a, 2, 0x48, 15, periph)
/* pa2_scom0p2_out */
#define PA2_SCOM0P2_OUT MCHP_PINMUX(a, 2, 0x214, 1, periph)
/* pa2_scom0p3_in */
#define PA2_SCOM0P3_IN MCHP_PINMUX(a, 2, 0x4c, 8, periph)
/* pa2_scom1p0_out */
#define PA2_SCOM1P0_OUT MCHP_PINMUX(a, 2, 0x214, 6, periph)
/* pa2_scom1p2_in */
#define PA2_SCOM1P2_IN MCHP_PINMUX(a, 2, 0x58, 8, periph)
/* pa2_scom1p3_out */
#define PA2_SCOM1P3_OUT MCHP_PINMUX(a, 2, 0x214, 4, periph)
/* pa2_tc0wo0g1_in */
#define PA2_TC0WO0G1_IN MCHP_PINMUX(a, 2, 0xb0, 8, periph)
/* pa2_tc0wo0_out */
#define PA2_TC0WO0_OUT MCHP_PINMUX(a, 2, 0x214, 15, periph)
/* pa2_tc0wo1g4_in */
#define PA2_TC0WO1G4_IN MCHP_PINMUX(a, 2, 0xbc, 15, periph)
/* pa2_tc1wo0g1_in */
#define PA2_TC1WO0G1_IN MCHP_PINMUX(a, 2, 0xc0, 8, periph)
/* pa2_tc1wo1_out */
#define PA2_TC1WO1_OUT MCHP_PINMUX(a, 2, 0x214, 16, periph)
/* pa2_tc2wo0g1_in */
#define PA2_TC2WO0G1_IN MCHP_PINMUX(a, 2, 0xc8, 8, periph)
/* pa2_tc2wo1g4_in */
#define PA2_TC2WO1G4_IN MCHP_PINMUX(a, 2, 0xd4, 15, periph)
/* pa2_tc2wo1_out */
#define PA2_TC2WO1_OUT MCHP_PINMUX(a, 2, 0x214, 17, periph)
/* pa2_tc3wo0g1_in */
#define PA2_TC3WO0G1_IN MCHP_PINMUX(a, 2, 0xd8, 8, periph)
/* pa2_tc3wo1g4_in */
#define PA2_TC3WO1G4_IN MCHP_PINMUX(a, 2, 0xe4, 15, periph)
/* pa2_tc3wo1_out */
#define PA2_TC3WO1_OUT MCHP_PINMUX(a, 2, 0x214, 18, periph)
/* pa2_tc4wo0g1_in */
#define PA2_TC4WO0G1_IN MCHP_PINMUX(a, 2, 0xe8, 8, periph)
/* pa2_tc4wo1g4_in */
#define PA2_TC4WO1G4_IN MCHP_PINMUX(a, 2, 0xf4, 15, periph)
/* pa2_tc4wo1_out */
#define PA2_TC4WO1_OUT MCHP_PINMUX(a, 2, 0x214, 19, periph)
/* pa2_tc5wo0g1_in */
#define PA2_TC5WO0G1_IN MCHP_PINMUX(a, 2, 0xf8, 8, periph)
/* pa2_tc5wo1g4_in */
#define PA2_TC5WO1G4_IN MCHP_PINMUX(a, 2, 0x104, 15, periph)
/* pa2_tc5wo1_out */
#define PA2_TC5WO1_OUT MCHP_PINMUX(a, 2, 0x214, 20, periph)
/* pa2_tc6wo0g1_in */
#define PA2_TC6WO0G1_IN MCHP_PINMUX(a, 2, 0x108, 8, periph)
/* pa2_tc6wo1g4_in */
#define PA2_TC6WO1G4_IN MCHP_PINMUX(a, 2, 0x114, 15, periph)
/* pa2_tc6wo1_out */
#define PA2_TC6WO1_OUT MCHP_PINMUX(a, 2, 0x214, 21, periph)
/* pa2_tc7wo0g1_in */
#define PA2_TC7WO0G1_IN MCHP_PINMUX(a, 2, 0x118, 8, periph)
/* pa2_tc7wo1g4_in */
#define PA2_TC7WO1G4_IN MCHP_PINMUX(a, 2, 0x124, 15, periph)
/* pa2_tc7wo1_out */
#define PA2_TC7WO1_OUT MCHP_PINMUX(a, 2, 0x214, 22, periph)
/* pa2_tcc0wo1_out */
#define PA2_TCC0WO1_OUT MCHP_PINMUX(a, 2, 0x214, 8, periph)
/* pa2_tcc0wo3_out */
#define PA2_TCC0WO3_OUT MCHP_PINMUX(a, 2, 0x214, 7, periph)
/* pa2_tcc0wo5_out */
#define PA2_TCC0WO5_OUT MCHP_PINMUX(a, 2, 0x214, 9, periph)
/* pa2_tcc1wo1_out */
#define PA2_TCC1WO1_OUT MCHP_PINMUX(a, 2, 0x214, 11, periph)
/* pa2_tcc1wo3_out */
#define PA2_TCC1WO3_OUT MCHP_PINMUX(a, 2, 0x214, 10, periph)
/* pa2_tcc1wo5_out */
#define PA2_TCC1WO5_OUT MCHP_PINMUX(a, 2, 0x214, 12, periph)
/* pa2_tcc2wo1_out */
#define PA2_TCC2WO1_OUT MCHP_PINMUX(a, 2, 0x214, 13, periph)
/* pa3_cclin0_in */
#define PA3_CCLIN0_IN MCHP_PINMUX(a, 3, 0x98, 1, periph)
/* pa3_cclin1_in */
#define PA3_CCLIN1_IN MCHP_PINMUX(a, 3, 0x9c, 8, periph)
/* pa3_cclin3_in */
#define PA3_CCLIN3_IN MCHP_PINMUX(a, 3, 0xa4, 1, periph)
/* pa3_cclin4_in */
#define PA3_CCLIN4_IN MCHP_PINMUX(a, 3, 0xa8, 8, periph)
/* pa3_cclout0_out */
#define PA3_CCLOUT0_OUT MCHP_PINMUX(a, 3, 0x220, 27, periph)
/* pa3_cclout1_out */
#define PA3_CCLOUT1_OUT MCHP_PINMUX(a, 3, 0x21c, 27, periph)
/* pa3_extint0_in */
#define PA3_EXTINT0_IN MCHP_PINMUX(a, 3, 0x0, 1, periph)
/* pa3_extint1_in */
#define PA3_EXTINT1_IN MCHP_PINMUX(a, 3, 0x4, 8, periph)
/* pa3_qcs_out */
#define PA3_QCS_OUT MCHP_PINMUX(a, 3, 0x220, 23, periph)
/* pa3_qd0_out */
#define PA3_QD0_OUT MCHP_PINMUX(a, 3, 0x21c, 24, periph)
/* pa3_qd1_in */
#define PA3_QD1_IN MCHP_PINMUX(a, 3, 0x88, 1, periph)
/* pa3_qd1_out */
#define PA3_QD1_OUT MCHP_PINMUX(a, 3, 0x220, 24, periph)
/* pa3_qd2_in */
#define PA3_QD2_IN MCHP_PINMUX(a, 3, 0x8c, 8, periph)
/* pa3_qd2_out */
#define PA3_QD2_OUT MCHP_PINMUX(a, 3, 0x21c, 26, periph)
/* pa3_qd3_out */
#define PA3_QD3_OUT MCHP_PINMUX(a, 3, 0x21c, 25, periph)
/* pa3_qsck_out */
#define PA3_QSCK_OUT MCHP_PINMUX(a, 3, 0x218, 7, periph)
/* pa3_qspics_out */
#define PA3_QSPICS_OUT MCHP_PINMUX(a, 3, 0x21c, 23, periph)
/* pa3_refi_in */
#define PA3_REFI_IN MCHP_PINMUX(a, 3, 0x94, 1, periph)
/* pa3_refo1_out */
#define PA3_REFO1_OUT MCHP_PINMUX(a, 3, 0x218, 3, periph)
/* pa3_refo2_out */
#define PA3_REFO2_OUT MCHP_PINMUX(a, 3, 0x218, 4, periph)
/* pa3_refo3_out */
#define PA3_REFO3_OUT MCHP_PINMUX(a, 3, 0x218, 5, periph)
/* pa3_refo4_out */
#define PA3_REFO4_OUT MCHP_PINMUX(a, 3, 0x218, 6, periph)
/* pa3_scom0p0_in */
#define PA3_SCOM0P0_IN MCHP_PINMUX(a, 3, 0x40, 8, periph)
/* pa3_scom0p0_out */
#define PA3_SCOM0P0_OUT MCHP_PINMUX(a, 3, 0x21c, 1, periph)
/* pa3_scom0p1_in */
#define PA3_SCOM0P1_IN MCHP_PINMUX(a, 3, 0x44, 1, periph)
/* pa3_scom0p1_out */
#define PA3_SCOM0P1_OUT MCHP_PINMUX(a, 3, 0x218, 1, periph)
/* pa3_scom0p2_out */
#define PA3_SCOM0P2_OUT MCHP_PINMUX(a, 3, 0x21c, 3, periph)
/* pa3_scom0p3_in */
#define PA3_SCOM0P3_IN MCHP_PINMUX(a, 3, 0x4c, 1, periph)
/* pa3_scom0p3_out */
#define PA3_SCOM0P3_OUT MCHP_PINMUX(a, 3, 0x21c, 2, periph)
/* pa3_scom1p1_in */
#define PA3_SCOM1P1_IN MCHP_PINMUX(a, 3, 0x54, 1, periph)
/* pa3_scom1p1_out */
#define PA3_SCOM1P1_OUT MCHP_PINMUX(a, 3, 0x218, 2, periph)
/* pa3_scom1p2_in */
#define PA3_SCOM1P2_IN MCHP_PINMUX(a, 3, 0x58, 1, periph)
/* pa3_scom1p2_out */
#define PA3_SCOM1P2_OUT MCHP_PINMUX(a, 3, 0x21c, 6, periph)
/* pa3_scom1p3_in */
#define PA3_SCOM1P3_IN MCHP_PINMUX(a, 3, 0x5c, 8, periph)
/* pa3_scom1p3_out */
#define PA3_SCOM1P3_OUT MCHP_PINMUX(a, 3, 0x21c, 5, periph)
/* pa3_tc0wo0g1_in */
#define PA3_TC0WO0G1_IN MCHP_PINMUX(a, 3, 0xb0, 1, periph)
/* pa3_tc0wo0g2_in */
#define PA3_TC0WO0G2_IN MCHP_PINMUX(a, 3, 0xb4, 8, periph)
/* pa3_tc0wo0_out */
#define PA3_TC0WO0_OUT MCHP_PINMUX(a, 3, 0x220, 15, periph)
/* pa3_tc0wo1_out */
#define PA3_TC0WO1_OUT MCHP_PINMUX(a, 3, 0x21c, 15, periph)
/* pa3_tc1wo0g1_in */
#define PA3_TC1WO0G1_IN MCHP_PINMUX(a, 3, 0xc0, 1, periph)
/* pa3_tc1wo0_out */
#define PA3_TC1WO0_OUT MCHP_PINMUX(a, 3, 0x220, 16, periph)
/* pa3_tc1wo1g2_in */
#define PA3_TC1WO1G2_IN MCHP_PINMUX(a, 3, 0xc4, 8, periph)
/* pa3_tc1wo1_out */
#define PA3_TC1WO1_OUT MCHP_PINMUX(a, 3, 0x21c, 16, periph)
/* pa3_tc2wo0g1_in */
#define PA3_TC2WO0G1_IN MCHP_PINMUX(a, 3, 0xc8, 1, periph)
/* pa3_tc2wo0_out */
#define PA3_TC2WO0_OUT MCHP_PINMUX(a, 3, 0x220, 17, periph)
/* pa3_tc2wo1g2_in */
#define PA3_TC2WO1G2_IN MCHP_PINMUX(a, 3, 0xd0, 8, periph)
/* pa3_tc2wo1_out */
#define PA3_TC2WO1_OUT MCHP_PINMUX(a, 3, 0x21c, 17, periph)
/* pa3_tc3wo0g1_in */
#define PA3_TC3WO0G1_IN MCHP_PINMUX(a, 3, 0xd8, 1, periph)
/* pa3_tc3wo0_out */
#define PA3_TC3WO0_OUT MCHP_PINMUX(a, 3, 0x220, 18, periph)
/* pa3_tc3wo1g2_in */
#define PA3_TC3WO1G2_IN MCHP_PINMUX(a, 3, 0xe0, 8, periph)
/* pa3_tc3wo1_out */
#define PA3_TC3WO1_OUT MCHP_PINMUX(a, 3, 0x21c, 18, periph)
/* pa3_tc4wo0g1_in */
#define PA3_TC4WO0G1_IN MCHP_PINMUX(a, 3, 0xe8, 1, periph)
/* pa3_tc4wo0_out */
#define PA3_TC4WO0_OUT MCHP_PINMUX(a, 3, 0x220, 19, periph)
/* pa3_tc4wo1g2_in */
#define PA3_TC4WO1G2_IN MCHP_PINMUX(a, 3, 0xf0, 8, periph)
/* pa3_tc4wo1_out */
#define PA3_TC4WO1_OUT MCHP_PINMUX(a, 3, 0x21c, 19, periph)
/* pa3_tc5wo0g1_in */
#define PA3_TC5WO0G1_IN MCHP_PINMUX(a, 3, 0xf8, 1, periph)
/* pa3_tc5wo0_out */
#define PA3_TC5WO0_OUT MCHP_PINMUX(a, 3, 0x220, 20, periph)
/* pa3_tc5wo1g2_in */
#define PA3_TC5WO1G2_IN MCHP_PINMUX(a, 3, 0x100, 8, periph)
/* pa3_tc5wo1_out */
#define PA3_TC5WO1_OUT MCHP_PINMUX(a, 3, 0x21c, 20, periph)
/* pa3_tc6wo0g1_in */
#define PA3_TC6WO0G1_IN MCHP_PINMUX(a, 3, 0x108, 1, periph)
/* pa3_tc6wo0_out */
#define PA3_TC6WO0_OUT MCHP_PINMUX(a, 3, 0x220, 21, periph)
/* pa3_tc6wo1g2_in */
#define PA3_TC6WO1G2_IN MCHP_PINMUX(a, 3, 0x110, 8, periph)
/* pa3_tc6wo1_out */
#define PA3_TC6WO1_OUT MCHP_PINMUX(a, 3, 0x21c, 21, periph)
/* pa3_tc7wo0g1_in */
#define PA3_TC7WO0G1_IN MCHP_PINMUX(a, 3, 0x118, 1, periph)
/* pa3_tc7wo0_out */
#define PA3_TC7WO0_OUT MCHP_PINMUX(a, 3, 0x220, 22, periph)
/* pa3_tc7wo1g2_in */
#define PA3_TC7WO1G2_IN MCHP_PINMUX(a, 3, 0x120, 8, periph)
/* pa3_tc7wo1_out */
#define PA3_TC7WO1_OUT MCHP_PINMUX(a, 3, 0x21c, 22, periph)
/* pa3_tcc0wo0_out */
#define PA3_TCC0WO0_OUT MCHP_PINMUX(a, 3, 0x220, 8, periph)
/* pa3_tcc0wo1_out */
#define PA3_TCC0WO1_OUT MCHP_PINMUX(a, 3, 0x21c, 7, periph)
/* pa3_tcc0wo2_out */
#define PA3_TCC0WO2_OUT MCHP_PINMUX(a, 3, 0x220, 7, periph)
/* pa3_tcc0wo3_out */
#define PA3_TCC0WO3_OUT MCHP_PINMUX(a, 3, 0x21c, 9, periph)
/* pa3_tcc0wo4_out */
#define PA3_TCC0WO4_OUT MCHP_PINMUX(a, 3, 0x220, 9, periph)
/* pa3_tcc0wo5_out */
#define PA3_TCC0WO5_OUT MCHP_PINMUX(a, 3, 0x21c, 8, periph)
/* pa3_tcc1wo0_out */
#define PA3_TCC1WO0_OUT MCHP_PINMUX(a, 3, 0x220, 11, periph)
/* pa3_tcc1wo1_out */
#define PA3_TCC1WO1_OUT MCHP_PINMUX(a, 3, 0x21c, 10, periph)
/* pa3_tcc1wo2_out */
#define PA3_TCC1WO2_OUT MCHP_PINMUX(a, 3, 0x220, 10, periph)
/* pa3_tcc1wo3_out */
#define PA3_TCC1WO3_OUT MCHP_PINMUX(a, 3, 0x21c, 12, periph)
/* pa3_tcc1wo4_out */
#define PA3_TCC1WO4_OUT MCHP_PINMUX(a, 3, 0x220, 12, periph)
/* pa3_tcc1wo5_out */
#define PA3_TCC1WO5_OUT MCHP_PINMUX(a, 3, 0x21c, 11, periph)
/* pa3_tcc2wo0_out */
#define PA3_TCC2WO0_OUT MCHP_PINMUX(a, 3, 0x220, 13, periph)
/* pa3_tcc2wo1_out */
#define PA3_TCC2WO1_OUT MCHP_PINMUX(a, 3, 0x21c, 13, periph)
/* pa4_cclin1_in */
#define PA4_CCLIN1_IN MCHP_PINMUX(a, 4, 0x9c, 1, periph)
/* pa4_cclin2_in */
#define PA4_CCLIN2_IN MCHP_PINMUX(a, 4, 0xa0, 8, periph)
/* pa4_cclin4_in */
#define PA4_CCLIN4_IN MCHP_PINMUX(a, 4, 0xa8, 1, periph)
/* pa4_cclin5_in */
#define PA4_CCLIN5_IN MCHP_PINMUX(a, 4, 0xac, 8, periph)
/* pa4_cclout0_out */
#define PA4_CCLOUT0_OUT MCHP_PINMUX(a, 4, 0x228, 27, periph)
/* pa4_cclout1_out */
#define PA4_CCLOUT1_OUT MCHP_PINMUX(a, 4, 0x224, 27, periph)
/* pa4_extint1_in */
#define PA4_EXTINT1_IN MCHP_PINMUX(a, 4, 0x4, 1, periph)
/* pa4_extint2_in */
#define PA4_EXTINT2_IN MCHP_PINMUX(a, 4, 0x8, 8, periph)
/* pa4_qcs_out */
#define PA4_QCS_OUT MCHP_PINMUX(a, 4, 0x228, 23, periph)
/* pa4_qd0_out */
#define PA4_QD0_OUT MCHP_PINMUX(a, 4, 0x224, 24, periph)
/* pa4_qd1_out */
#define PA4_QD1_OUT MCHP_PINMUX(a, 4, 0x228, 24, periph)
/* pa4_qd2_in */
#define PA4_QD2_IN MCHP_PINMUX(a, 4, 0x8c, 1, periph)
/* pa4_qd2_out */
#define PA4_QD2_OUT MCHP_PINMUX(a, 4, 0x224, 26, periph)
/* pa4_qd3_in */
#define PA4_QD3_IN MCHP_PINMUX(a, 4, 0x90, 8, periph)
/* pa4_qd3_out */
#define PA4_QD3_OUT MCHP_PINMUX(a, 4, 0x224, 25, periph)
/* pa4_qspics_out */
#define PA4_QSPICS_OUT MCHP_PINMUX(a, 4, 0x224, 23, periph)
/* pa4_scom0p0_in */
#define PA4_SCOM0P0_IN MCHP_PINMUX(a, 4, 0x40, 1, periph)
/* pa4_scom0p0_out */
#define PA4_SCOM0P0_OUT MCHP_PINMUX(a, 4, 0x224, 1, periph)
/* pa4_scom0p2_out */
#define PA4_SCOM0P2_OUT MCHP_PINMUX(a, 4, 0x224, 3, periph)
/* pa4_scom0p3_out */
#define PA4_SCOM0P3_OUT MCHP_PINMUX(a, 4, 0x224, 2, periph)
/* pa4_scom1p0_in */
#define PA4_SCOM1P0_IN MCHP_PINMUX(a, 4, 0x50, 8, periph)
/* pa4_scom1p0_out */
#define PA4_SCOM1P0_OUT MCHP_PINMUX(a, 4, 0x22c, 6, periph)
/* pa4_scom1p2_out */
