zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz3/pic32cx5109bz31048-pinctrl.h
#define PA8_TC3WO0G3_IN MCHP_PINMUX(a, 8, 0xdc, 9, periph)
/* pa8_tc3wo0_out */
#define PA8_TC3WO0_OUT MCHP_PINMUX(a, 8, 0x254, 18, periph)
/* pa8_tc3wo1g2_in */
#define PA8_TC3WO1G2_IN MCHP_PINMUX(a, 8, 0xe0, 2, periph)
/* pa8_tc3wo1g4_in */
#define PA8_TC3WO1G4_IN MCHP_PINMUX(a, 8, 0xe4, 14, periph)
/* pa8_tc3wo1_out */
#define PA8_TC3WO1_OUT MCHP_PINMUX(a, 8, 0x250, 18, periph)
/* pa8_tc4wo0g3_in */
#define PA8_TC4WO0G3_IN MCHP_PINMUX(a, 8, 0xec, 9, periph)
/* pa8_tc4wo0_out */
#define PA8_TC4WO0_OUT MCHP_PINMUX(a, 8, 0x254, 19, periph)
/* pa8_tc4wo1g2_in */
#define PA8_TC4WO1G2_IN MCHP_PINMUX(a, 8, 0xf0, 2, periph)
/* pa8_tc4wo1g4_in */
#define PA8_TC4WO1G4_IN MCHP_PINMUX(a, 8, 0xf4, 14, periph)
/* pa8_tc4wo1_out */
#define PA8_TC4WO1_OUT MCHP_PINMUX(a, 8, 0x250, 19, periph)
/* pa8_tc5wo0g3_in */
#define PA8_TC5WO0G3_IN MCHP_PINMUX(a, 8, 0xfc, 9, periph)
/* pa8_tc5wo0_out */
#define PA8_TC5WO0_OUT MCHP_PINMUX(a, 8, 0x254, 20, periph)
/* pa8_tc5wo1g2_in */
#define PA8_TC5WO1G2_IN MCHP_PINMUX(a, 8, 0x100, 2, periph)
/* pa8_tc5wo1g4_in */
#define PA8_TC5WO1G4_IN MCHP_PINMUX(a, 8, 0x104, 14, periph)
/* pa8_tc5wo1_out */
#define PA8_TC5WO1_OUT MCHP_PINMUX(a, 8, 0x250, 20, periph)
/* pa8_tc6wo0g3_in */
#define PA8_TC6WO0G3_IN MCHP_PINMUX(a, 8, 0x10c, 9, periph)
/* pa8_tc6wo0_out */
#define PA8_TC6WO0_OUT MCHP_PINMUX(a, 8, 0x254, 21, periph)
/* pa8_tc6wo1g2_in */
#define PA8_TC6WO1G2_IN MCHP_PINMUX(a, 8, 0x110, 2, periph)
/* pa8_tc6wo1g4_in */
#define PA8_TC6WO1G4_IN MCHP_PINMUX(a, 8, 0x114, 14, periph)
/* pa8_tc6wo1_out */
#define PA8_TC6WO1_OUT MCHP_PINMUX(a, 8, 0x250, 21, periph)
/* pa8_tc7wo0g3_in */
#define PA8_TC7WO0G3_IN MCHP_PINMUX(a, 8, 0x11c, 9, periph)
/* pa8_tc7wo0_out */
#define PA8_TC7WO0_OUT MCHP_PINMUX(a, 8, 0x254, 22, periph)
/* pa8_tc7wo1g2_in */
#define PA8_TC7WO1G2_IN MCHP_PINMUX(a, 8, 0x120, 2, periph)
/* pa8_tc7wo1g4_in */
#define PA8_TC7WO1G4_IN MCHP_PINMUX(a, 8, 0x124, 14, periph)
/* pa8_tc7wo1_out */
#define PA8_TC7WO1_OUT MCHP_PINMUX(a, 8, 0x250, 22, periph)
/* pa8_tcc0wo0_out */
#define PA8_TCC0WO0_OUT MCHP_PINMUX(a, 8, 0x254, 8, periph)
/* pa8_tcc0wo1_out */
#define PA8_TCC0WO1_OUT MCHP_PINMUX(a, 8, 0x250, 7, periph)
/* pa8_tcc0wo2_out */
#define PA8_TCC0WO2_OUT MCHP_PINMUX(a, 8, 0x254, 7, periph)
/* pa8_tcc0wo3_out */
#define PA8_TCC0WO3_OUT MCHP_PINMUX(a, 8, 0x250, 9, periph)
/* pa8_tcc0wo4_out */
#define PA8_TCC0WO4_OUT MCHP_PINMUX(a, 8, 0x254, 9, periph)
/* pa8_tcc0wo5_out */
#define PA8_TCC0WO5_OUT MCHP_PINMUX(a, 8, 0x250, 8, periph)
/* pa8_tcc1wo0_out */
#define PA8_TCC1WO0_OUT MCHP_PINMUX(a, 8, 0x254, 11, periph)
/* pa8_tcc1wo1_out */
#define PA8_TCC1WO1_OUT MCHP_PINMUX(a, 8, 0x250, 10, periph)
/* pa8_tcc1wo2_out */
#define PA8_TCC1WO2_OUT MCHP_PINMUX(a, 8, 0x254, 10, periph)
/* pa8_tcc1wo3_out */
#define PA8_TCC1WO3_OUT MCHP_PINMUX(a, 8, 0x250, 12, periph)
/* pa8_tcc1wo4_out */
#define PA8_TCC1WO4_OUT MCHP_PINMUX(a, 8, 0x254, 12, periph)
/* pa8_tcc1wo5_out */
#define PA8_TCC1WO5_OUT MCHP_PINMUX(a, 8, 0x250, 11, periph)
/* pa8_tcc2wo0_out */
#define PA8_TCC2WO0_OUT MCHP_PINMUX(a, 8, 0x254, 13, periph)
/* pa8_tcc2wo1_out */
#define PA8_TCC2WO1_OUT MCHP_PINMUX(a, 8, 0x250, 13, periph)
/* pa9_cclin0_in */
#define PA9_CCLIN0_IN MCHP_PINMUX(a, 9, 0x98, 15, periph)
/* pa9_cclin2_in */
#define PA9_CCLIN2_IN MCHP_PINMUX(a, 9, 0xa0, 2, periph)
/* pa9_cclin3_in */
#define PA9_CCLIN3_IN MCHP_PINMUX(a, 9, 0xa4, 15, periph)
/* pa9_cclin5_in */
#define PA9_CCLIN5_IN MCHP_PINMUX(a, 9, 0xac, 2, periph)
/* pa9_cclout0_out */
#define PA9_CCLOUT0_OUT MCHP_PINMUX(a, 9, 0x260, 27, periph)
/* pa9_cclout1_out */
#define PA9_CCLOUT1_OUT MCHP_PINMUX(a, 9, 0x264, 27, periph)
/* pa9_extint0_in */
#define PA9_EXTINT0_IN MCHP_PINMUX(a, 9, 0x0, 15, periph)
/* pa9_extint2_in */
#define PA9_EXTINT2_IN MCHP_PINMUX(a, 9, 0x8, 2, periph)
/* pa9_extint3_in */
#define PA9_EXTINT3_IN MCHP_PINMUX(a, 9, 0xc, 9, periph)
/* pa9_nmi_in */
#define PA9_NMI_IN MCHP_PINMUX(a, 9, 0x3c, 9, periph)
/* pa9_qcs_out */
#define PA9_QCS_OUT MCHP_PINMUX(a, 9, 0x260, 23, periph)
/* pa9_qd0_in */
#define PA9_QD0_IN MCHP_PINMUX(a, 9, 0x84, 9, periph)
/* pa9_qd0_out */
#define PA9_QD0_OUT MCHP_PINMUX(a, 9, 0x260, 25, periph)
/* pa9_qd1_in */
#define PA9_QD1_IN MCHP_PINMUX(a, 9, 0x88, 15, periph)
/* pa9_qd1_out */
#define PA9_QD1_OUT MCHP_PINMUX(a, 9, 0x260, 24, periph)
/* pa9_qd2_out */
#define PA9_QD2_OUT MCHP_PINMUX(a, 9, 0x264, 24, periph)
/* pa9_qd3_in */
#define PA9_QD3_IN MCHP_PINMUX(a, 9, 0x90, 2, periph)
/* pa9_qd3_out */
#define PA9_QD3_OUT MCHP_PINMUX(a, 9, 0x260, 26, periph)
/* pa9_scom0p0_out */
#define PA9_SCOM0P0_OUT MCHP_PINMUX(a, 9, 0x260, 2, periph)
/* pa9_scom0p2_in */
#define PA9_SCOM0P2_IN MCHP_PINMUX(a, 9, 0x48, 9, periph)
/* pa9_scom0p2_out */
#define PA9_SCOM0P2_OUT MCHP_PINMUX(a, 9, 0x264, 1, periph)
/* pa9_scom0p3_in */
#define PA9_SCOM0P3_IN MCHP_PINMUX(a, 9, 0x4c, 15, periph)
/* pa9_scom0p3_out */
#define PA9_SCOM0P3_OUT MCHP_PINMUX(a, 9, 0x260, 3, periph)
/* pa9_scom1p0_in */
#define PA9_SCOM1P0_IN MCHP_PINMUX(a, 9, 0x50, 2, periph)
/* pa9_scom1p0_out */
#define PA9_SCOM1P0_OUT MCHP_PINMUX(a, 9, 0x264, 6, periph)
/* pa9_scom1p2_in */
#define PA9_SCOM1P2_IN MCHP_PINMUX(a, 9, 0x58, 15, periph)
/* pa9_scom1p2_out */
#define PA9_SCOM1P2_OUT MCHP_PINMUX(a, 9, 0x260, 4, periph)
/* pa9_scom1p3_out */
#define PA9_SCOM1P3_OUT MCHP_PINMUX(a, 9, 0x260, 6, periph)
/* pa9_tc0wo0g1_in */
#define PA9_TC0WO0G1_IN MCHP_PINMUX(a, 9, 0xb0, 15, periph)
/* pa9_tc0wo0_out */
#define PA9_TC0WO0_OUT MCHP_PINMUX(a, 9, 0x260, 15, periph)
/* pa9_tc0wo1g3_in */
#define PA9_TC0WO1G3_IN MCHP_PINMUX(a, 9, 0xb8, 2, periph)
/* pa9_tc0wo1g4_in */
#define PA9_TC0WO1G4_IN MCHP_PINMUX(a, 9, 0xbc, 9, periph)
/* pa9_tc1wo0g1_in */
#define PA9_TC1WO0G1_IN MCHP_PINMUX(a, 9, 0xc0, 15, periph)
/* pa9_tc1wo0_out */
#define PA9_TC1WO0_OUT MCHP_PINMUX(a, 9, 0x260, 16, periph)
/* pa9_tc1wo1_out */
#define PA9_TC1WO1_OUT MCHP_PINMUX(a, 9, 0x264, 16, periph)
/* pa9_tc2wo0g1_in */
#define PA9_TC2WO0G1_IN MCHP_PINMUX(a, 9, 0xc8, 15, periph)
/* pa9_tc2wo0g3_in */
#define PA9_TC2WO0G3_IN MCHP_PINMUX(a, 9, 0xcc, 2, periph)
/* pa9_tc2wo0_out */
#define PA9_TC2WO0_OUT MCHP_PINMUX(a, 9, 0x260, 17, periph)
/* pa9_tc2wo1g4_in */
#define PA9_TC2WO1G4_IN MCHP_PINMUX(a, 9, 0xd4, 9, periph)
/* pa9_tc2wo1_out */
#define PA9_TC2WO1_OUT MCHP_PINMUX(a, 9, 0x264, 17, periph)
/* pa9_tc3wo0g1_in */
#define PA9_TC3WO0G1_IN MCHP_PINMUX(a, 9, 0xd8, 15, periph)
/* pa9_tc3wo0g3_in */
#define PA9_TC3WO0G3_IN MCHP_PINMUX(a, 9, 0xdc, 2, periph)
/* pa9_tc3wo0_out */
#define PA9_TC3WO0_OUT MCHP_PINMUX(a, 9, 0x260, 18, periph)
/* pa9_tc3wo1g4_in */
#define PA9_TC3WO1G4_IN MCHP_PINMUX(a, 9, 0xe4, 9, periph)
/* pa9_tc3wo1_out */
#define PA9_TC3WO1_OUT MCHP_PINMUX(a, 9, 0x264, 18, periph)
/* pa9_tc4wo0g1_in */
#define PA9_TC4WO0G1_IN MCHP_PINMUX(a, 9, 0xe8, 15, periph)
/* pa9_tc4wo0g3_in */
#define PA9_TC4WO0G3_IN MCHP_PINMUX(a, 9, 0xec, 2, periph)
/* pa9_tc4wo0_out */
#define PA9_TC4WO0_OUT MCHP_PINMUX(a, 9, 0x260, 19, periph)
/* pa9_tc4wo1g4_in */
#define PA9_TC4WO1G4_IN MCHP_PINMUX(a, 9, 0xf4, 9, periph)
/* pa9_tc4wo1_out */
#define PA9_TC4WO1_OUT MCHP_PINMUX(a, 9, 0x264, 19, periph)
/* pa9_tc5wo0g1_in */
#define PA9_TC5WO0G1_IN MCHP_PINMUX(a, 9, 0xf8, 15, periph)
/* pa9_tc5wo0g3_in */
#define PA9_TC5WO0G3_IN MCHP_PINMUX(a, 9, 0xfc, 2, periph)
/* pa9_tc5wo0_out */
#define PA9_TC5WO0_OUT MCHP_PINMUX(a, 9, 0x260, 20, periph)
/* pa9_tc5wo1g4_in */
#define PA9_TC5WO1G4_IN MCHP_PINMUX(a, 9, 0x104, 9, periph)
/* pa9_tc5wo1_out */
#define PA9_TC5WO1_OUT MCHP_PINMUX(a, 9, 0x264, 20, periph)
/* pa9_tc6wo0g1_in */
#define PA9_TC6WO0G1_IN MCHP_PINMUX(a, 9, 0x108, 15, periph)
/* pa9_tc6wo0g3_in */
#define PA9_TC6WO0G3_IN MCHP_PINMUX(a, 9, 0x10c, 2, periph)
/* pa9_tc6wo0_out */
#define PA9_TC6WO0_OUT MCHP_PINMUX(a, 9, 0x260, 21, periph)
/* pa9_tc6wo1g4_in */
#define PA9_TC6WO1G4_IN MCHP_PINMUX(a, 9, 0x114, 9, periph)
/* pa9_tc6wo1_out */
#define PA9_TC6WO1_OUT MCHP_PINMUX(a, 9, 0x264, 21, periph)
/* pa9_tc7wo0g1_in */
#define PA9_TC7WO0G1_IN MCHP_PINMUX(a, 9, 0x118, 15, periph)
/* pa9_tc7wo0g3_in */
#define PA9_TC7WO0G3_IN MCHP_PINMUX(a, 9, 0x11c, 2, periph)
/* pa9_tc7wo0_out */
#define PA9_TC7WO0_OUT MCHP_PINMUX(a, 9, 0x260, 22, periph)
/* pa9_tc7wo1g4_in */
#define PA9_TC7WO1G4_IN MCHP_PINMUX(a, 9, 0x124, 9, periph)
/* pa9_tc7wo1_out */
#define PA9_TC7WO1_OUT MCHP_PINMUX(a, 9, 0x264, 22, periph)
/* pa9_tcc0wo0_out */
#define PA9_TCC0WO0_OUT MCHP_PINMUX(a, 9, 0x260, 8, periph)
/* pa9_tcc0wo1_out */
#define PA9_TCC0WO1_OUT MCHP_PINMUX(a, 9, 0x264, 8, periph)
/* pa9_tcc0wo2_out */
#define PA9_TCC0WO2_OUT MCHP_PINMUX(a, 9, 0x260, 7, periph)
/* pa9_tcc0wo3_out */
#define PA9_TCC0WO3_OUT MCHP_PINMUX(a, 9, 0x264, 7, periph)
/* pa9_tcc0wo4_out */
#define PA9_TCC0WO4_OUT MCHP_PINMUX(a, 9, 0x260, 9, periph)
/* pa9_tcc0wo5_out */
#define PA9_TCC0WO5_OUT MCHP_PINMUX(a, 9, 0x264, 9, periph)
/* pa9_tcc1wo0_out */
#define PA9_TCC1WO0_OUT MCHP_PINMUX(a, 9, 0x260, 11, periph)
/* pa9_tcc1wo1_out */
#define PA9_TCC1WO1_OUT MCHP_PINMUX(a, 9, 0x264, 11, periph)
/* pa9_tcc1wo2_out */
#define PA9_TCC1WO2_OUT MCHP_PINMUX(a, 9, 0x260, 10, periph)
/* pa9_tcc1wo3_out */
#define PA9_TCC1WO3_OUT MCHP_PINMUX(a, 9, 0x264, 10, periph)
/* pa9_tcc1wo4_out */
#define PA9_TCC1WO4_OUT MCHP_PINMUX(a, 9, 0x260, 12, periph)
/* pa9_tcc1wo5_out */
#define PA9_TCC1WO5_OUT MCHP_PINMUX(a, 9, 0x264, 12, periph)
/* pa9_tcc2wo0_out */
#define PA9_TCC2WO0_OUT MCHP_PINMUX(a, 9, 0x260, 13, periph)
/* pa9_tcc2wo1_out */
#define PA9_TCC2WO1_OUT MCHP_PINMUX(a, 9, 0x264, 13, periph)
/* pa10_cclin0_in */
#define PA10_CCLIN0_IN MCHP_PINMUX(a, 10, 0x98, 10, periph)
/* pa10_cclin3_in */
#define PA10_CCLIN3_IN MCHP_PINMUX(a, 10, 0xa4, 10, periph)
/* pa10_cclout1_out */
#define PA10_CCLOUT1_OUT MCHP_PINMUX(a, 10, 0x26c, 27, periph)
/* pa10_extint0_in */
#define PA10_EXTINT0_IN MCHP_PINMUX(a, 10, 0x0, 10, periph)
/* pa10_extint3_in */
#define PA10_EXTINT3_IN MCHP_PINMUX(a, 10, 0xc, 2, periph)
/* pa10_nmi_in */
#define PA10_NMI_IN MCHP_PINMUX(a, 10, 0x3c, 2, periph)
/* pa10_qcs_out */
#define PA10_QCS_OUT MCHP_PINMUX(a, 10, 0x26c, 23, periph)
/* pa10_qd0_in */
#define PA10_QD0_IN MCHP_PINMUX(a, 10, 0x84, 2, periph)
/* pa10_qd0_out */
#define PA10_QD0_OUT MCHP_PINMUX(a, 10, 0x26c, 26, periph)
/* pa10_qd1_in */
#define PA10_QD1_IN MCHP_PINMUX(a, 10, 0x88, 10, periph)
/* pa10_qd1_out */
#define PA10_QD1_OUT MCHP_PINMUX(a, 10, 0x26c, 25, periph)
/* pa10_qd2_out */
#define PA10_QD2_OUT MCHP_PINMUX(a, 10, 0x26c, 24, periph)
/* pa10_scom0p0_out */
#define PA10_SCOM0P0_OUT MCHP_PINMUX(a, 10, 0x26c, 3, periph)
/* pa10_scom0p2_in */
#define PA10_SCOM0P2_IN MCHP_PINMUX(a, 10, 0x48, 2, periph)
/* pa10_scom0p2_out */
#define PA10_SCOM0P2_OUT MCHP_PINMUX(a, 10, 0x26c, 1, periph)
/* pa10_scom0p3_in */
#define PA10_SCOM0P3_IN MCHP_PINMUX(a, 10, 0x4c, 10, periph)
/* pa10_scom1p0_out */
#define PA10_SCOM1P0_OUT MCHP_PINMUX(a, 10, 0x26c, 6, periph)
/* pa10_scom1p2_in */
#define PA10_SCOM1P2_IN MCHP_PINMUX(a, 10, 0x58, 10, periph)
/* pa10_scom1p3_out */
#define PA10_SCOM1P3_OUT MCHP_PINMUX(a, 10, 0x26c, 4, periph)
/* pa10_tc0wo0g1_in */
#define PA10_TC0WO0G1_IN MCHP_PINMUX(a, 10, 0xb0, 10, periph)
/* pa10_tc0wo0_out */
#define PA10_TC0WO0_OUT MCHP_PINMUX(a, 10, 0x26c, 15, periph)
/* pa10_tc0wo1g4_in */
#define PA10_TC0WO1G4_IN MCHP_PINMUX(a, 10, 0xbc, 2, periph)
/* pa10_tc1wo0g1_in */
#define PA10_TC1WO0G1_IN MCHP_PINMUX(a, 10, 0xc0, 10, periph)
/* pa10_tc1wo1_out */
#define PA10_TC1WO1_OUT MCHP_PINMUX(a, 10, 0x26c, 16, periph)
/* pa10_tc2wo0g1_in */
#define PA10_TC2WO0G1_IN MCHP_PINMUX(a, 10, 0xc8, 10, periph)
/* pa10_tc2wo1g4_in */
#define PA10_TC2WO1G4_IN MCHP_PINMUX(a, 10, 0xd4, 2, periph)
/* pa10_tc2wo1_out */
#define PA10_TC2WO1_OUT MCHP_PINMUX(a, 10, 0x26c, 17, periph)
/* pa10_tc3wo0g1_in */
#define PA10_TC3WO0G1_IN MCHP_PINMUX(a, 10, 0xd8, 10, periph)
/* pa10_tc3wo1g4_in */
#define PA10_TC3WO1G4_IN MCHP_PINMUX(a, 10, 0xe4, 2, periph)
/* pa10_tc3wo1_out */
#define PA10_TC3WO1_OUT MCHP_PINMUX(a, 10, 0x26c, 18, periph)
/* pa10_tc4wo0g1_in */
#define PA10_TC4WO0G1_IN MCHP_PINMUX(a, 10, 0xe8, 10, periph)
/* pa10_tc4wo1g4_in */
#define PA10_TC4WO1G4_IN MCHP_PINMUX(a, 10, 0xf4, 2, periph)
/* pa10_tc4wo1_out */
#define PA10_TC4WO1_OUT MCHP_PINMUX(a, 10, 0x26c, 19, periph)
/* pa10_tc5wo0g1_in */
#define PA10_TC5WO0G1_IN MCHP_PINMUX(a, 10, 0xf8, 10, periph)
/* pa10_tc5wo1g4_in */
#define PA10_TC5WO1G4_IN MCHP_PINMUX(a, 10, 0x104, 2, periph)
/* pa10_tc5wo1_out */
#define PA10_TC5WO1_OUT MCHP_PINMUX(a, 10, 0x26c, 20, periph)
/* pa10_tc6wo0g1_in */
#define PA10_TC6WO0G1_IN MCHP_PINMUX(a, 10, 0x108, 10, periph)
/* pa10_tc6wo1g4_in */
#define PA10_TC6WO1G4_IN MCHP_PINMUX(a, 10, 0x114, 2, periph)
/* pa10_tc6wo1_out */
#define PA10_TC6WO1_OUT MCHP_PINMUX(a, 10, 0x26c, 21, periph)
/* pa10_tc7wo0g1_in */
#define PA10_TC7WO0G1_IN MCHP_PINMUX(a, 10, 0x118, 10, periph)
/* pa10_tc7wo1g4_in */
#define PA10_TC7WO1G4_IN MCHP_PINMUX(a, 10, 0x124, 2, periph)
/* pa10_tc7wo1_out */
#define PA10_TC7WO1_OUT MCHP_PINMUX(a, 10, 0x26c, 22, periph)
/* pa10_tcc0wo1_out */
#define PA10_TCC0WO1_OUT MCHP_PINMUX(a, 10, 0x26c, 8, periph)
/* pa10_tcc0wo3_out */
#define PA10_TCC0WO3_OUT MCHP_PINMUX(a, 10, 0x26c, 7, periph)
/* pa10_tcc0wo5_out */
#define PA10_TCC0WO5_OUT MCHP_PINMUX(a, 10, 0x26c, 9, periph)
/* pa10_tcc1wo1_out */
#define PA10_TCC1WO1_OUT MCHP_PINMUX(a, 10, 0x26c, 11, periph)
/* pa10_tcc1wo3_out */
#define PA10_TCC1WO3_OUT MCHP_PINMUX(a, 10, 0x26c, 10, periph)
/* pa10_tcc1wo5_out */
#define PA10_TCC1WO5_OUT MCHP_PINMUX(a, 10, 0x26c, 12, periph)
/* pa10_tcc2wo1_out */
#define PA10_TCC2WO1_OUT MCHP_PINMUX(a, 10, 0x26c, 13, periph)
/* pa11_cclin0_in */
#define PA11_CCLIN0_IN MCHP_PINMUX(a, 11, 0x98, 3, periph)
/* pa11_cclin1_in */
#define PA11_CCLIN1_IN MCHP_PINMUX(a, 11, 0x9c, 10, periph)
/* pa11_cclin3_in */
#define PA11_CCLIN3_IN MCHP_PINMUX(a, 11, 0xa4, 3, periph)
/* pa11_cclin4_in */
#define PA11_CCLIN4_IN MCHP_PINMUX(a, 11, 0xa8, 10, periph)
/* pa11_extint0_in */
#define PA11_EXTINT0_IN MCHP_PINMUX(a, 11, 0x0, 3, periph)
/* pa11_extint1_in */
#define PA11_EXTINT1_IN MCHP_PINMUX(a, 11, 0x4, 10, periph)
/* pa11_qd1_in */
#define PA11_QD1_IN MCHP_PINMUX(a, 11, 0x88, 3, periph)
/* pa11_qd2_in */
#define PA11_QD2_IN MCHP_PINMUX(a, 11, 0x8c, 10, periph)
/* pa11_scom0p0_in */
#define PA11_SCOM0P0_IN MCHP_PINMUX(a, 11, 0x40, 10, periph)
/* pa11_scom0p3_in */
#define PA11_SCOM0P3_IN MCHP_PINMUX(a, 11, 0x4c, 3, periph)
/* pa11_scom1p2_in */
#define PA11_SCOM1P2_IN MCHP_PINMUX(a, 11, 0x58, 3, periph)
/* pa11_scom1p3_in */
#define PA11_SCOM1P3_IN MCHP_PINMUX(a, 11, 0x5c, 10, periph)
/* pa11_tc0wo0g1_in */
#define PA11_TC0WO0G1_IN MCHP_PINMUX(a, 11, 0xb0, 3, periph)
/* pa11_tc0wo0g2_in */
#define PA11_TC0WO0G2_IN MCHP_PINMUX(a, 11, 0xb4, 10, periph)
/* pa11_tc1wo0g1_in */
#define PA11_TC1WO0G1_IN MCHP_PINMUX(a, 11, 0xc0, 3, periph)
/* pa11_tc1wo1g2_in */
#define PA11_TC1WO1G2_IN MCHP_PINMUX(a, 11, 0xc4, 10, periph)
/* pa11_tc2wo0g1_in */
#define PA11_TC2WO0G1_IN MCHP_PINMUX(a, 11, 0xc8, 3, periph)
/* pa11_tc2wo1g2_in */
#define PA11_TC2WO1G2_IN MCHP_PINMUX(a, 11, 0xd0, 10, periph)
/* pa11_tc3wo0g1_in */
#define PA11_TC3WO0G1_IN MCHP_PINMUX(a, 11, 0xd8, 3, periph)
/* pa11_tc3wo1g2_in */
#define PA11_TC3WO1G2_IN MCHP_PINMUX(a, 11, 0xe0, 10, periph)
/* pa11_tc4wo0g1_in */
#define PA11_TC4WO0G1_IN MCHP_PINMUX(a, 11, 0xe8, 3, periph)
/* pa11_tc4wo1g2_in */
#define PA11_TC4WO1G2_IN MCHP_PINMUX(a, 11, 0xf0, 10, periph)
/* pa11_tc5wo0g1_in */
#define PA11_TC5WO0G1_IN MCHP_PINMUX(a, 11, 0xf8, 3, periph)
/* pa11_tc5wo1g2_in */
#define PA11_TC5WO1G2_IN MCHP_PINMUX(a, 11, 0x100, 10, periph)
/* pa11_tc6wo0g1_in */
#define PA11_TC6WO0G1_IN MCHP_PINMUX(a, 11, 0x108, 3, periph)
/* pa11_tc6wo1g2_in */
#define PA11_TC6WO1G2_IN MCHP_PINMUX(a, 11, 0x110, 10, periph)
/* pa11_tc7wo0g1_in */
#define PA11_TC7WO0G1_IN MCHP_PINMUX(a, 11, 0x118, 3, periph)
/* pa11_tc7wo1g2_in */
#define PA11_TC7WO1G2_IN MCHP_PINMUX(a, 11, 0x120, 10, periph)
/* pa12_cclin1_in */
#define PA12_CCLIN1_IN MCHP_PINMUX(a, 12, 0x9c, 3, periph)
/* pa12_cclin2_in */
#define PA12_CCLIN2_IN MCHP_PINMUX(a, 12, 0xa0, 10, periph)
/* pa12_cclin4_in */
#define PA12_CCLIN4_IN MCHP_PINMUX(a, 12, 0xa8, 3, periph)
/* pa12_cclin5_in */
#define PA12_CCLIN5_IN MCHP_PINMUX(a, 12, 0xac, 10, periph)
/* pa12_extint1_in */
#define PA12_EXTINT1_IN MCHP_PINMUX(a, 12, 0x4, 3, periph)
/* pa12_extint2_in */
#define PA12_EXTINT2_IN MCHP_PINMUX(a, 12, 0x8, 10, periph)
/* pa12_qd2_in */
#define PA12_QD2_IN MCHP_PINMUX(a, 12, 0x8c, 3, periph)
/* pa12_qd3_in */
#define PA12_QD3_IN MCHP_PINMUX(a, 12, 0x90, 10, periph)
/* pa12_scom0p0_in */
#define PA12_SCOM0P0_IN MCHP_PINMUX(a, 12, 0x40, 3, periph)
/* pa12_scom1p0_in */
#define PA12_SCOM1P0_IN MCHP_PINMUX(a, 12, 0x50, 10, periph)
/* pa12_scom1p3_in */
#define PA12_SCOM1P3_IN MCHP_PINMUX(a, 12, 0x5c, 3, periph)
/* pa12_tc0wo0g2_in */
#define PA12_TC0WO0G2_IN MCHP_PINMUX(a, 12, 0xb4, 3, periph)
/* pa12_tc0wo1g3_in */
#define PA12_TC0WO1G3_IN MCHP_PINMUX(a, 12, 0xb8, 10, periph)
/* pa12_tc1wo1g2_in */
#define PA12_TC1WO1G2_IN MCHP_PINMUX(a, 12, 0xc4, 3, periph)
/* pa12_tc2wo0g3_in */
#define PA12_TC2WO0G3_IN MCHP_PINMUX(a, 12, 0xcc, 10, periph)
/* pa12_tc2wo1g2_in */
#define PA12_TC2WO1G2_IN MCHP_PINMUX(a, 12, 0xd0, 3, periph)
/* pa12_tc3wo0g3_in */
#define PA12_TC3WO0G3_IN MCHP_PINMUX(a, 12, 0xdc, 10, periph)
/* pa12_tc3wo1g2_in */
#define PA12_TC3WO1G2_IN MCHP_PINMUX(a, 12, 0xe0, 3, periph)
/* pa12_tc4wo0g3_in */
#define PA12_TC4WO0G3_IN MCHP_PINMUX(a, 12, 0xec, 10, periph)
/* pa12_tc4wo1g2_in */
#define PA12_TC4WO1G2_IN MCHP_PINMUX(a, 12, 0xf0, 3, periph)
/* pa12_tc5wo0g3_in */
#define PA12_TC5WO0G3_IN MCHP_PINMUX(a, 12, 0xfc, 10, periph)
/* pa12_tc5wo1g2_in */
#define PA12_TC5WO1G2_IN MCHP_PINMUX(a, 12, 0x100, 3, periph)
/* pa12_tc6wo0g3_in */
#define PA12_TC6WO0G3_IN MCHP_PINMUX(a, 12, 0x10c, 10, periph)
/* pa12_tc6wo1g2_in */
#define PA12_TC6WO1G2_IN MCHP_PINMUX(a, 12, 0x110, 3, periph)
/* pa12_tc7wo0g3_in */
#define PA12_TC7WO0G3_IN MCHP_PINMUX(a, 12, 0x11c, 10, periph)
/* pa12_tc7wo1g2_in */
#define PA12_TC7WO1G2_IN MCHP_PINMUX(a, 12, 0x120, 3, periph)
/* pa13_cclin2_in */
#define PA13_CCLIN2_IN MCHP_PINMUX(a, 13, 0xa0, 3, periph)
/* pa13_cclin5_in */
#define PA13_CCLIN5_IN MCHP_PINMUX(a, 13, 0xac, 3, periph)
/* pa13_cclout0_out */
#define PA13_CCLOUT0_OUT MCHP_PINMUX(a, 13, 0x278, 27, periph)
/* pa13_cclout1_out */
#define PA13_CCLOUT1_OUT MCHP_PINMUX(a, 13, 0x27c, 27, periph)
/* pa13_extint2_in */
#define PA13_EXTINT2_IN MCHP_PINMUX(a, 13, 0x8, 3, periph)
/* pa13_extint3_in */
#define PA13_EXTINT3_IN MCHP_PINMUX(a, 13, 0xc, 10, periph)
/* pa13_nmi_in */
#define PA13_NMI_IN MCHP_PINMUX(a, 13, 0x3c, 10, periph)
/* pa13_qcs_out */
#define PA13_QCS_OUT MCHP_PINMUX(a, 13, 0x278, 23, periph)
/* pa13_qd0_in */
#define PA13_QD0_IN MCHP_PINMUX(a, 13, 0x84, 10, periph)
/* pa13_qd0_out */
#define PA13_QD0_OUT MCHP_PINMUX(a, 13, 0x278, 25, periph)
/* pa13_qd1_out */
#define PA13_QD1_OUT MCHP_PINMUX(a, 13, 0x278, 24, periph)
/* pa13_qd2_out */
#define PA13_QD2_OUT MCHP_PINMUX(a, 13, 0x27c, 24, periph)
/* pa13_qd3_in */
#define PA13_QD3_IN MCHP_PINMUX(a, 13, 0x90, 3, periph)
/* pa13_qd3_out */
#define PA13_QD3_OUT MCHP_PINMUX(a, 13, 0x278, 26, periph)
/* pa13_scom0p0_out */
#define PA13_SCOM0P0_OUT MCHP_PINMUX(a, 13, 0x278, 2, periph)
/* pa13_scom0p2_in */
#define PA13_SCOM0P2_IN MCHP_PINMUX(a, 13, 0x48, 10, periph)
/* pa13_scom0p2_out */
#define PA13_SCOM0P2_OUT MCHP_PINMUX(a, 13, 0x27c, 1, periph)
/* pa13_scom0p3_out */
#define PA13_SCOM0P3_OUT MCHP_PINMUX(a, 13, 0x278, 3, periph)
/* pa13_scom1p0_in */
#define PA13_SCOM1P0_IN MCHP_PINMUX(a, 13, 0x50, 3, periph)
/* pa13_scom1p0_out */
#define PA13_SCOM1P0_OUT MCHP_PINMUX(a, 13, 0x27c, 6, periph)
/* pa13_scom1p2_out */
#define PA13_SCOM1P2_OUT MCHP_PINMUX(a, 13, 0x278, 4, periph)
/* pa13_scom1p3_out */
#define PA13_SCOM1P3_OUT MCHP_PINMUX(a, 13, 0x278, 6, periph)
/* pa13_tc0wo0_out */
#define PA13_TC0WO0_OUT MCHP_PINMUX(a, 13, 0x278, 15, periph)
/* pa13_tc0wo1g3_in */
#define PA13_TC0WO1G3_IN MCHP_PINMUX(a, 13, 0xb8, 3, periph)
/* pa13_tc0wo1g4_in */
#define PA13_TC0WO1G4_IN MCHP_PINMUX(a, 13, 0xbc, 10, periph)
/* pa13_tc1wo0_out */
#define PA13_TC1WO0_OUT MCHP_PINMUX(a, 13, 0x278, 16, periph)
/* pa13_tc1wo1_out */
#define PA13_TC1WO1_OUT MCHP_PINMUX(a, 13, 0x27c, 16, periph)
/* pa13_tc2wo0g3_in */
#define PA13_TC2WO0G3_IN MCHP_PINMUX(a, 13, 0xcc, 3, periph)
/* pa13_tc2wo0_out */
#define PA13_TC2WO0_OUT MCHP_PINMUX(a, 13, 0x278, 17, periph)
/* pa13_tc2wo1g4_in */
#define PA13_TC2WO1G4_IN MCHP_PINMUX(a, 13, 0xd4, 10, periph)
/* pa13_tc2wo1_out */
#define PA13_TC2WO1_OUT MCHP_PINMUX(a, 13, 0x27c, 17, periph)
/* pa13_tc3wo0g3_in */
#define PA13_TC3WO0G3_IN MCHP_PINMUX(a, 13, 0xdc, 3, periph)
/* pa13_tc3wo0_out */
#define PA13_TC3WO0_OUT MCHP_PINMUX(a, 13, 0x278, 18, periph)
/* pa13_tc3wo1g4_in */
#define PA13_TC3WO1G4_IN MCHP_PINMUX(a, 13, 0xe4, 10, periph)
/* pa13_tc3wo1_out */
#define PA13_TC3WO1_OUT MCHP_PINMUX(a, 13, 0x27c, 18, periph)
/* pa13_tc4wo0g3_in */
#define PA13_TC4WO0G3_IN MCHP_PINMUX(a, 13, 0xec, 3, periph)
/* pa13_tc4wo0_out */
#define PA13_TC4WO0_OUT MCHP_PINMUX(a, 13, 0x278, 19, periph)
/* pa13_tc4wo1g4_in */
#define PA13_TC4WO1G4_IN MCHP_PINMUX(a, 13, 0xf4, 10, periph)
/* pa13_tc4wo1_out */
#define PA13_TC4WO1_OUT MCHP_PINMUX(a, 13, 0x27c, 19, periph)
/* pa13_tc5wo0g3_in */
#define PA13_TC5WO0G3_IN MCHP_PINMUX(a, 13, 0xfc, 3, periph)
/* pa13_tc5wo0_out */
#define PA13_TC5WO0_OUT MCHP_PINMUX(a, 13, 0x278, 20, periph)
/* pa13_tc5wo1g4_in */
#define PA13_TC5WO1G4_IN MCHP_PINMUX(a, 13, 0x104, 10, periph)
/* pa13_tc5wo1_out */
#define PA13_TC5WO1_OUT MCHP_PINMUX(a, 13, 0x27c, 20, periph)
/* pa13_tc6wo0g3_in */
#define PA13_TC6WO0G3_IN MCHP_PINMUX(a, 13, 0x10c, 3, periph)
/* pa13_tc6wo0_out */
#define PA13_TC6WO0_OUT MCHP_PINMUX(a, 13, 0x278, 21, periph)
/* pa13_tc6wo1g4_in */
#define PA13_TC6WO1G4_IN MCHP_PINMUX(a, 13, 0x114, 10, periph)
/* pa13_tc6wo1_out */
#define PA13_TC6WO1_OUT MCHP_PINMUX(a, 13, 0x27c, 21, periph)
/* pa13_tc7wo0g3_in */
#define PA13_TC7WO0G3_IN MCHP_PINMUX(a, 13, 0x11c, 3, periph)
/* pa13_tc7wo0_out */
#define PA13_TC7WO0_OUT MCHP_PINMUX(a, 13, 0x278, 22, periph)
/* pa13_tc7wo1g4_in */
#define PA13_TC7WO1G4_IN MCHP_PINMUX(a, 13, 0x124, 10, periph)
/* pa13_tc7wo1_out */
#define PA13_TC7WO1_OUT MCHP_PINMUX(a, 13, 0x27c, 22, periph)
/* pa13_tcc0wo0_out */
#define PA13_TCC0WO0_OUT MCHP_PINMUX(a, 13, 0x278, 8, periph)
/* pa13_tcc0wo1_out */
#define PA13_TCC0WO1_OUT MCHP_PINMUX(a, 13, 0x27c, 8, periph)
/* pa13_tcc0wo2_out */
#define PA13_TCC0WO2_OUT MCHP_PINMUX(a, 13, 0x278, 7, periph)
/* pa13_tcc0wo3_out */
#define PA13_TCC0WO3_OUT MCHP_PINMUX(a, 13, 0x27c, 7, periph)
/* pa13_tcc0wo4_out */
#define PA13_TCC0WO4_OUT MCHP_PINMUX(a, 13, 0x278, 9, periph)
/* pa13_tcc0wo5_out */
#define PA13_TCC0WO5_OUT MCHP_PINMUX(a, 13, 0x27c, 9, periph)
/* pa13_tcc1wo0_out */
#define PA13_TCC1WO0_OUT MCHP_PINMUX(a, 13, 0x278, 11, periph)
/* pa13_tcc1wo1_out */
#define PA13_TCC1WO1_OUT MCHP_PINMUX(a, 13, 0x27c, 11, periph)
/* pa13_tcc1wo2_out */
#define PA13_TCC1WO2_OUT MCHP_PINMUX(a, 13, 0x278, 10, periph)
/* pa13_tcc1wo3_out */
#define PA13_TCC1WO3_OUT MCHP_PINMUX(a, 13, 0x27c, 10, periph)
/* pa13_tcc1wo4_out */
#define PA13_TCC1WO4_OUT MCHP_PINMUX(a, 13, 0x278, 12, periph)
/* pa13_tcc1wo5_out */
#define PA13_TCC1WO5_OUT MCHP_PINMUX(a, 13, 0x27c, 12, periph)
/* pa13_tcc2wo0_out */
#define PA13_TCC2WO0_OUT MCHP_PINMUX(a, 13, 0x278, 13, periph)
