zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz3/pic32cx5109bz31048-pinctrl.h
/* pa13_tcc2wo1_out */
#define PA13_TCC2WO1_OUT MCHP_PINMUX(a, 13, 0x27c, 13, periph)
/* pa14_cclin0_in */
#define PA14_CCLIN0_IN MCHP_PINMUX(a, 14, 0x98, 11, periph)
/* pa14_cclin3_in */
#define PA14_CCLIN3_IN MCHP_PINMUX(a, 14, 0xa4, 11, periph)
/* pa14_cclout1_out */
#define PA14_CCLOUT1_OUT MCHP_PINMUX(a, 14, 0x284, 27, periph)
/* pa14_extint0_in */
#define PA14_EXTINT0_IN MCHP_PINMUX(a, 14, 0x0, 11, periph)
/* pa14_extint3_in */
#define PA14_EXTINT3_IN MCHP_PINMUX(a, 14, 0xc, 3, periph)
/* pa14_nmi_in */
#define PA14_NMI_IN MCHP_PINMUX(a, 14, 0x3c, 3, periph)
/* pa14_qcs_out */
#define PA14_QCS_OUT MCHP_PINMUX(a, 14, 0x284, 23, periph)
/* pa14_qd0_in */
#define PA14_QD0_IN MCHP_PINMUX(a, 14, 0x84, 3, periph)
/* pa14_qd0_out */
#define PA14_QD0_OUT MCHP_PINMUX(a, 14, 0x284, 26, periph)
/* pa14_qd1_in */
#define PA14_QD1_IN MCHP_PINMUX(a, 14, 0x88, 11, periph)
/* pa14_qd1_out */
#define PA14_QD1_OUT MCHP_PINMUX(a, 14, 0x284, 25, periph)
/* pa14_qd2_out */
#define PA14_QD2_OUT MCHP_PINMUX(a, 14, 0x284, 24, periph)
/* pa14_scom0p0_out */
#define PA14_SCOM0P0_OUT MCHP_PINMUX(a, 14, 0x284, 3, periph)
/* pa14_scom0p2_in */
#define PA14_SCOM0P2_IN MCHP_PINMUX(a, 14, 0x48, 3, periph)
/* pa14_scom0p2_out */
#define PA14_SCOM0P2_OUT MCHP_PINMUX(a, 14, 0x284, 1, periph)
/* pa14_scom0p3_in */
#define PA14_SCOM0P3_IN MCHP_PINMUX(a, 14, 0x4c, 11, periph)
/* pa14_scom1p0_out */
#define PA14_SCOM1P0_OUT MCHP_PINMUX(a, 14, 0x284, 6, periph)
/* pa14_scom1p2_in */
#define PA14_SCOM1P2_IN MCHP_PINMUX(a, 14, 0x58, 11, periph)
/* pa14_scom1p3_out */
#define PA14_SCOM1P3_OUT MCHP_PINMUX(a, 14, 0x284, 4, periph)
/* pa14_tc0wo0g1_in */
#define PA14_TC0WO0G1_IN MCHP_PINMUX(a, 14, 0xb0, 11, periph)
/* pa14_tc0wo0_out */
#define PA14_TC0WO0_OUT MCHP_PINMUX(a, 14, 0x284, 15, periph)
/* pa14_tc0wo1g4_in */
#define PA14_TC0WO1G4_IN MCHP_PINMUX(a, 14, 0xbc, 3, periph)
/* pa14_tc1wo0g1_in */
#define PA14_TC1WO0G1_IN MCHP_PINMUX(a, 14, 0xc0, 11, periph)
/* pa14_tc1wo1_out */
#define PA14_TC1WO1_OUT MCHP_PINMUX(a, 14, 0x284, 16, periph)
/* pa14_tc2wo0g1_in */
#define PA14_TC2WO0G1_IN MCHP_PINMUX(a, 14, 0xc8, 11, periph)
/* pa14_tc2wo1g4_in */
#define PA14_TC2WO1G4_IN MCHP_PINMUX(a, 14, 0xd4, 3, periph)
/* pa14_tc2wo1_out */
#define PA14_TC2WO1_OUT MCHP_PINMUX(a, 14, 0x284, 17, periph)
/* pa14_tc3wo0g1_in */
#define PA14_TC3WO0G1_IN MCHP_PINMUX(a, 14, 0xd8, 11, periph)
/* pa14_tc3wo1g4_in */
#define PA14_TC3WO1G4_IN MCHP_PINMUX(a, 14, 0xe4, 3, periph)
/* pa14_tc3wo1_out */
#define PA14_TC3WO1_OUT MCHP_PINMUX(a, 14, 0x284, 18, periph)
/* pa14_tc4wo0g1_in */
#define PA14_TC4WO0G1_IN MCHP_PINMUX(a, 14, 0xe8, 11, periph)
/* pa14_tc4wo1g4_in */
#define PA14_TC4WO1G4_IN MCHP_PINMUX(a, 14, 0xf4, 3, periph)
/* pa14_tc4wo1_out */
#define PA14_TC4WO1_OUT MCHP_PINMUX(a, 14, 0x284, 19, periph)
/* pa14_tc5wo0g1_in */
#define PA14_TC5WO0G1_IN MCHP_PINMUX(a, 14, 0xf8, 11, periph)
/* pa14_tc5wo1g4_in */
#define PA14_TC5WO1G4_IN MCHP_PINMUX(a, 14, 0x104, 3, periph)
/* pa14_tc5wo1_out */
#define PA14_TC5WO1_OUT MCHP_PINMUX(a, 14, 0x284, 20, periph)
/* pa14_tc6wo0g1_in */
#define PA14_TC6WO0G1_IN MCHP_PINMUX(a, 14, 0x108, 11, periph)
/* pa14_tc6wo1g4_in */
#define PA14_TC6WO1G4_IN MCHP_PINMUX(a, 14, 0x114, 3, periph)
/* pa14_tc6wo1_out */
#define PA14_TC6WO1_OUT MCHP_PINMUX(a, 14, 0x284, 21, periph)
/* pa14_tc7wo0g1_in */
#define PA14_TC7WO0G1_IN MCHP_PINMUX(a, 14, 0x118, 11, periph)
/* pa14_tc7wo1g4_in */
#define PA14_TC7WO1G4_IN MCHP_PINMUX(a, 14, 0x124, 3, periph)
/* pa14_tc7wo1_out */
#define PA14_TC7WO1_OUT MCHP_PINMUX(a, 14, 0x284, 22, periph)
/* pa14_tcc0wo1_out */
#define PA14_TCC0WO1_OUT MCHP_PINMUX(a, 14, 0x284, 8, periph)
/* pa14_tcc0wo3_out */
#define PA14_TCC0WO3_OUT MCHP_PINMUX(a, 14, 0x284, 7, periph)
/* pa14_tcc0wo5_out */
#define PA14_TCC0WO5_OUT MCHP_PINMUX(a, 14, 0x284, 9, periph)
/* pa14_tcc1wo1_out */
#define PA14_TCC1WO1_OUT MCHP_PINMUX(a, 14, 0x284, 11, periph)
/* pa14_tcc1wo3_out */
#define PA14_TCC1WO3_OUT MCHP_PINMUX(a, 14, 0x284, 10, periph)
/* pa14_tcc1wo5_out */
#define PA14_TCC1WO5_OUT MCHP_PINMUX(a, 14, 0x284, 12, periph)
/* pa14_tcc2wo1_out */
#define PA14_TCC2WO1_OUT MCHP_PINMUX(a, 14, 0x284, 13, periph)
/* pb0_cclin0_in */
#define PB0_CCLIN0_IN MCHP_PINMUX(b, 0, 0x98, 4, periph)
/* pb0_cclin1_in */
#define PB0_CCLIN1_IN MCHP_PINMUX(b, 0, 0x9c, 11, periph)
/* pb0_cclin3_in */
#define PB0_CCLIN3_IN MCHP_PINMUX(b, 0, 0xa4, 4, periph)
/* pb0_cclin4_in */
#define PB0_CCLIN4_IN MCHP_PINMUX(b, 0, 0xa8, 11, periph)
/* pb0_cclout1_out */
#define PB0_CCLOUT1_OUT MCHP_PINMUX(b, 0, 0x290, 27, periph)
/* pb0_extint0_in */
#define PB0_EXTINT0_IN MCHP_PINMUX(b, 0, 0x0, 4, periph)
/* pb0_extint1_in */
#define PB0_EXTINT1_IN MCHP_PINMUX(b, 0, 0x4, 11, periph)
/* pb0_qd0_out */
#define PB0_QD0_OUT MCHP_PINMUX(b, 0, 0x290, 24, periph)
/* pb0_qd1_in */
#define PB0_QD1_IN MCHP_PINMUX(b, 0, 0x88, 4, periph)
/* pb0_qd2_in */
#define PB0_QD2_IN MCHP_PINMUX(b, 0, 0x8c, 11, periph)
/* pb0_qd2_out */
#define PB0_QD2_OUT MCHP_PINMUX(b, 0, 0x290, 26, periph)
/* pb0_qd3_out */
#define PB0_QD3_OUT MCHP_PINMUX(b, 0, 0x290, 25, periph)
/* pb0_qspics_out */
#define PB0_QSPICS_OUT MCHP_PINMUX(b, 0, 0x290, 23, periph)
/* pb0_scom0p0_in */
#define PB0_SCOM0P0_IN MCHP_PINMUX(b, 0, 0x40, 11, periph)
/* pb0_scom0p0_out */
#define PB0_SCOM0P0_OUT MCHP_PINMUX(b, 0, 0x290, 1, periph)
/* pb0_scom0p2_out */
#define PB0_SCOM0P2_OUT MCHP_PINMUX(b, 0, 0x290, 3, periph)
/* pb0_scom0p3_in */
#define PB0_SCOM0P3_IN MCHP_PINMUX(b, 0, 0x4c, 4, periph)
/* pb0_scom0p3_out */
#define PB0_SCOM0P3_OUT MCHP_PINMUX(b, 0, 0x290, 2, periph)
/* pb0_scom1p2_in */
#define PB0_SCOM1P2_IN MCHP_PINMUX(b, 0, 0x58, 4, periph)
/* pb0_scom1p2_out */
#define PB0_SCOM1P2_OUT MCHP_PINMUX(b, 0, 0x290, 6, periph)
/* pb0_scom1p3_in */
#define PB0_SCOM1P3_IN MCHP_PINMUX(b, 0, 0x5c, 11, periph)
/* pb0_scom1p3_out */
#define PB0_SCOM1P3_OUT MCHP_PINMUX(b, 0, 0x290, 5, periph)
/* pb0_tc0wo0g1_in */
#define PB0_TC0WO0G1_IN MCHP_PINMUX(b, 0, 0xb0, 4, periph)
/* pb0_tc0wo0g2_in */
#define PB0_TC0WO0G2_IN MCHP_PINMUX(b, 0, 0xb4, 11, periph)
/* pb0_tc0wo1_out */
#define PB0_TC0WO1_OUT MCHP_PINMUX(b, 0, 0x290, 15, periph)
/* pb0_tc1wo0g1_in */
#define PB0_TC1WO0G1_IN MCHP_PINMUX(b, 0, 0xc0, 4, periph)
/* pb0_tc1wo1g2_in */
#define PB0_TC1WO1G2_IN MCHP_PINMUX(b, 0, 0xc4, 11, periph)
/* pb0_tc1wo1_out */
#define PB0_TC1WO1_OUT MCHP_PINMUX(b, 0, 0x290, 16, periph)
/* pb0_tc2wo0g1_in */
#define PB0_TC2WO0G1_IN MCHP_PINMUX(b, 0, 0xc8, 4, periph)
/* pb0_tc2wo1g2_in */
#define PB0_TC2WO1G2_IN MCHP_PINMUX(b, 0, 0xd0, 11, periph)
/* pb0_tc2wo1_out */
#define PB0_TC2WO1_OUT MCHP_PINMUX(b, 0, 0x290, 17, periph)
/* pb0_tc3wo0g1_in */
#define PB0_TC3WO0G1_IN MCHP_PINMUX(b, 0, 0xd8, 4, periph)
/* pb0_tc3wo1g2_in */
#define PB0_TC3WO1G2_IN MCHP_PINMUX(b, 0, 0xe0, 11, periph)
/* pb0_tc3wo1_out */
#define PB0_TC3WO1_OUT MCHP_PINMUX(b, 0, 0x290, 18, periph)
/* pb0_tc4wo0g1_in */
#define PB0_TC4WO0G1_IN MCHP_PINMUX(b, 0, 0xe8, 4, periph)
/* pb0_tc4wo1g2_in */
#define PB0_TC4WO1G2_IN MCHP_PINMUX(b, 0, 0xf0, 11, periph)
/* pb0_tc4wo1_out */
#define PB0_TC4WO1_OUT MCHP_PINMUX(b, 0, 0x290, 19, periph)
/* pb0_tc5wo0g1_in */
#define PB0_TC5WO0G1_IN MCHP_PINMUX(b, 0, 0xf8, 4, periph)
/* pb0_tc5wo1g2_in */
#define PB0_TC5WO1G2_IN MCHP_PINMUX(b, 0, 0x100, 11, periph)
/* pb0_tc5wo1_out */
#define PB0_TC5WO1_OUT MCHP_PINMUX(b, 0, 0x290, 20, periph)
/* pb0_tc6wo0g1_in */
#define PB0_TC6WO0G1_IN MCHP_PINMUX(b, 0, 0x108, 4, periph)
/* pb0_tc6wo1g2_in */
#define PB0_TC6WO1G2_IN MCHP_PINMUX(b, 0, 0x110, 11, periph)
/* pb0_tc6wo1_out */
#define PB0_TC6WO1_OUT MCHP_PINMUX(b, 0, 0x290, 21, periph)
/* pb0_tc7wo0g1_in */
#define PB0_TC7WO0G1_IN MCHP_PINMUX(b, 0, 0x118, 4, periph)
/* pb0_tc7wo1g2_in */
#define PB0_TC7WO1G2_IN MCHP_PINMUX(b, 0, 0x120, 11, periph)
/* pb0_tc7wo1_out */
#define PB0_TC7WO1_OUT MCHP_PINMUX(b, 0, 0x290, 22, periph)
/* pb0_tcc0wo1_out */
#define PB0_TCC0WO1_OUT MCHP_PINMUX(b, 0, 0x290, 7, periph)
/* pb0_tcc0wo3_out */
#define PB0_TCC0WO3_OUT MCHP_PINMUX(b, 0, 0x290, 9, periph)
/* pb0_tcc0wo5_out */
#define PB0_TCC0WO5_OUT MCHP_PINMUX(b, 0, 0x290, 8, periph)
/* pb0_tcc1wo1_out */
#define PB0_TCC1WO1_OUT MCHP_PINMUX(b, 0, 0x290, 10, periph)
/* pb0_tcc1wo3_out */
#define PB0_TCC1WO3_OUT MCHP_PINMUX(b, 0, 0x290, 12, periph)
/* pb0_tcc1wo5_out */
#define PB0_TCC1WO5_OUT MCHP_PINMUX(b, 0, 0x290, 11, periph)
/* pb0_tcc2wo1_out */
#define PB0_TCC2WO1_OUT MCHP_PINMUX(b, 0, 0x290, 13, periph)
/* pb1_cclin1_in */
#define PB1_CCLIN1_IN MCHP_PINMUX(b, 1, 0x9c, 4, periph)
/* pb1_cclin2_in */
#define PB1_CCLIN2_IN MCHP_PINMUX(b, 1, 0xa0, 11, periph)
/* pb1_cclin4_in */
#define PB1_CCLIN4_IN MCHP_PINMUX(b, 1, 0xa8, 4, periph)
/* pb1_cclin5_in */
#define PB1_CCLIN5_IN MCHP_PINMUX(b, 1, 0xac, 11, periph)
/* pb1_cclout0_out */
#define PB1_CCLOUT0_OUT MCHP_PINMUX(b, 1, 0x298, 27, periph)
/* pb1_cclout1_out */
#define PB1_CCLOUT1_OUT MCHP_PINMUX(b, 1, 0x294, 27, periph)
/* pb1_extint1_in */
#define PB1_EXTINT1_IN MCHP_PINMUX(b, 1, 0x4, 4, periph)
/* pb1_extint2_in */
#define PB1_EXTINT2_IN MCHP_PINMUX(b, 1, 0x8, 11, periph)
/* pb1_qcs_out */
#define PB1_QCS_OUT MCHP_PINMUX(b, 1, 0x298, 23, periph)
/* pb1_qd0_out */
#define PB1_QD0_OUT MCHP_PINMUX(b, 1, 0x294, 24, periph)
/* pb1_qd1_out */
#define PB1_QD1_OUT MCHP_PINMUX(b, 1, 0x298, 24, periph)
/* pb1_qd2_in */
#define PB1_QD2_IN MCHP_PINMUX(b, 1, 0x8c, 4, periph)
/* pb1_qd2_out */
#define PB1_QD2_OUT MCHP_PINMUX(b, 1, 0x294, 26, periph)
/* pb1_qd3_in */
#define PB1_QD3_IN MCHP_PINMUX(b, 1, 0x90, 11, periph)
/* pb1_qd3_out */
#define PB1_QD3_OUT MCHP_PINMUX(b, 1, 0x294, 25, periph)
/* pb1_qspics_out */
#define PB1_QSPICS_OUT MCHP_PINMUX(b, 1, 0x294, 23, periph)
/* pb1_scom0p0_in */
#define PB1_SCOM0P0_IN MCHP_PINMUX(b, 1, 0x40, 4, periph)
/* pb1_scom0p0_out */
#define PB1_SCOM0P0_OUT MCHP_PINMUX(b, 1, 0x294, 1, periph)
/* pb1_scom0p2_out */
#define PB1_SCOM0P2_OUT MCHP_PINMUX(b, 1, 0x294, 3, periph)
/* pb1_scom0p3_out */
#define PB1_SCOM0P3_OUT MCHP_PINMUX(b, 1, 0x294, 2, periph)
/* pb1_scom1p0_in */
#define PB1_SCOM1P0_IN MCHP_PINMUX(b, 1, 0x50, 11, periph)
/* pb1_scom1p2_out */
#define PB1_SCOM1P2_OUT MCHP_PINMUX(b, 1, 0x294, 6, periph)
/* pb1_scom1p3_in */
#define PB1_SCOM1P3_IN MCHP_PINMUX(b, 1, 0x5c, 4, periph)
/* pb1_scom1p3_out */
#define PB1_SCOM1P3_OUT MCHP_PINMUX(b, 1, 0x294, 5, periph)
/* pb1_tc0wo0g2_in */
#define PB1_TC0WO0G2_IN MCHP_PINMUX(b, 1, 0xb4, 4, periph)
/* pb1_tc0wo0_out */
#define PB1_TC0WO0_OUT MCHP_PINMUX(b, 1, 0x298, 15, periph)
/* pb1_tc0wo1g3_in */
#define PB1_TC0WO1G3_IN MCHP_PINMUX(b, 1, 0xb8, 11, periph)
/* pb1_tc0wo1_out */
#define PB1_TC0WO1_OUT MCHP_PINMUX(b, 1, 0x294, 15, periph)
/* pb1_tc1wo0_out */
#define PB1_TC1WO0_OUT MCHP_PINMUX(b, 1, 0x298, 16, periph)
/* pb1_tc1wo1g2_in */
#define PB1_TC1WO1G2_IN MCHP_PINMUX(b, 1, 0xc4, 4, periph)
/* pb1_tc1wo1_out */
#define PB1_TC1WO1_OUT MCHP_PINMUX(b, 1, 0x294, 16, periph)
/* pb1_tc2wo0g3_in */
#define PB1_TC2WO0G3_IN MCHP_PINMUX(b, 1, 0xcc, 11, periph)
/* pb1_tc2wo0_out */
#define PB1_TC2WO0_OUT MCHP_PINMUX(b, 1, 0x298, 17, periph)
/* pb1_tc2wo1g2_in */
#define PB1_TC2WO1G2_IN MCHP_PINMUX(b, 1, 0xd0, 4, periph)
/* pb1_tc2wo1_out */
#define PB1_TC2WO1_OUT MCHP_PINMUX(b, 1, 0x294, 17, periph)
/* pb1_tc3wo0g3_in */
#define PB1_TC3WO0G3_IN MCHP_PINMUX(b, 1, 0xdc, 11, periph)
/* pb1_tc3wo0_out */
#define PB1_TC3WO0_OUT MCHP_PINMUX(b, 1, 0x298, 18, periph)
/* pb1_tc3wo1g2_in */
#define PB1_TC3WO1G2_IN MCHP_PINMUX(b, 1, 0xe0, 4, periph)
/* pb1_tc3wo1_out */
#define PB1_TC3WO1_OUT MCHP_PINMUX(b, 1, 0x294, 18, periph)
/* pb1_tc4wo0g3_in */
#define PB1_TC4WO0G3_IN MCHP_PINMUX(b, 1, 0xec, 11, periph)
/* pb1_tc4wo0_out */
#define PB1_TC4WO0_OUT MCHP_PINMUX(b, 1, 0x298, 19, periph)
/* pb1_tc4wo1g2_in */
#define PB1_TC4WO1G2_IN MCHP_PINMUX(b, 1, 0xf0, 4, periph)
/* pb1_tc4wo1_out */
#define PB1_TC4WO1_OUT MCHP_PINMUX(b, 1, 0x294, 19, periph)
/* pb1_tc5wo0g3_in */
#define PB1_TC5WO0G3_IN MCHP_PINMUX(b, 1, 0xfc, 11, periph)
/* pb1_tc5wo0_out */
#define PB1_TC5WO0_OUT MCHP_PINMUX(b, 1, 0x298, 20, periph)
/* pb1_tc5wo1g2_in */
#define PB1_TC5WO1G2_IN MCHP_PINMUX(b, 1, 0x100, 4, periph)
/* pb1_tc5wo1_out */
#define PB1_TC5WO1_OUT MCHP_PINMUX(b, 1, 0x294, 20, periph)
/* pb1_tc6wo0g3_in */
#define PB1_TC6WO0G3_IN MCHP_PINMUX(b, 1, 0x10c, 11, periph)
/* pb1_tc6wo0_out */
#define PB1_TC6WO0_OUT MCHP_PINMUX(b, 1, 0x298, 21, periph)
/* pb1_tc6wo1g2_in */
#define PB1_TC6WO1G2_IN MCHP_PINMUX(b, 1, 0x110, 4, periph)
/* pb1_tc6wo1_out */
#define PB1_TC6WO1_OUT MCHP_PINMUX(b, 1, 0x294, 21, periph)
/* pb1_tc7wo0g3_in */
#define PB1_TC7WO0G3_IN MCHP_PINMUX(b, 1, 0x11c, 11, periph)
/* pb1_tc7wo0_out */
#define PB1_TC7WO0_OUT MCHP_PINMUX(b, 1, 0x298, 22, periph)
/* pb1_tc7wo1g2_in */
#define PB1_TC7WO1G2_IN MCHP_PINMUX(b, 1, 0x120, 4, periph)
/* pb1_tc7wo1_out */
#define PB1_TC7WO1_OUT MCHP_PINMUX(b, 1, 0x294, 22, periph)
/* pb1_tcc0wo0_out */
#define PB1_TCC0WO0_OUT MCHP_PINMUX(b, 1, 0x298, 8, periph)
/* pb1_tcc0wo1_out */
#define PB1_TCC0WO1_OUT MCHP_PINMUX(b, 1, 0x294, 7, periph)
/* pb1_tcc0wo2_out */
#define PB1_TCC0WO2_OUT MCHP_PINMUX(b, 1, 0x298, 7, periph)
/* pb1_tcc0wo3_out */
#define PB1_TCC0WO3_OUT MCHP_PINMUX(b, 1, 0x294, 9, periph)
/* pb1_tcc0wo4_out */
#define PB1_TCC0WO4_OUT MCHP_PINMUX(b, 1, 0x298, 9, periph)
/* pb1_tcc0wo5_out */
#define PB1_TCC0WO5_OUT MCHP_PINMUX(b, 1, 0x294, 8, periph)
/* pb1_tcc1wo0_out */
#define PB1_TCC1WO0_OUT MCHP_PINMUX(b, 1, 0x298, 11, periph)
/* pb1_tcc1wo1_out */
#define PB1_TCC1WO1_OUT MCHP_PINMUX(b, 1, 0x294, 10, periph)
/* pb1_tcc1wo2_out */
#define PB1_TCC1WO2_OUT MCHP_PINMUX(b, 1, 0x298, 10, periph)
/* pb1_tcc1wo3_out */
#define PB1_TCC1WO3_OUT MCHP_PINMUX(b, 1, 0x294, 12, periph)
/* pb1_tcc1wo4_out */
#define PB1_TCC1WO4_OUT MCHP_PINMUX(b, 1, 0x298, 12, periph)
/* pb1_tcc1wo5_out */
#define PB1_TCC1WO5_OUT MCHP_PINMUX(b, 1, 0x294, 11, periph)
/* pb1_tcc2wo0_out */
#define PB1_TCC2WO0_OUT MCHP_PINMUX(b, 1, 0x298, 13, periph)
/* pb1_tcc2wo1_out */
#define PB1_TCC2WO1_OUT MCHP_PINMUX(b, 1, 0x294, 13, periph)
/* pb2_cclin2_in */
#define PB2_CCLIN2_IN MCHP_PINMUX(b, 2, 0xa0, 4, periph)
/* pb2_cclin5_in */
#define PB2_CCLIN5_IN MCHP_PINMUX(b, 2, 0xac, 4, periph)
/* pb2_cclout0_out */
#define PB2_CCLOUT0_OUT MCHP_PINMUX(b, 2, 0x29c, 27, periph)
/* pb2_cclout1_out */
#define PB2_CCLOUT1_OUT MCHP_PINMUX(b, 2, 0x2a0, 27, periph)
/* pb2_extint2_in */
#define PB2_EXTINT2_IN MCHP_PINMUX(b, 2, 0x8, 4, periph)
/* pb2_extint3_in */
#define PB2_EXTINT3_IN MCHP_PINMUX(b, 2, 0xc, 11, periph)
/* pb2_nmi_in */
#define PB2_NMI_IN MCHP_PINMUX(b, 2, 0x3c, 11, periph)
/* pb2_qcs_out */
#define PB2_QCS_OUT MCHP_PINMUX(b, 2, 0x29c, 23, periph)
/* pb2_qd0_in */
#define PB2_QD0_IN MCHP_PINMUX(b, 2, 0x84, 11, periph)
/* pb2_qd0_out */
#define PB2_QD0_OUT MCHP_PINMUX(b, 2, 0x29c, 25, periph)
/* pb2_qd1_out */
#define PB2_QD1_OUT MCHP_PINMUX(b, 2, 0x29c, 24, periph)
/* pb2_qd2_out */
#define PB2_QD2_OUT MCHP_PINMUX(b, 2, 0x2a0, 24, periph)
/* pb2_qd3_in */
#define PB2_QD3_IN MCHP_PINMUX(b, 2, 0x90, 4, periph)
/* pb2_qd3_out */
#define PB2_QD3_OUT MCHP_PINMUX(b, 2, 0x29c, 26, periph)
/* pb2_scom0p0_out */
#define PB2_SCOM0P0_OUT MCHP_PINMUX(b, 2, 0x29c, 2, periph)
/* pb2_scom0p2_in */
#define PB2_SCOM0P2_IN MCHP_PINMUX(b, 2, 0x48, 11, periph)
/* pb2_scom0p2_out */
#define PB2_SCOM0P2_OUT MCHP_PINMUX(b, 2, 0x2a0, 1, periph)
/* pb2_scom0p3_out */
#define PB2_SCOM0P3_OUT MCHP_PINMUX(b, 2, 0x29c, 3, periph)
/* pb2_scom1p0_in */
#define PB2_SCOM1P0_IN MCHP_PINMUX(b, 2, 0x50, 4, periph)
/* pb2_scom1p0_out */
#define PB2_SCOM1P0_OUT MCHP_PINMUX(b, 2, 0x2a0, 6, periph)
/* pb2_scom1p2_out */
#define PB2_SCOM1P2_OUT MCHP_PINMUX(b, 2, 0x29c, 4, periph)
/* pb2_scom1p3_out */
#define PB2_SCOM1P3_OUT MCHP_PINMUX(b, 2, 0x29c, 6, periph)
/* pb2_tc0wo0_out */
#define PB2_TC0WO0_OUT MCHP_PINMUX(b, 2, 0x29c, 15, periph)
/* pb2_tc0wo1g3_in */
#define PB2_TC0WO1G3_IN MCHP_PINMUX(b, 2, 0xb8, 4, periph)
/* pb2_tc0wo1g4_in */
#define PB2_TC0WO1G4_IN MCHP_PINMUX(b, 2, 0xbc, 11, periph)
/* pb2_tc1wo0_out */
#define PB2_TC1WO0_OUT MCHP_PINMUX(b, 2, 0x29c, 16, periph)
/* pb2_tc1wo1_out */
#define PB2_TC1WO1_OUT MCHP_PINMUX(b, 2, 0x2a0, 16, periph)
/* pb2_tc2wo0g3_in */
#define PB2_TC2WO0G3_IN MCHP_PINMUX(b, 2, 0xcc, 4, periph)
/* pb2_tc2wo0_out */
#define PB2_TC2WO0_OUT MCHP_PINMUX(b, 2, 0x29c, 17, periph)
/* pb2_tc2wo1g4_in */
#define PB2_TC2WO1G4_IN MCHP_PINMUX(b, 2, 0xd4, 11, periph)
/* pb2_tc2wo1_out */
#define PB2_TC2WO1_OUT MCHP_PINMUX(b, 2, 0x2a0, 17, periph)
/* pb2_tc3wo0g3_in */
#define PB2_TC3WO0G3_IN MCHP_PINMUX(b, 2, 0xdc, 4, periph)
/* pb2_tc3wo0_out */
#define PB2_TC3WO0_OUT MCHP_PINMUX(b, 2, 0x29c, 18, periph)
/* pb2_tc3wo1g4_in */
#define PB2_TC3WO1G4_IN MCHP_PINMUX(b, 2, 0xe4, 11, periph)
/* pb2_tc3wo1_out */
#define PB2_TC3WO1_OUT MCHP_PINMUX(b, 2, 0x2a0, 18, periph)
/* pb2_tc4wo0g3_in */
#define PB2_TC4WO0G3_IN MCHP_PINMUX(b, 2, 0xec, 4, periph)
/* pb2_tc4wo0_out */
#define PB2_TC4WO0_OUT MCHP_PINMUX(b, 2, 0x29c, 19, periph)
/* pb2_tc4wo1g4_in */
#define PB2_TC4WO1G4_IN MCHP_PINMUX(b, 2, 0xf4, 11, periph)
/* pb2_tc4wo1_out */
#define PB2_TC4WO1_OUT MCHP_PINMUX(b, 2, 0x2a0, 19, periph)
/* pb2_tc5wo0g3_in */
#define PB2_TC5WO0G3_IN MCHP_PINMUX(b, 2, 0xfc, 4, periph)
/* pb2_tc5wo0_out */
#define PB2_TC5WO0_OUT MCHP_PINMUX(b, 2, 0x29c, 20, periph)
/* pb2_tc5wo1g4_in */
#define PB2_TC5WO1G4_IN MCHP_PINMUX(b, 2, 0x104, 11, periph)
/* pb2_tc5wo1_out */
#define PB2_TC5WO1_OUT MCHP_PINMUX(b, 2, 0x2a0, 20, periph)
/* pb2_tc6wo0g3_in */
#define PB2_TC6WO0G3_IN MCHP_PINMUX(b, 2, 0x10c, 4, periph)
/* pb2_tc6wo0_out */
#define PB2_TC6WO0_OUT MCHP_PINMUX(b, 2, 0x29c, 21, periph)
/* pb2_tc6wo1g4_in */
#define PB2_TC6WO1G4_IN MCHP_PINMUX(b, 2, 0x114, 11, periph)
/* pb2_tc6wo1_out */
#define PB2_TC6WO1_OUT MCHP_PINMUX(b, 2, 0x2a0, 21, periph)
/* pb2_tc7wo0g3_in */
#define PB2_TC7WO0G3_IN MCHP_PINMUX(b, 2, 0x11c, 4, periph)
/* pb2_tc7wo0_out */
#define PB2_TC7WO0_OUT MCHP_PINMUX(b, 2, 0x29c, 22, periph)
/* pb2_tc7wo1g4_in */
#define PB2_TC7WO1G4_IN MCHP_PINMUX(b, 2, 0x124, 11, periph)
/* pb2_tc7wo1_out */
#define PB2_TC7WO1_OUT MCHP_PINMUX(b, 2, 0x2a0, 22, periph)
/* pb2_tcc0wo0_out */
#define PB2_TCC0WO0_OUT MCHP_PINMUX(b, 2, 0x29c, 8, periph)
/* pb2_tcc0wo1_out */
#define PB2_TCC0WO1_OUT MCHP_PINMUX(b, 2, 0x2a0, 8, periph)
/* pb2_tcc0wo2_out */
#define PB2_TCC0WO2_OUT MCHP_PINMUX(b, 2, 0x29c, 7, periph)
/* pb2_tcc0wo3_out */
#define PB2_TCC0WO3_OUT MCHP_PINMUX(b, 2, 0x2a0, 7, periph)
/* pb2_tcc0wo4_out */
#define PB2_TCC0WO4_OUT MCHP_PINMUX(b, 2, 0x29c, 9, periph)
/* pb2_tcc0wo5_out */
#define PB2_TCC0WO5_OUT MCHP_PINMUX(b, 2, 0x2a0, 9, periph)
/* pb2_tcc1wo0_out */
#define PB2_TCC1WO0_OUT MCHP_PINMUX(b, 2, 0x29c, 11, periph)
/* pb2_tcc1wo1_out */
#define PB2_TCC1WO1_OUT MCHP_PINMUX(b, 2, 0x2a0, 11, periph)
/* pb2_tcc1wo2_out */
#define PB2_TCC1WO2_OUT MCHP_PINMUX(b, 2, 0x29c, 10, periph)
/* pb2_tcc1wo3_out */
#define PB2_TCC1WO3_OUT MCHP_PINMUX(b, 2, 0x2a0, 10, periph)
/* pb2_tcc1wo4_out */
#define PB2_TCC1WO4_OUT MCHP_PINMUX(b, 2, 0x29c, 12, periph)
/* pb2_tcc1wo5_out */
#define PB2_TCC1WO5_OUT MCHP_PINMUX(b, 2, 0x2a0, 12, periph)
/* pb2_tcc2wo0_out */
#define PB2_TCC2WO0_OUT MCHP_PINMUX(b, 2, 0x29c, 13, periph)
/* pb2_tcc2wo1_out */
#define PB2_TCC2WO1_OUT MCHP_PINMUX(b, 2, 0x2a0, 13, periph)
/* pb3_cclin0_in */
#define PB3_CCLIN0_IN MCHP_PINMUX(b, 3, 0x98, 12, periph)
/* pb3_cclin3_in */
#define PB3_CCLIN3_IN MCHP_PINMUX(b, 3, 0xa4, 12, periph)
/* pb3_cclout1_out */
#define PB3_CCLOUT1_OUT MCHP_PINMUX(b, 3, 0x2a8, 27, periph)
/* pb3_extint0_in */
#define PB3_EXTINT0_IN MCHP_PINMUX(b, 3, 0x0, 12, periph)
/* pb3_extint3_in */
#define PB3_EXTINT3_IN MCHP_PINMUX(b, 3, 0xc, 4, periph)
/* pb3_nmi_in */
#define PB3_NMI_IN MCHP_PINMUX(b, 3, 0x3c, 4, periph)
/* pb3_qcs_out */
#define PB3_QCS_OUT MCHP_PINMUX(b, 3, 0x2a8, 23, periph)
/* pb3_qd0_in */
#define PB3_QD0_IN MCHP_PINMUX(b, 3, 0x84, 4, periph)
/* pb3_qd0_out */
#define PB3_QD0_OUT MCHP_PINMUX(b, 3, 0x2a8, 26, periph)
/* pb3_qd1_in */
#define PB3_QD1_IN MCHP_PINMUX(b, 3, 0x88, 12, periph)
/* pb3_qd1_out */
#define PB3_QD1_OUT MCHP_PINMUX(b, 3, 0x2a8, 25, periph)
/* pb3_qd2_out */
#define PB3_QD2_OUT MCHP_PINMUX(b, 3, 0x2a8, 24, periph)
/* pb3_scom0p0_out */
#define PB3_SCOM0P0_OUT MCHP_PINMUX(b, 3, 0x2a8, 3, periph)
/* pb3_scom0p2_in */
#define PB3_SCOM0P2_IN MCHP_PINMUX(b, 3, 0x48, 4, periph)
/* pb3_scom0p2_out */
#define PB3_SCOM0P2_OUT MCHP_PINMUX(b, 3, 0x2a8, 1, periph)
/* pb3_scom0p3_in */
#define PB3_SCOM0P3_IN MCHP_PINMUX(b, 3, 0x4c, 12, periph)
/* pb3_scom1p0_out */
#define PB3_SCOM1P0_OUT MCHP_PINMUX(b, 3, 0x2a8, 6, periph)
/* pb3_scom1p2_in */
#define PB3_SCOM1P2_IN MCHP_PINMUX(b, 3, 0x58, 12, periph)
/* pb3_scom1p3_out */
#define PB3_SCOM1P3_OUT MCHP_PINMUX(b, 3, 0x2a8, 4, periph)
/* pb3_tc0wo0g1_in */
#define PB3_TC0WO0G1_IN MCHP_PINMUX(b, 3, 0xb0, 12, periph)
/* pb3_tc0wo0_out */
#define PB3_TC0WO0_OUT MCHP_PINMUX(b, 3, 0x2a8, 15, periph)
/* pb3_tc0wo1g4_in */
#define PB3_TC0WO1G4_IN MCHP_PINMUX(b, 3, 0xbc, 4, periph)
/* pb3_tc1wo0g1_in */
#define PB3_TC1WO0G1_IN MCHP_PINMUX(b, 3, 0xc0, 12, periph)
/* pb3_tc1wo1_out */
#define PB3_TC1WO1_OUT MCHP_PINMUX(b, 3, 0x2a8, 16, periph)
/* pb3_tc2wo0g1_in */
#define PB3_TC2WO0G1_IN MCHP_PINMUX(b, 3, 0xc8, 12, periph)
/* pb3_tc2wo1g4_in */
#define PB3_TC2WO1G4_IN MCHP_PINMUX(b, 3, 0xd4, 4, periph)
/* pb3_tc2wo1_out */
#define PB3_TC2WO1_OUT MCHP_PINMUX(b, 3, 0x2a8, 17, periph)
/* pb3_tc3wo0g1_in */
#define PB3_TC3WO0G1_IN MCHP_PINMUX(b, 3, 0xd8, 12, periph)
/* pb3_tc3wo1g4_in */
#define PB3_TC3WO1G4_IN MCHP_PINMUX(b, 3, 0xe4, 4, periph)
/* pb3_tc3wo1_out */
#define PB3_TC3WO1_OUT MCHP_PINMUX(b, 3, 0x2a8, 18, periph)
/* pb3_tc4wo0g1_in */
#define PB3_TC4WO0G1_IN MCHP_PINMUX(b, 3, 0xe8, 12, periph)
/* pb3_tc4wo1g4_in */
#define PB3_TC4WO1G4_IN MCHP_PINMUX(b, 3, 0xf4, 4, periph)
/* pb3_tc4wo1_out */
#define PB3_TC4WO1_OUT MCHP_PINMUX(b, 3, 0x2a8, 19, periph)
/* pb3_tc5wo0g1_in */
#define PB3_TC5WO0G1_IN MCHP_PINMUX(b, 3, 0xf8, 12, periph)
/* pb3_tc5wo1g4_in */
#define PB3_TC5WO1G4_IN MCHP_PINMUX(b, 3, 0x104, 4, periph)
/* pb3_tc5wo1_out */
#define PB3_TC5WO1_OUT MCHP_PINMUX(b, 3, 0x2a8, 20, periph)
/* pb3_tc6wo0g1_in */
#define PB3_TC6WO0G1_IN MCHP_PINMUX(b, 3, 0x108, 12, periph)
/* pb3_tc6wo1g4_in */
#define PB3_TC6WO1G4_IN MCHP_PINMUX(b, 3, 0x114, 4, periph)
/* pb3_tc6wo1_out */
#define PB3_TC6WO1_OUT MCHP_PINMUX(b, 3, 0x2a8, 21, periph)
/* pb3_tc7wo0g1_in */
#define PB3_TC7WO0G1_IN MCHP_PINMUX(b, 3, 0x118, 12, periph)
/* pb3_tc7wo1g4_in */
#define PB3_TC7WO1G4_IN MCHP_PINMUX(b, 3, 0x124, 4, periph)
/* pb3_tc7wo1_out */
#define PB3_TC7WO1_OUT MCHP_PINMUX(b, 3, 0x2a8, 22, periph)
/* pb3_tcc0wo1_out */
#define PB3_TCC0WO1_OUT MCHP_PINMUX(b, 3, 0x2a8, 8, periph)
/* pb3_tcc0wo3_out */
#define PB3_TCC0WO3_OUT MCHP_PINMUX(b, 3, 0x2a8, 7, periph)
/* pb3_tcc0wo5_out */
#define PB3_TCC0WO5_OUT MCHP_PINMUX(b, 3, 0x2a8, 9, periph)
/* pb3_tcc1wo1_out */
#define PB3_TCC1WO1_OUT MCHP_PINMUX(b, 3, 0x2a8, 11, periph)
/* pb3_tcc1wo3_out */
#define PB3_TCC1WO3_OUT MCHP_PINMUX(b, 3, 0x2a8, 10, periph)
/* pb3_tcc1wo5_out */
#define PB3_TCC1WO5_OUT MCHP_PINMUX(b, 3, 0x2a8, 12, periph)
/* pb3_tcc2wo1_out */
#define PB3_TCC2WO1_OUT MCHP_PINMUX(b, 3, 0x2a8, 13, periph)
/* pb4_cclin0_in */
#define PB4_CCLIN0_IN MCHP_PINMUX(b, 4, 0x98, 5, periph)
/* pb4_cclin1_in */
#define PB4_CCLIN1_IN MCHP_PINMUX(b, 4, 0x9c, 12, periph)
/* pb4_cclin3_in */
#define PB4_CCLIN3_IN MCHP_PINMUX(b, 4, 0xa4, 5, periph)
/* pb4_cclin4_in */
