zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz3/pic32cx5109bz31048-pinctrl.h
#define PB4_CCLIN4_IN MCHP_PINMUX(b, 4, 0xa8, 12, periph)
/* pb4_cclout1_out */
#define PB4_CCLOUT1_OUT MCHP_PINMUX(b, 4, 0x2b0, 27, periph)
/* pb4_extint0_in */
#define PB4_EXTINT0_IN MCHP_PINMUX(b, 4, 0x0, 5, periph)
/* pb4_extint1_in */
#define PB4_EXTINT1_IN MCHP_PINMUX(b, 4, 0x4, 12, periph)
/* pb4_qd0_out */
#define PB4_QD0_OUT MCHP_PINMUX(b, 4, 0x2b0, 24, periph)
/* pb4_qd1_in */
#define PB4_QD1_IN MCHP_PINMUX(b, 4, 0x88, 5, periph)
/* pb4_qd2_in */
#define PB4_QD2_IN MCHP_PINMUX(b, 4, 0x8c, 12, periph)
/* pb4_qd2_out */
#define PB4_QD2_OUT MCHP_PINMUX(b, 4, 0x2b0, 26, periph)
/* pb4_qd3_out */
#define PB4_QD3_OUT MCHP_PINMUX(b, 4, 0x2b0, 25, periph)
/* pb4_qspics_out */
#define PB4_QSPICS_OUT MCHP_PINMUX(b, 4, 0x2b0, 23, periph)
/* pb4_scom0p0_in */
#define PB4_SCOM0P0_IN MCHP_PINMUX(b, 4, 0x40, 12, periph)
/* pb4_scom0p0_out */
#define PB4_SCOM0P0_OUT MCHP_PINMUX(b, 4, 0x2b0, 1, periph)
/* pb4_scom0p2_out */
#define PB4_SCOM0P2_OUT MCHP_PINMUX(b, 4, 0x2b0, 3, periph)
/* pb4_scom0p3_in */
#define PB4_SCOM0P3_IN MCHP_PINMUX(b, 4, 0x4c, 5, periph)
/* pb4_scom0p3_out */
#define PB4_SCOM0P3_OUT MCHP_PINMUX(b, 4, 0x2b0, 2, periph)
/* pb4_scom1p2_in */
#define PB4_SCOM1P2_IN MCHP_PINMUX(b, 4, 0x58, 5, periph)
/* pb4_scom1p2_out */
#define PB4_SCOM1P2_OUT MCHP_PINMUX(b, 4, 0x2b0, 6, periph)
/* pb4_scom1p3_in */
#define PB4_SCOM1P3_IN MCHP_PINMUX(b, 4, 0x5c, 12, periph)
/* pb4_scom1p3_out */
#define PB4_SCOM1P3_OUT MCHP_PINMUX(b, 4, 0x2b0, 5, periph)
/* pb4_tc0wo0g1_in */
#define PB4_TC0WO0G1_IN MCHP_PINMUX(b, 4, 0xb0, 5, periph)
/* pb4_tc0wo0g2_in */
#define PB4_TC0WO0G2_IN MCHP_PINMUX(b, 4, 0xb4, 12, periph)
/* pb4_tc0wo1_out */
#define PB4_TC0WO1_OUT MCHP_PINMUX(b, 4, 0x2b0, 15, periph)
/* pb4_tc1wo0g1_in */
#define PB4_TC1WO0G1_IN MCHP_PINMUX(b, 4, 0xc0, 5, periph)
/* pb4_tc1wo1g2_in */
#define PB4_TC1WO1G2_IN MCHP_PINMUX(b, 4, 0xc4, 12, periph)
/* pb4_tc1wo1_out */
#define PB4_TC1WO1_OUT MCHP_PINMUX(b, 4, 0x2b0, 16, periph)
/* pb4_tc2wo0g1_in */
#define PB4_TC2WO0G1_IN MCHP_PINMUX(b, 4, 0xc8, 5, periph)
/* pb4_tc2wo1g2_in */
#define PB4_TC2WO1G2_IN MCHP_PINMUX(b, 4, 0xd0, 12, periph)
/* pb4_tc2wo1_out */
#define PB4_TC2WO1_OUT MCHP_PINMUX(b, 4, 0x2b0, 17, periph)
/* pb4_tc3wo0g1_in */
#define PB4_TC3WO0G1_IN MCHP_PINMUX(b, 4, 0xd8, 5, periph)
/* pb4_tc3wo1g2_in */
#define PB4_TC3WO1G2_IN MCHP_PINMUX(b, 4, 0xe0, 12, periph)
/* pb4_tc3wo1_out */
#define PB4_TC3WO1_OUT MCHP_PINMUX(b, 4, 0x2b0, 18, periph)
/* pb4_tc4wo0g1_in */
#define PB4_TC4WO0G1_IN MCHP_PINMUX(b, 4, 0xe8, 5, periph)
/* pb4_tc4wo1g2_in */
#define PB4_TC4WO1G2_IN MCHP_PINMUX(b, 4, 0xf0, 12, periph)
/* pb4_tc4wo1_out */
#define PB4_TC4WO1_OUT MCHP_PINMUX(b, 4, 0x2b0, 19, periph)
/* pb4_tc5wo0g1_in */
#define PB4_TC5WO0G1_IN MCHP_PINMUX(b, 4, 0xf8, 5, periph)
/* pb4_tc5wo1g2_in */
#define PB4_TC5WO1G2_IN MCHP_PINMUX(b, 4, 0x100, 12, periph)
/* pb4_tc5wo1_out */
#define PB4_TC5WO1_OUT MCHP_PINMUX(b, 4, 0x2b0, 20, periph)
/* pb4_tc6wo0g1_in */
#define PB4_TC6WO0G1_IN MCHP_PINMUX(b, 4, 0x108, 5, periph)
/* pb4_tc6wo1g2_in */
#define PB4_TC6WO1G2_IN MCHP_PINMUX(b, 4, 0x110, 12, periph)
/* pb4_tc6wo1_out */
#define PB4_TC6WO1_OUT MCHP_PINMUX(b, 4, 0x2b0, 21, periph)
/* pb4_tc7wo0g1_in */
#define PB4_TC7WO0G1_IN MCHP_PINMUX(b, 4, 0x118, 5, periph)
/* pb4_tc7wo1g2_in */
#define PB4_TC7WO1G2_IN MCHP_PINMUX(b, 4, 0x120, 12, periph)
/* pb4_tc7wo1_out */
#define PB4_TC7WO1_OUT MCHP_PINMUX(b, 4, 0x2b0, 22, periph)
/* pb4_tcc0wo1_out */
#define PB4_TCC0WO1_OUT MCHP_PINMUX(b, 4, 0x2b0, 7, periph)
/* pb4_tcc0wo3_out */
#define PB4_TCC0WO3_OUT MCHP_PINMUX(b, 4, 0x2b0, 9, periph)
/* pb4_tcc0wo5_out */
#define PB4_TCC0WO5_OUT MCHP_PINMUX(b, 4, 0x2b0, 8, periph)
/* pb4_tcc1wo1_out */
#define PB4_TCC1WO1_OUT MCHP_PINMUX(b, 4, 0x2b0, 10, periph)
/* pb4_tcc1wo3_out */
#define PB4_TCC1WO3_OUT MCHP_PINMUX(b, 4, 0x2b0, 12, periph)
/* pb4_tcc1wo5_out */
#define PB4_TCC1WO5_OUT MCHP_PINMUX(b, 4, 0x2b0, 11, periph)
/* pb4_tcc2wo1_out */
#define PB4_TCC2WO1_OUT MCHP_PINMUX(b, 4, 0x2b0, 13, periph)
/* pb5_cclin1_in */
#define PB5_CCLIN1_IN MCHP_PINMUX(b, 5, 0x9c, 5, periph)
/* pb5_cclin2_in */
#define PB5_CCLIN2_IN MCHP_PINMUX(b, 5, 0xa0, 12, periph)
/* pb5_cclin4_in */
#define PB5_CCLIN4_IN MCHP_PINMUX(b, 5, 0xa8, 5, periph)
/* pb5_cclin5_in */
#define PB5_CCLIN5_IN MCHP_PINMUX(b, 5, 0xac, 12, periph)
/* pb5_cclout1_out */
#define PB5_CCLOUT1_OUT MCHP_PINMUX(b, 5, 0x2b4, 27, periph)
/* pb5_extint1_in */
#define PB5_EXTINT1_IN MCHP_PINMUX(b, 5, 0x4, 5, periph)
/* pb5_extint2_in */
#define PB5_EXTINT2_IN MCHP_PINMUX(b, 5, 0x8, 12, periph)
/* pb5_qd0_out */
#define PB5_QD0_OUT MCHP_PINMUX(b, 5, 0x2b4, 24, periph)
/* pb5_qd2_in */
#define PB5_QD2_IN MCHP_PINMUX(b, 5, 0x8c, 5, periph)
/* pb5_qd2_out */
#define PB5_QD2_OUT MCHP_PINMUX(b, 5, 0x2b4, 26, periph)
/* pb5_qd3_in */
#define PB5_QD3_IN MCHP_PINMUX(b, 5, 0x90, 12, periph)
/* pb5_qd3_out */
#define PB5_QD3_OUT MCHP_PINMUX(b, 5, 0x2b4, 25, periph)
/* pb5_qsck_out */
#define PB5_QSCK_OUT MCHP_PINMUX(b, 5, 0x2b8, 7, periph)
/* pb5_qspics_out */
#define PB5_QSPICS_OUT MCHP_PINMUX(b, 5, 0x2b4, 23, periph)
/* pb5_refi_in */
#define PB5_REFI_IN MCHP_PINMUX(b, 5, 0x94, 5, periph)
/* pb5_refo1_out */
#define PB5_REFO1_OUT MCHP_PINMUX(b, 5, 0x2b8, 3, periph)
/* pb5_refo2_out */
#define PB5_REFO2_OUT MCHP_PINMUX(b, 5, 0x2b8, 4, periph)
/* pb5_refo3_out */
#define PB5_REFO3_OUT MCHP_PINMUX(b, 5, 0x2b8, 5, periph)
/* pb5_refo4_out */
#define PB5_REFO4_OUT MCHP_PINMUX(b, 5, 0x2b8, 6, periph)
/* pb5_scom0p0_in */
#define PB5_SCOM0P0_IN MCHP_PINMUX(b, 5, 0x40, 5, periph)
/* pb5_scom0p0_out */
#define PB5_SCOM0P0_OUT MCHP_PINMUX(b, 5, 0x2b4, 1, periph)
/* pb5_scom0p1_in */
#define PB5_SCOM0P1_IN MCHP_PINMUX(b, 5, 0x44, 5, periph)
/* pb5_scom0p1_out */
#define PB5_SCOM0P1_OUT MCHP_PINMUX(b, 5, 0x2b8, 1, periph)
/* pb5_scom0p2_out */
#define PB5_SCOM0P2_OUT MCHP_PINMUX(b, 5, 0x2b4, 3, periph)
/* pb5_scom0p3_out */
#define PB5_SCOM0P3_OUT MCHP_PINMUX(b, 5, 0x2b4, 2, periph)
/* pb5_scom1p0_in */
#define PB5_SCOM1P0_IN MCHP_PINMUX(b, 5, 0x50, 12, periph)
/* pb5_scom1p1_in */
#define PB5_SCOM1P1_IN MCHP_PINMUX(b, 5, 0x54, 5, periph)
/* pb5_scom1p1_out */
#define PB5_SCOM1P1_OUT MCHP_PINMUX(b, 5, 0x2b8, 2, periph)
/* pb5_scom1p2_out */
#define PB5_SCOM1P2_OUT MCHP_PINMUX(b, 5, 0x2b4, 6, periph)
/* pb5_scom1p3_in */
#define PB5_SCOM1P3_IN MCHP_PINMUX(b, 5, 0x5c, 5, periph)
/* pb5_scom1p3_out */
#define PB5_SCOM1P3_OUT MCHP_PINMUX(b, 5, 0x2b4, 5, periph)
/* pb5_tc0wo0g2_in */
#define PB5_TC0WO0G2_IN MCHP_PINMUX(b, 5, 0xb4, 5, periph)
/* pb5_tc0wo1g3_in */
#define PB5_TC0WO1G3_IN MCHP_PINMUX(b, 5, 0xb8, 12, periph)
/* pb5_tc0wo1_out */
#define PB5_TC0WO1_OUT MCHP_PINMUX(b, 5, 0x2b4, 15, periph)
/* pb5_tc1wo1g2_in */
#define PB5_TC1WO1G2_IN MCHP_PINMUX(b, 5, 0xc4, 5, periph)
/* pb5_tc1wo1_out */
#define PB5_TC1WO1_OUT MCHP_PINMUX(b, 5, 0x2b4, 16, periph)
/* pb5_tc2wo0g3_in */
#define PB5_TC2WO0G3_IN MCHP_PINMUX(b, 5, 0xcc, 12, periph)
/* pb5_tc2wo1g2_in */
#define PB5_TC2WO1G2_IN MCHP_PINMUX(b, 5, 0xd0, 5, periph)
/* pb5_tc2wo1_out */
#define PB5_TC2WO1_OUT MCHP_PINMUX(b, 5, 0x2b4, 17, periph)
/* pb5_tc3wo0g3_in */
#define PB5_TC3WO0G3_IN MCHP_PINMUX(b, 5, 0xdc, 12, periph)
/* pb5_tc3wo1g2_in */
#define PB5_TC3WO1G2_IN MCHP_PINMUX(b, 5, 0xe0, 5, periph)
/* pb5_tc3wo1_out */
#define PB5_TC3WO1_OUT MCHP_PINMUX(b, 5, 0x2b4, 18, periph)
/* pb5_tc4wo0g3_in */
#define PB5_TC4WO0G3_IN MCHP_PINMUX(b, 5, 0xec, 12, periph)
/* pb5_tc4wo1g2_in */
#define PB5_TC4WO1G2_IN MCHP_PINMUX(b, 5, 0xf0, 5, periph)
/* pb5_tc4wo1_out */
#define PB5_TC4WO1_OUT MCHP_PINMUX(b, 5, 0x2b4, 19, periph)
/* pb5_tc5wo0g3_in */
#define PB5_TC5WO0G3_IN MCHP_PINMUX(b, 5, 0xfc, 12, periph)
/* pb5_tc5wo1g2_in */
#define PB5_TC5WO1G2_IN MCHP_PINMUX(b, 5, 0x100, 5, periph)
/* pb5_tc5wo1_out */
#define PB5_TC5WO1_OUT MCHP_PINMUX(b, 5, 0x2b4, 20, periph)
/* pb5_tc6wo0g3_in */
#define PB5_TC6WO0G3_IN MCHP_PINMUX(b, 5, 0x10c, 12, periph)
/* pb5_tc6wo1g2_in */
#define PB5_TC6WO1G2_IN MCHP_PINMUX(b, 5, 0x110, 5, periph)
/* pb5_tc6wo1_out */
#define PB5_TC6WO1_OUT MCHP_PINMUX(b, 5, 0x2b4, 21, periph)
/* pb5_tc7wo0g3_in */
#define PB5_TC7WO0G3_IN MCHP_PINMUX(b, 5, 0x11c, 12, periph)
/* pb5_tc7wo1g2_in */
#define PB5_TC7WO1G2_IN MCHP_PINMUX(b, 5, 0x120, 5, periph)
/* pb5_tc7wo1_out */
#define PB5_TC7WO1_OUT MCHP_PINMUX(b, 5, 0x2b4, 22, periph)
/* pb5_tcc0wo1_out */
#define PB5_TCC0WO1_OUT MCHP_PINMUX(b, 5, 0x2b4, 7, periph)
/* pb5_tcc0wo3_out */
#define PB5_TCC0WO3_OUT MCHP_PINMUX(b, 5, 0x2b4, 9, periph)
/* pb5_tcc0wo5_out */
#define PB5_TCC0WO5_OUT MCHP_PINMUX(b, 5, 0x2b4, 8, periph)
/* pb5_tcc1wo1_out */
#define PB5_TCC1WO1_OUT MCHP_PINMUX(b, 5, 0x2b4, 10, periph)
/* pb5_tcc1wo3_out */
#define PB5_TCC1WO3_OUT MCHP_PINMUX(b, 5, 0x2b4, 12, periph)
/* pb5_tcc1wo5_out */
#define PB5_TCC1WO5_OUT MCHP_PINMUX(b, 5, 0x2b4, 11, periph)
/* pb5_tcc2wo1_out */
#define PB5_TCC2WO1_OUT MCHP_PINMUX(b, 5, 0x2b4, 13, periph)
/* pb6_cclin2_in */
#define PB6_CCLIN2_IN MCHP_PINMUX(b, 6, 0xa0, 5, periph)
/* pb6_cclin5_in */
#define PB6_CCLIN5_IN MCHP_PINMUX(b, 6, 0xac, 5, periph)
/* pb6_cclout0_out */
#define PB6_CCLOUT0_OUT MCHP_PINMUX(b, 6, 0x2bc, 27, periph)
/* pb6_extint2_in */
#define PB6_EXTINT2_IN MCHP_PINMUX(b, 6, 0x8, 5, periph)
/* pb6_extint3_in */
#define PB6_EXTINT3_IN MCHP_PINMUX(b, 6, 0xc, 12, periph)
/* pb6_nmi_in */
#define PB6_NMI_IN MCHP_PINMUX(b, 6, 0x3c, 12, periph)
/* pb6_qcs_out */
#define PB6_QCS_OUT MCHP_PINMUX(b, 6, 0x2bc, 23, periph)
/* pb6_qd0_in */
#define PB6_QD0_IN MCHP_PINMUX(b, 6, 0x84, 12, periph)
/* pb6_qd0_out */
#define PB6_QD0_OUT MCHP_PINMUX(b, 6, 0x2bc, 25, periph)
/* pb6_qd1_out */
#define PB6_QD1_OUT MCHP_PINMUX(b, 6, 0x2bc, 24, periph)
/* pb6_qd3_in */
#define PB6_QD3_IN MCHP_PINMUX(b, 6, 0x90, 5, periph)
/* pb6_qd3_out */
#define PB6_QD3_OUT MCHP_PINMUX(b, 6, 0x2bc, 26, periph)
/* pb6_qsck_out */
#define PB6_QSCK_OUT MCHP_PINMUX(b, 6, 0x2c0, 7, periph)
/* pb6_refi_in */
#define PB6_REFI_IN MCHP_PINMUX(b, 6, 0x94, 6, periph)
/* pb6_refo1_out */
#define PB6_REFO1_OUT MCHP_PINMUX(b, 6, 0x2c0, 3, periph)
/* pb6_refo2_out */
#define PB6_REFO2_OUT MCHP_PINMUX(b, 6, 0x2c0, 4, periph)
/* pb6_refo3_out */
#define PB6_REFO3_OUT MCHP_PINMUX(b, 6, 0x2c0, 5, periph)
/* pb6_refo4_out */
#define PB6_REFO4_OUT MCHP_PINMUX(b, 6, 0x2c0, 6, periph)
/* pb6_scom0p0_out */
#define PB6_SCOM0P0_OUT MCHP_PINMUX(b, 6, 0x2bc, 2, periph)
/* pb6_scom0p1_in */
#define PB6_SCOM0P1_IN MCHP_PINMUX(b, 6, 0x44, 6, periph)
/* pb6_scom0p1_out */
#define PB6_SCOM0P1_OUT MCHP_PINMUX(b, 6, 0x2c0, 1, periph)
/* pb6_scom0p2_in */
#define PB6_SCOM0P2_IN MCHP_PINMUX(b, 6, 0x48, 12, periph)
/* pb6_scom0p3_out */
#define PB6_SCOM0P3_OUT MCHP_PINMUX(b, 6, 0x2bc, 3, periph)
/* pb6_scom1p0_in */
#define PB6_SCOM1P0_IN MCHP_PINMUX(b, 6, 0x50, 5, periph)
/* pb6_scom1p1_in */
#define PB6_SCOM1P1_IN MCHP_PINMUX(b, 6, 0x54, 6, periph)
/* pb6_scom1p1_out */
#define PB6_SCOM1P1_OUT MCHP_PINMUX(b, 6, 0x2c0, 2, periph)
/* pb6_scom1p2_out */
#define PB6_SCOM1P2_OUT MCHP_PINMUX(b, 6, 0x2bc, 4, periph)
/* pb6_scom1p3_out */
#define PB6_SCOM1P3_OUT MCHP_PINMUX(b, 6, 0x2bc, 6, periph)
/* pb6_tc0wo0_out */
#define PB6_TC0WO0_OUT MCHP_PINMUX(b, 6, 0x2bc, 15, periph)
/* pb6_tc0wo1g3_in */
#define PB6_TC0WO1G3_IN MCHP_PINMUX(b, 6, 0xb8, 5, periph)
/* pb6_tc0wo1g4_in */
#define PB6_TC0WO1G4_IN MCHP_PINMUX(b, 6, 0xbc, 12, periph)
/* pb6_tc1wo0_out */
#define PB6_TC1WO0_OUT MCHP_PINMUX(b, 6, 0x2bc, 16, periph)
/* pb6_tc2wo0g3_in */
#define PB6_TC2WO0G3_IN MCHP_PINMUX(b, 6, 0xcc, 5, periph)
/* pb6_tc2wo0_out */
#define PB6_TC2WO0_OUT MCHP_PINMUX(b, 6, 0x2bc, 17, periph)
/* pb6_tc2wo1g4_in */
#define PB6_TC2WO1G4_IN MCHP_PINMUX(b, 6, 0xd4, 12, periph)
/* pb6_tc3wo0g3_in */
#define PB6_TC3WO0G3_IN MCHP_PINMUX(b, 6, 0xdc, 5, periph)
/* pb6_tc3wo0_out */
#define PB6_TC3WO0_OUT MCHP_PINMUX(b, 6, 0x2bc, 18, periph)
/* pb6_tc3wo1g4_in */
#define PB6_TC3WO1G4_IN MCHP_PINMUX(b, 6, 0xe4, 12, periph)
/* pb6_tc4wo0g3_in */
#define PB6_TC4WO0G3_IN MCHP_PINMUX(b, 6, 0xec, 5, periph)
/* pb6_tc4wo0_out */
#define PB6_TC4WO0_OUT MCHP_PINMUX(b, 6, 0x2bc, 19, periph)
/* pb6_tc4wo1g4_in */
#define PB6_TC4WO1G4_IN MCHP_PINMUX(b, 6, 0xf4, 12, periph)
/* pb6_tc5wo0g3_in */
#define PB6_TC5WO0G3_IN MCHP_PINMUX(b, 6, 0xfc, 5, periph)
/* pb6_tc5wo0_out */
#define PB6_TC5WO0_OUT MCHP_PINMUX(b, 6, 0x2bc, 20, periph)
/* pb6_tc5wo1g4_in */
#define PB6_TC5WO1G4_IN MCHP_PINMUX(b, 6, 0x104, 12, periph)
/* pb6_tc6wo0g3_in */
#define PB6_TC6WO0G3_IN MCHP_PINMUX(b, 6, 0x10c, 5, periph)
/* pb6_tc6wo0_out */
#define PB6_TC6WO0_OUT MCHP_PINMUX(b, 6, 0x2bc, 21, periph)
/* pb6_tc6wo1g4_in */
#define PB6_TC6WO1G4_IN MCHP_PINMUX(b, 6, 0x114, 12, periph)
/* pb6_tc7wo0g3_in */
#define PB6_TC7WO0G3_IN MCHP_PINMUX(b, 6, 0x11c, 5, periph)
/* pb6_tc7wo0_out */
#define PB6_TC7WO0_OUT MCHP_PINMUX(b, 6, 0x2bc, 22, periph)
/* pb6_tc7wo1g4_in */
#define PB6_TC7WO1G4_IN MCHP_PINMUX(b, 6, 0x124, 12, periph)
/* pb6_tcc0wo0_out */
#define PB6_TCC0WO0_OUT MCHP_PINMUX(b, 6, 0x2bc, 8, periph)
/* pb6_tcc0wo2_out */
#define PB6_TCC0WO2_OUT MCHP_PINMUX(b, 6, 0x2bc, 7, periph)
/* pb6_tcc0wo4_out */
#define PB6_TCC0WO4_OUT MCHP_PINMUX(b, 6, 0x2bc, 9, periph)
/* pb6_tcc1wo0_out */
#define PB6_TCC1WO0_OUT MCHP_PINMUX(b, 6, 0x2bc, 11, periph)
/* pb6_tcc1wo2_out */
#define PB6_TCC1WO2_OUT MCHP_PINMUX(b, 6, 0x2bc, 10, periph)
/* pb6_tcc1wo4_out */
#define PB6_TCC1WO4_OUT MCHP_PINMUX(b, 6, 0x2bc, 12, periph)
/* pb6_tcc2wo0_out */
#define PB6_TCC2WO0_OUT MCHP_PINMUX(b, 6, 0x2bc, 13, periph)
/* pb7_cclin0_in */
#define PB7_CCLIN0_IN MCHP_PINMUX(b, 7, 0x98, 13, periph)
/* pb7_cclin3_in */
#define PB7_CCLIN3_IN MCHP_PINMUX(b, 7, 0xa4, 13, periph)
/* pb7_cclout1_out */
#define PB7_CCLOUT1_OUT MCHP_PINMUX(b, 7, 0x2c8, 27, periph)
/* pb7_extint0_in */
#define PB7_EXTINT0_IN MCHP_PINMUX(b, 7, 0x0, 13, periph)
/* pb7_extint3_in */
#define PB7_EXTINT3_IN MCHP_PINMUX(b, 7, 0xc, 5, periph)
/* pb7_nmi_in */
#define PB7_NMI_IN MCHP_PINMUX(b, 7, 0x3c, 5, periph)
/* pb7_qcs_out */
#define PB7_QCS_OUT MCHP_PINMUX(b, 7, 0x2c8, 23, periph)
/* pb7_qd0_in */
#define PB7_QD0_IN MCHP_PINMUX(b, 7, 0x84, 5, periph)
/* pb7_qd0_out */
#define PB7_QD0_OUT MCHP_PINMUX(b, 7, 0x2c8, 26, periph)
/* pb7_qd1_in */
#define PB7_QD1_IN MCHP_PINMUX(b, 7, 0x88, 13, periph)
/* pb7_qd1_out */
#define PB7_QD1_OUT MCHP_PINMUX(b, 7, 0x2c8, 25, periph)
/* pb7_qd2_out */
#define PB7_QD2_OUT MCHP_PINMUX(b, 7, 0x2c8, 24, periph)
/* pb7_qsck_out */
#define PB7_QSCK_OUT MCHP_PINMUX(b, 7, 0x2c4, 7, periph)
/* pb7_refo1_out */
#define PB7_REFO1_OUT MCHP_PINMUX(b, 7, 0x2c4, 3, periph)
/* pb7_refo2_out */
#define PB7_REFO2_OUT MCHP_PINMUX(b, 7, 0x2c4, 4, periph)
/* pb7_refo3_out */
#define PB7_REFO3_OUT MCHP_PINMUX(b, 7, 0x2c4, 5, periph)
/* pb7_refo4_out */
#define PB7_REFO4_OUT MCHP_PINMUX(b, 7, 0x2c4, 6, periph)
/* pb7_scom0p0_out */
#define PB7_SCOM0P0_OUT MCHP_PINMUX(b, 7, 0x2c8, 3, periph)
/* pb7_scom0p1_out */
#define PB7_SCOM0P1_OUT MCHP_PINMUX(b, 7, 0x2c4, 1, periph)
/* pb7_scom0p2_in */
#define PB7_SCOM0P2_IN MCHP_PINMUX(b, 7, 0x48, 5, periph)
/* pb7_scom0p2_out */
#define PB7_SCOM0P2_OUT MCHP_PINMUX(b, 7, 0x2c8, 1, periph)
/* pb7_scom0p3_in */
#define PB7_SCOM0P3_IN MCHP_PINMUX(b, 7, 0x4c, 13, periph)
/* pb7_scom1p0_out */
#define PB7_SCOM1P0_OUT MCHP_PINMUX(b, 7, 0x2c8, 6, periph)
/* pb7_scom1p1_out */
#define PB7_SCOM1P1_OUT MCHP_PINMUX(b, 7, 0x2c4, 2, periph)
/* pb7_scom1p2_in */
#define PB7_SCOM1P2_IN MCHP_PINMUX(b, 7, 0x58, 13, periph)
/* pb7_scom1p3_out */
#define PB7_SCOM1P3_OUT MCHP_PINMUX(b, 7, 0x2c8, 4, periph)
/* pb7_tc0wo0g1_in */
#define PB7_TC0WO0G1_IN MCHP_PINMUX(b, 7, 0xb0, 13, periph)
/* pb7_tc0wo0_out */
#define PB7_TC0WO0_OUT MCHP_PINMUX(b, 7, 0x2c8, 15, periph)
/* pb7_tc0wo1g4_in */
#define PB7_TC0WO1G4_IN MCHP_PINMUX(b, 7, 0xbc, 5, periph)
/* pb7_tc1wo0g1_in */
#define PB7_TC1WO0G1_IN MCHP_PINMUX(b, 7, 0xc0, 13, periph)
/* pb7_tc1wo1_out */
#define PB7_TC1WO1_OUT MCHP_PINMUX(b, 7, 0x2c8, 16, periph)
/* pb7_tc2wo0g1_in */
#define PB7_TC2WO0G1_IN MCHP_PINMUX(b, 7, 0xc8, 13, periph)
/* pb7_tc2wo1g4_in */
#define PB7_TC2WO1G4_IN MCHP_PINMUX(b, 7, 0xd4, 5, periph)
/* pb7_tc2wo1_out */
#define PB7_TC2WO1_OUT MCHP_PINMUX(b, 7, 0x2c8, 17, periph)
/* pb7_tc3wo0g1_in */
#define PB7_TC3WO0G1_IN MCHP_PINMUX(b, 7, 0xd8, 13, periph)
/* pb7_tc3wo1g4_in */
#define PB7_TC3WO1G4_IN MCHP_PINMUX(b, 7, 0xe4, 5, periph)
/* pb7_tc3wo1_out */
#define PB7_TC3WO1_OUT MCHP_PINMUX(b, 7, 0x2c8, 18, periph)
/* pb7_tc4wo0g1_in */
#define PB7_TC4WO0G1_IN MCHP_PINMUX(b, 7, 0xe8, 13, periph)
/* pb7_tc4wo1g4_in */
#define PB7_TC4WO1G4_IN MCHP_PINMUX(b, 7, 0xf4, 5, periph)
/* pb7_tc4wo1_out */
#define PB7_TC4WO1_OUT MCHP_PINMUX(b, 7, 0x2c8, 19, periph)
/* pb7_tc5wo0g1_in */
#define PB7_TC5WO0G1_IN MCHP_PINMUX(b, 7, 0xf8, 13, periph)
/* pb7_tc5wo1g4_in */
#define PB7_TC5WO1G4_IN MCHP_PINMUX(b, 7, 0x104, 5, periph)
/* pb7_tc5wo1_out */
#define PB7_TC5WO1_OUT MCHP_PINMUX(b, 7, 0x2c8, 20, periph)
/* pb7_tc6wo0g1_in */
#define PB7_TC6WO0G1_IN MCHP_PINMUX(b, 7, 0x108, 13, periph)
/* pb7_tc6wo1g4_in */
#define PB7_TC6WO1G4_IN MCHP_PINMUX(b, 7, 0x114, 5, periph)
/* pb7_tc6wo1_out */
#define PB7_TC6WO1_OUT MCHP_PINMUX(b, 7, 0x2c8, 21, periph)
/* pb7_tc7wo0g1_in */
#define PB7_TC7WO0G1_IN MCHP_PINMUX(b, 7, 0x118, 13, periph)
/* pb7_tc7wo1g4_in */
#define PB7_TC7WO1G4_IN MCHP_PINMUX(b, 7, 0x124, 5, periph)
/* pb7_tc7wo1_out */
#define PB7_TC7WO1_OUT MCHP_PINMUX(b, 7, 0x2c8, 22, periph)
/* pb7_tcc0wo1_out */
#define PB7_TCC0WO1_OUT MCHP_PINMUX(b, 7, 0x2c8, 8, periph)
/* pb7_tcc0wo3_out */
#define PB7_TCC0WO3_OUT MCHP_PINMUX(b, 7, 0x2c8, 7, periph)
/* pb7_tcc0wo5_out */
#define PB7_TCC0WO5_OUT MCHP_PINMUX(b, 7, 0x2c8, 9, periph)
/* pb7_tcc1wo1_out */
#define PB7_TCC1WO1_OUT MCHP_PINMUX(b, 7, 0x2c8, 11, periph)
/* pb7_tcc1wo3_out */
#define PB7_TCC1WO3_OUT MCHP_PINMUX(b, 7, 0x2c8, 10, periph)
/* pb7_tcc1wo5_out */
#define PB7_TCC1WO5_OUT MCHP_PINMUX(b, 7, 0x2c8, 12, periph)
/* pb7_tcc2wo1_out */
#define PB7_TCC2WO1_OUT MCHP_PINMUX(b, 7, 0x2c8, 13, periph)
/* pb8_cclin0_in */
#define PB8_CCLIN0_IN MCHP_PINMUX(b, 8, 0x98, 6, periph)
/* pb8_cclin1_in */
#define PB8_CCLIN1_IN MCHP_PINMUX(b, 8, 0x9c, 13, periph)
/* pb8_cclin3_in */
#define PB8_CCLIN3_IN MCHP_PINMUX(b, 8, 0xa4, 6, periph)
/* pb8_cclin4_in */
#define PB8_CCLIN4_IN MCHP_PINMUX(b, 8, 0xa8, 13, periph)
/* pb8_cclout1_out */
#define PB8_CCLOUT1_OUT MCHP_PINMUX(b, 8, 0x2d0, 27, periph)
/* pb8_extint0_in */
#define PB8_EXTINT0_IN MCHP_PINMUX(b, 8, 0x0, 6, periph)
/* pb8_extint1_in */
#define PB8_EXTINT1_IN MCHP_PINMUX(b, 8, 0x4, 13, periph)
/* pb8_qd0_out */
#define PB8_QD0_OUT MCHP_PINMUX(b, 8, 0x2d0, 24, periph)
/* pb8_qd1_in */
#define PB8_QD1_IN MCHP_PINMUX(b, 8, 0x88, 6, periph)
/* pb8_qd2_in */
#define PB8_QD2_IN MCHP_PINMUX(b, 8, 0x8c, 13, periph)
/* pb8_qd2_out */
#define PB8_QD2_OUT MCHP_PINMUX(b, 8, 0x2d0, 26, periph)
/* pb8_qd3_out */
#define PB8_QD3_OUT MCHP_PINMUX(b, 8, 0x2d0, 25, periph)
/* pb8_qsck_out */
#define PB8_QSCK_OUT MCHP_PINMUX(b, 8, 0x2cc, 7, periph)
/* pb8_qspics_out */
#define PB8_QSPICS_OUT MCHP_PINMUX(b, 8, 0x2d0, 23, periph)
/* pb8_refi_in */
#define PB8_REFI_IN MCHP_PINMUX(b, 8, 0x94, 7, periph)
/* pb8_refo1_out */
#define PB8_REFO1_OUT MCHP_PINMUX(b, 8, 0x2cc, 3, periph)
/* pb8_refo2_out */
#define PB8_REFO2_OUT MCHP_PINMUX(b, 8, 0x2cc, 4, periph)
/* pb8_refo3_out */
#define PB8_REFO3_OUT MCHP_PINMUX(b, 8, 0x2cc, 5, periph)
/* pb8_refo4_out */
#define PB8_REFO4_OUT MCHP_PINMUX(b, 8, 0x2cc, 6, periph)
/* pb8_scom0p0_in */
#define PB8_SCOM0P0_IN MCHP_PINMUX(b, 8, 0x40, 13, periph)
/* pb8_scom0p0_out */
#define PB8_SCOM0P0_OUT MCHP_PINMUX(b, 8, 0x2d0, 1, periph)
/* pb8_scom0p1_in */
#define PB8_SCOM0P1_IN MCHP_PINMUX(b, 8, 0x44, 7, periph)
/* pb8_scom0p1_out */
#define PB8_SCOM0P1_OUT MCHP_PINMUX(b, 8, 0x2cc, 1, periph)
/* pb8_scom0p2_out */
#define PB8_SCOM0P2_OUT MCHP_PINMUX(b, 8, 0x2d0, 3, periph)
/* pb8_scom0p3_in */
#define PB8_SCOM0P3_IN MCHP_PINMUX(b, 8, 0x4c, 6, periph)
/* pb8_scom0p3_out */
#define PB8_SCOM0P3_OUT MCHP_PINMUX(b, 8, 0x2d0, 2, periph)
/* pb8_scom1p1_in */
#define PB8_SCOM1P1_IN MCHP_PINMUX(b, 8, 0x54, 7, periph)
/* pb8_scom1p1_out */
#define PB8_SCOM1P1_OUT MCHP_PINMUX(b, 8, 0x2cc, 2, periph)
/* pb8_scom1p2_in */
#define PB8_SCOM1P2_IN MCHP_PINMUX(b, 8, 0x58, 6, periph)
/* pb8_scom1p2_out */
#define PB8_SCOM1P2_OUT MCHP_PINMUX(b, 8, 0x2d0, 6, periph)
/* pb8_scom1p3_in */
#define PB8_SCOM1P3_IN MCHP_PINMUX(b, 8, 0x5c, 13, periph)
/* pb8_scom1p3_out */
#define PB8_SCOM1P3_OUT MCHP_PINMUX(b, 8, 0x2d0, 5, periph)
/* pb8_tc0wo0g1_in */
#define PB8_TC0WO0G1_IN MCHP_PINMUX(b, 8, 0xb0, 6, periph)
/* pb8_tc0wo0g2_in */
#define PB8_TC0WO0G2_IN MCHP_PINMUX(b, 8, 0xb4, 13, periph)
/* pb8_tc0wo1_out */
#define PB8_TC0WO1_OUT MCHP_PINMUX(b, 8, 0x2d0, 15, periph)
/* pb8_tc1wo0g1_in */
#define PB8_TC1WO0G1_IN MCHP_PINMUX(b, 8, 0xc0, 6, periph)
/* pb8_tc1wo1g2_in */
#define PB8_TC1WO1G2_IN MCHP_PINMUX(b, 8, 0xc4, 13, periph)
/* pb8_tc1wo1_out */
#define PB8_TC1WO1_OUT MCHP_PINMUX(b, 8, 0x2d0, 16, periph)
/* pb8_tc2wo0g1_in */
#define PB8_TC2WO0G1_IN MCHP_PINMUX(b, 8, 0xc8, 6, periph)
/* pb8_tc2wo1g2_in */
#define PB8_TC2WO1G2_IN MCHP_PINMUX(b, 8, 0xd0, 13, periph)
/* pb8_tc2wo1_out */
#define PB8_TC2WO1_OUT MCHP_PINMUX(b, 8, 0x2d0, 17, periph)
/* pb8_tc3wo0g1_in */
#define PB8_TC3WO0G1_IN MCHP_PINMUX(b, 8, 0xd8, 6, periph)
/* pb8_tc3wo1g2_in */
#define PB8_TC3WO1G2_IN MCHP_PINMUX(b, 8, 0xe0, 13, periph)
/* pb8_tc3wo1_out */
#define PB8_TC3WO1_OUT MCHP_PINMUX(b, 8, 0x2d0, 18, periph)
/* pb8_tc4wo0g1_in */
#define PB8_TC4WO0G1_IN MCHP_PINMUX(b, 8, 0xe8, 6, periph)
/* pb8_tc4wo1g2_in */
#define PB8_TC4WO1G2_IN MCHP_PINMUX(b, 8, 0xf0, 13, periph)
/* pb8_tc4wo1_out */
#define PB8_TC4WO1_OUT MCHP_PINMUX(b, 8, 0x2d0, 19, periph)
/* pb8_tc5wo0g1_in */
#define PB8_TC5WO0G1_IN MCHP_PINMUX(b, 8, 0xf8, 6, periph)
/* pb8_tc5wo1g2_in */
#define PB8_TC5WO1G2_IN MCHP_PINMUX(b, 8, 0x100, 13, periph)
/* pb8_tc5wo1_out */
#define PB8_TC5WO1_OUT MCHP_PINMUX(b, 8, 0x2d0, 20, periph)
/* pb8_tc6wo0g1_in */
#define PB8_TC6WO0G1_IN MCHP_PINMUX(b, 8, 0x108, 6, periph)
/* pb8_tc6wo1g2_in */
#define PB8_TC6WO1G2_IN MCHP_PINMUX(b, 8, 0x110, 13, periph)
/* pb8_tc6wo1_out */
#define PB8_TC6WO1_OUT MCHP_PINMUX(b, 8, 0x2d0, 21, periph)
/* pb8_tc7wo0g1_in */
#define PB8_TC7WO0G1_IN MCHP_PINMUX(b, 8, 0x118, 6, periph)
/* pb8_tc7wo1g2_in */
#define PB8_TC7WO1G2_IN MCHP_PINMUX(b, 8, 0x120, 13, periph)
/* pb8_tc7wo1_out */
#define PB8_TC7WO1_OUT MCHP_PINMUX(b, 8, 0x2d0, 22, periph)
/* pb8_tcc0wo1_out */
#define PB8_TCC0WO1_OUT MCHP_PINMUX(b, 8, 0x2d0, 7, periph)
/* pb8_tcc0wo3_out */
#define PB8_TCC0WO3_OUT MCHP_PINMUX(b, 8, 0x2d0, 9, periph)
/* pb8_tcc0wo5_out */
#define PB8_TCC0WO5_OUT MCHP_PINMUX(b, 8, 0x2d0, 8, periph)
/* pb8_tcc1wo1_out */
#define PB8_TCC1WO1_OUT MCHP_PINMUX(b, 8, 0x2d0, 10, periph)
/* pb8_tcc1wo3_out */
#define PB8_TCC1WO3_OUT MCHP_PINMUX(b, 8, 0x2d0, 12, periph)
/* pb8_tcc1wo5_out */
#define PB8_TCC1WO5_OUT MCHP_PINMUX(b, 8, 0x2d0, 11, periph)
/* pb8_tcc2wo1_out */
#define PB8_TCC2WO1_OUT MCHP_PINMUX(b, 8, 0x2d0, 13, periph)
/* pb9_cclin1_in */
#define PB9_CCLIN1_IN MCHP_PINMUX(b, 9, 0x9c, 6, periph)
/* pb9_cclin2_in */
#define PB9_CCLIN2_IN MCHP_PINMUX(b, 9, 0xa0, 13, periph)
/* pb9_cclin4_in */
#define PB9_CCLIN4_IN MCHP_PINMUX(b, 9, 0xa8, 6, periph)
/* pb9_cclin5_in */
#define PB9_CCLIN5_IN MCHP_PINMUX(b, 9, 0xac, 13, periph)
/* pb9_cclout0_out */
#define PB9_CCLOUT0_OUT MCHP_PINMUX(b, 9, 0x2d8, 27, periph)
/* pb9_extint1_in */
