zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz3/pic32cx5109bz31048-pinctrl.h
#define PB9_EXTINT1_IN MCHP_PINMUX(b, 9, 0x4, 6, periph)
/* pb9_extint2_in */
#define PB9_EXTINT2_IN MCHP_PINMUX(b, 9, 0x8, 13, periph)
/* pb9_qcs_out */
#define PB9_QCS_OUT MCHP_PINMUX(b, 9, 0x2d8, 23, periph)
/* pb9_qd0_out */
#define PB9_QD0_OUT MCHP_PINMUX(b, 9, 0x2d8, 25, periph)
/* pb9_qd1_out */
#define PB9_QD1_OUT MCHP_PINMUX(b, 9, 0x2d8, 24, periph)
/* pb9_qd2_in */
#define PB9_QD2_IN MCHP_PINMUX(b, 9, 0x8c, 6, periph)
/* pb9_qd3_in */
#define PB9_QD3_IN MCHP_PINMUX(b, 9, 0x90, 13, periph)
/* pb9_qd3_out */
#define PB9_QD3_OUT MCHP_PINMUX(b, 9, 0x2d8, 26, periph)
/* pb9_qsck_out */
#define PB9_QSCK_OUT MCHP_PINMUX(b, 9, 0x2d4, 7, periph)
/* pb9_refi_in */
#define PB9_REFI_IN MCHP_PINMUX(b, 9, 0x94, 8, periph)
/* pb9_refo1_out */
#define PB9_REFO1_OUT MCHP_PINMUX(b, 9, 0x2d4, 3, periph)
/* pb9_refo2_out */
#define PB9_REFO2_OUT MCHP_PINMUX(b, 9, 0x2d4, 4, periph)
/* pb9_refo3_out */
#define PB9_REFO3_OUT MCHP_PINMUX(b, 9, 0x2d4, 5, periph)
/* pb9_refo4_out */
#define PB9_REFO4_OUT MCHP_PINMUX(b, 9, 0x2d4, 6, periph)
/* pb9_scom0p0_in */
#define PB9_SCOM0P0_IN MCHP_PINMUX(b, 9, 0x40, 6, periph)
/* pb9_scom0p0_out */
#define PB9_SCOM0P0_OUT MCHP_PINMUX(b, 9, 0x2d8, 2, periph)
/* pb9_scom0p1_in */
#define PB9_SCOM0P1_IN MCHP_PINMUX(b, 9, 0x44, 8, periph)
/* pb9_scom0p1_out */
#define PB9_SCOM0P1_OUT MCHP_PINMUX(b, 9, 0x2d4, 1, periph)
/* pb9_scom0p3_out */
#define PB9_SCOM0P3_OUT MCHP_PINMUX(b, 9, 0x2d8, 3, periph)
/* pb9_scom1p0_in */
#define PB9_SCOM1P0_IN MCHP_PINMUX(b, 9, 0x50, 13, periph)
/* pb9_scom1p1_in */
#define PB9_SCOM1P1_IN MCHP_PINMUX(b, 9, 0x54, 8, periph)
/* pb9_scom1p1_out */
#define PB9_SCOM1P1_OUT MCHP_PINMUX(b, 9, 0x2d4, 2, periph)
/* pb9_scom1p2_out */
#define PB9_SCOM1P2_OUT MCHP_PINMUX(b, 9, 0x2d8, 4, periph)
/* pb9_scom1p3_in */
#define PB9_SCOM1P3_IN MCHP_PINMUX(b, 9, 0x5c, 6, periph)
/* pb9_scom1p3_out */
#define PB9_SCOM1P3_OUT MCHP_PINMUX(b, 9, 0x2d8, 6, periph)
/* pb9_tc0wo0g2_in */
#define PB9_TC0WO0G2_IN MCHP_PINMUX(b, 9, 0xb4, 6, periph)
/* pb9_tc0wo0_out */
#define PB9_TC0WO0_OUT MCHP_PINMUX(b, 9, 0x2d8, 15, periph)
/* pb9_tc0wo1g3_in */
#define PB9_TC0WO1G3_IN MCHP_PINMUX(b, 9, 0xb8, 13, periph)
/* pb9_tc1wo0_out */
#define PB9_TC1WO0_OUT MCHP_PINMUX(b, 9, 0x2d8, 16, periph)
/* pb9_tc1wo1g2_in */
#define PB9_TC1WO1G2_IN MCHP_PINMUX(b, 9, 0xc4, 6, periph)
/* pb9_tc2wo0g3_in */
#define PB9_TC2WO0G3_IN MCHP_PINMUX(b, 9, 0xcc, 13, periph)
/* pb9_tc2wo0_out */
#define PB9_TC2WO0_OUT MCHP_PINMUX(b, 9, 0x2d8, 17, periph)
/* pb9_tc2wo1g2_in */
#define PB9_TC2WO1G2_IN MCHP_PINMUX(b, 9, 0xd0, 6, periph)
/* pb9_tc3wo0g3_in */
#define PB9_TC3WO0G3_IN MCHP_PINMUX(b, 9, 0xdc, 13, periph)
/* pb9_tc3wo0_out */
#define PB9_TC3WO0_OUT MCHP_PINMUX(b, 9, 0x2d8, 18, periph)
/* pb9_tc3wo1g2_in */
#define PB9_TC3WO1G2_IN MCHP_PINMUX(b, 9, 0xe0, 6, periph)
/* pb9_tc4wo0g3_in */
#define PB9_TC4WO0G3_IN MCHP_PINMUX(b, 9, 0xec, 13, periph)
/* pb9_tc4wo0_out */
#define PB9_TC4WO0_OUT MCHP_PINMUX(b, 9, 0x2d8, 19, periph)
/* pb9_tc4wo1g2_in */
#define PB9_TC4WO1G2_IN MCHP_PINMUX(b, 9, 0xf0, 6, periph)
/* pb9_tc5wo0g3_in */
#define PB9_TC5WO0G3_IN MCHP_PINMUX(b, 9, 0xfc, 13, periph)
/* pb9_tc5wo0_out */
#define PB9_TC5WO0_OUT MCHP_PINMUX(b, 9, 0x2d8, 20, periph)
/* pb9_tc5wo1g2_in */
#define PB9_TC5WO1G2_IN MCHP_PINMUX(b, 9, 0x100, 6, periph)
/* pb9_tc6wo0g3_in */
#define PB9_TC6WO0G3_IN MCHP_PINMUX(b, 9, 0x10c, 13, periph)
/* pb9_tc6wo0_out */
#define PB9_TC6WO0_OUT MCHP_PINMUX(b, 9, 0x2d8, 21, periph)
/* pb9_tc6wo1g2_in */
#define PB9_TC6WO1G2_IN MCHP_PINMUX(b, 9, 0x110, 6, periph)
/* pb9_tc7wo0g3_in */
#define PB9_TC7WO0G3_IN MCHP_PINMUX(b, 9, 0x11c, 13, periph)
/* pb9_tc7wo0_out */
#define PB9_TC7WO0_OUT MCHP_PINMUX(b, 9, 0x2d8, 22, periph)
/* pb9_tc7wo1g2_in */
#define PB9_TC7WO1G2_IN MCHP_PINMUX(b, 9, 0x120, 6, periph)
/* pb9_tcc0wo0_out */
#define PB9_TCC0WO0_OUT MCHP_PINMUX(b, 9, 0x2d8, 8, periph)
/* pb9_tcc0wo2_out */
#define PB9_TCC0WO2_OUT MCHP_PINMUX(b, 9, 0x2d8, 7, periph)
/* pb9_tcc0wo4_out */
#define PB9_TCC0WO4_OUT MCHP_PINMUX(b, 9, 0x2d8, 9, periph)
/* pb9_tcc1wo0_out */
#define PB9_TCC1WO0_OUT MCHP_PINMUX(b, 9, 0x2d8, 11, periph)
/* pb9_tcc1wo2_out */
#define PB9_TCC1WO2_OUT MCHP_PINMUX(b, 9, 0x2d8, 10, periph)
/* pb9_tcc1wo4_out */
#define PB9_TCC1WO4_OUT MCHP_PINMUX(b, 9, 0x2d8, 12, periph)
/* pb9_tcc2wo0_out */
#define PB9_TCC2WO0_OUT MCHP_PINMUX(b, 9, 0x2d8, 13, periph)
/* pb10_cclin2_in */
#define PB10_CCLIN2_IN MCHP_PINMUX(b, 10, 0xa0, 6, periph)
/* pb10_cclin5_in */
#define PB10_CCLIN5_IN MCHP_PINMUX(b, 10, 0xac, 6, periph)
/* pb10_cclout0_out */
#define PB10_CCLOUT0_OUT MCHP_PINMUX(b, 10, 0x2dc, 27, periph)
/* pb10_cclout1_out */
#define PB10_CCLOUT1_OUT MCHP_PINMUX(b, 10, 0x2e0, 27, periph)
/* pb10_extint2_in */
#define PB10_EXTINT2_IN MCHP_PINMUX(b, 10, 0x8, 6, periph)
/* pb10_extint3_in */
#define PB10_EXTINT3_IN MCHP_PINMUX(b, 10, 0xc, 13, periph)
/* pb10_nmi_in */
#define PB10_NMI_IN MCHP_PINMUX(b, 10, 0x3c, 13, periph)
/* pb10_qcs_out */
#define PB10_QCS_OUT MCHP_PINMUX(b, 10, 0x2dc, 23, periph)
/* pb10_qd0_in */
#define PB10_QD0_IN MCHP_PINMUX(b, 10, 0x84, 13, periph)
/* pb10_qd0_out */
#define PB10_QD0_OUT MCHP_PINMUX(b, 10, 0x2dc, 25, periph)
/* pb10_qd1_out */
#define PB10_QD1_OUT MCHP_PINMUX(b, 10, 0x2dc, 24, periph)
/* pb10_qd2_out */
#define PB10_QD2_OUT MCHP_PINMUX(b, 10, 0x2e0, 24, periph)
/* pb10_qd3_in */
#define PB10_QD3_IN MCHP_PINMUX(b, 10, 0x90, 6, periph)
/* pb10_qd3_out */
#define PB10_QD3_OUT MCHP_PINMUX(b, 10, 0x2dc, 26, periph)
/* pb10_scom0p0_out */
#define PB10_SCOM0P0_OUT MCHP_PINMUX(b, 10, 0x2dc, 2, periph)
/* pb10_scom0p2_in */
#define PB10_SCOM0P2_IN MCHP_PINMUX(b, 10, 0x48, 13, periph)
/* pb10_scom0p2_out */
#define PB10_SCOM0P2_OUT MCHP_PINMUX(b, 10, 0x2e0, 1, periph)
/* pb10_scom0p3_out */
#define PB10_SCOM0P3_OUT MCHP_PINMUX(b, 10, 0x2dc, 3, periph)
/* pb10_scom1p0_in */
#define PB10_SCOM1P0_IN MCHP_PINMUX(b, 10, 0x50, 6, periph)
/* pb10_scom1p0_out */
#define PB10_SCOM1P0_OUT MCHP_PINMUX(b, 10, 0x2e0, 6, periph)
/* pb10_scom1p2_out */
#define PB10_SCOM1P2_OUT MCHP_PINMUX(b, 10, 0x2dc, 4, periph)
/* pb10_scom1p3_out */
#define PB10_SCOM1P3_OUT MCHP_PINMUX(b, 10, 0x2dc, 6, periph)
/* pb10_tc0wo0_out */
#define PB10_TC0WO0_OUT MCHP_PINMUX(b, 10, 0x2dc, 15, periph)
/* pb10_tc0wo1g3_in */
#define PB10_TC0WO1G3_IN MCHP_PINMUX(b, 10, 0xb8, 6, periph)
/* pb10_tc0wo1g4_in */
#define PB10_TC0WO1G4_IN MCHP_PINMUX(b, 10, 0xbc, 13, periph)
/* pb10_tc1wo0_out */
#define PB10_TC1WO0_OUT MCHP_PINMUX(b, 10, 0x2dc, 16, periph)
/* pb10_tc1wo1_out */
#define PB10_TC1WO1_OUT MCHP_PINMUX(b, 10, 0x2e0, 16, periph)
/* pb10_tc2wo0g3_in */
#define PB10_TC2WO0G3_IN MCHP_PINMUX(b, 10, 0xcc, 6, periph)
/* pb10_tc2wo0_out */
#define PB10_TC2WO0_OUT MCHP_PINMUX(b, 10, 0x2dc, 17, periph)
/* pb10_tc2wo1g4_in */
#define PB10_TC2WO1G4_IN MCHP_PINMUX(b, 10, 0xd4, 13, periph)
/* pb10_tc2wo1_out */
#define PB10_TC2WO1_OUT MCHP_PINMUX(b, 10, 0x2e0, 17, periph)
/* pb10_tc3wo0g3_in */
#define PB10_TC3WO0G3_IN MCHP_PINMUX(b, 10, 0xdc, 6, periph)
/* pb10_tc3wo0_out */
#define PB10_TC3WO0_OUT MCHP_PINMUX(b, 10, 0x2dc, 18, periph)
/* pb10_tc3wo1g4_in */
#define PB10_TC3WO1G4_IN MCHP_PINMUX(b, 10, 0xe4, 13, periph)
/* pb10_tc3wo1_out */
#define PB10_TC3WO1_OUT MCHP_PINMUX(b, 10, 0x2e0, 18, periph)
/* pb10_tc4wo0g3_in */
#define PB10_TC4WO0G3_IN MCHP_PINMUX(b, 10, 0xec, 6, periph)
/* pb10_tc4wo0_out */
#define PB10_TC4WO0_OUT MCHP_PINMUX(b, 10, 0x2dc, 19, periph)
/* pb10_tc4wo1g4_in */
#define PB10_TC4WO1G4_IN MCHP_PINMUX(b, 10, 0xf4, 13, periph)
/* pb10_tc4wo1_out */
#define PB10_TC4WO1_OUT MCHP_PINMUX(b, 10, 0x2e0, 19, periph)
/* pb10_tc5wo0g3_in */
#define PB10_TC5WO0G3_IN MCHP_PINMUX(b, 10, 0xfc, 6, periph)
/* pb10_tc5wo0_out */
#define PB10_TC5WO0_OUT MCHP_PINMUX(b, 10, 0x2dc, 20, periph)
/* pb10_tc5wo1g4_in */
#define PB10_TC5WO1G4_IN MCHP_PINMUX(b, 10, 0x104, 13, periph)
/* pb10_tc5wo1_out */
#define PB10_TC5WO1_OUT MCHP_PINMUX(b, 10, 0x2e0, 20, periph)
/* pb10_tc6wo0g3_in */
#define PB10_TC6WO0G3_IN MCHP_PINMUX(b, 10, 0x10c, 6, periph)
/* pb10_tc6wo0_out */
#define PB10_TC6WO0_OUT MCHP_PINMUX(b, 10, 0x2dc, 21, periph)
/* pb10_tc6wo1g4_in */
#define PB10_TC6WO1G4_IN MCHP_PINMUX(b, 10, 0x114, 13, periph)
/* pb10_tc6wo1_out */
#define PB10_TC6WO1_OUT MCHP_PINMUX(b, 10, 0x2e0, 21, periph)
/* pb10_tc7wo0g3_in */
#define PB10_TC7WO0G3_IN MCHP_PINMUX(b, 10, 0x11c, 6, periph)
/* pb10_tc7wo0_out */
#define PB10_TC7WO0_OUT MCHP_PINMUX(b, 10, 0x2dc, 22, periph)
/* pb10_tc7wo1g4_in */
#define PB10_TC7WO1G4_IN MCHP_PINMUX(b, 10, 0x124, 13, periph)
/* pb10_tc7wo1_out */
#define PB10_TC7WO1_OUT MCHP_PINMUX(b, 10, 0x2e0, 22, periph)
/* pb10_tcc0wo0_out */
#define PB10_TCC0WO0_OUT MCHP_PINMUX(b, 10, 0x2dc, 8, periph)
/* pb10_tcc0wo1_out */
#define PB10_TCC0WO1_OUT MCHP_PINMUX(b, 10, 0x2e0, 8, periph)
/* pb10_tcc0wo2_out */
#define PB10_TCC0WO2_OUT MCHP_PINMUX(b, 10, 0x2dc, 7, periph)
/* pb10_tcc0wo3_out */
#define PB10_TCC0WO3_OUT MCHP_PINMUX(b, 10, 0x2e0, 7, periph)
/* pb10_tcc0wo4_out */
#define PB10_TCC0WO4_OUT MCHP_PINMUX(b, 10, 0x2dc, 9, periph)
/* pb10_tcc0wo5_out */
#define PB10_TCC0WO5_OUT MCHP_PINMUX(b, 10, 0x2e0, 9, periph)
/* pb10_tcc1wo0_out */
#define PB10_TCC1WO0_OUT MCHP_PINMUX(b, 10, 0x2dc, 11, periph)
/* pb10_tcc1wo1_out */
#define PB10_TCC1WO1_OUT MCHP_PINMUX(b, 10, 0x2e0, 11, periph)
/* pb10_tcc1wo2_out */
#define PB10_TCC1WO2_OUT MCHP_PINMUX(b, 10, 0x2dc, 10, periph)
/* pb10_tcc1wo3_out */
#define PB10_TCC1WO3_OUT MCHP_PINMUX(b, 10, 0x2e0, 10, periph)
/* pb10_tcc1wo4_out */
#define PB10_TCC1WO4_OUT MCHP_PINMUX(b, 10, 0x2dc, 12, periph)
/* pb10_tcc1wo5_out */
#define PB10_TCC1WO5_OUT MCHP_PINMUX(b, 10, 0x2e0, 12, periph)
/* pb10_tcc2wo0_out */
#define PB10_TCC2WO0_OUT MCHP_PINMUX(b, 10, 0x2dc, 13, periph)
/* pb10_tcc2wo1_out */
#define PB10_TCC2WO1_OUT MCHP_PINMUX(b, 10, 0x2e0, 13, periph)
/* pb11_cclin0_in */
#define PB11_CCLIN0_IN MCHP_PINMUX(b, 11, 0x98, 14, periph)
/* pb11_cclin3_in */
#define PB11_CCLIN3_IN MCHP_PINMUX(b, 11, 0xa4, 14, periph)
/* pb11_cclout1_out */
#define PB11_CCLOUT1_OUT MCHP_PINMUX(b, 11, 0x2e8, 27, periph)
/* pb11_extint0_in */
#define PB11_EXTINT0_IN MCHP_PINMUX(b, 11, 0x0, 14, periph)
/* pb11_extint3_in */
#define PB11_EXTINT3_IN MCHP_PINMUX(b, 11, 0xc, 6, periph)
/* pb11_nmi_in */
#define PB11_NMI_IN MCHP_PINMUX(b, 11, 0x3c, 6, periph)
/* pb11_qcs_out */
#define PB11_QCS_OUT MCHP_PINMUX(b, 11, 0x2e8, 23, periph)
/* pb11_qd0_in */
#define PB11_QD0_IN MCHP_PINMUX(b, 11, 0x84, 6, periph)
/* pb11_qd0_out */
#define PB11_QD0_OUT MCHP_PINMUX(b, 11, 0x2e8, 26, periph)
/* pb11_qd1_in */
#define PB11_QD1_IN MCHP_PINMUX(b, 11, 0x88, 14, periph)
/* pb11_qd1_out */
#define PB11_QD1_OUT MCHP_PINMUX(b, 11, 0x2e8, 25, periph)
/* pb11_qd2_out */
#define PB11_QD2_OUT MCHP_PINMUX(b, 11, 0x2e8, 24, periph)
/* pb11_scom0p0_out */
#define PB11_SCOM0P0_OUT MCHP_PINMUX(b, 11, 0x2e8, 3, periph)
/* pb11_scom0p2_in */
#define PB11_SCOM0P2_IN MCHP_PINMUX(b, 11, 0x48, 6, periph)
/* pb11_scom0p2_out */
#define PB11_SCOM0P2_OUT MCHP_PINMUX(b, 11, 0x2e8, 1, periph)
/* pb11_scom0p3_in */
#define PB11_SCOM0P3_IN MCHP_PINMUX(b, 11, 0x4c, 14, periph)
/* pb11_scom1p0_out */
#define PB11_SCOM1P0_OUT MCHP_PINMUX(b, 11, 0x2e8, 6, periph)
/* pb11_scom1p2_in */
#define PB11_SCOM1P2_IN MCHP_PINMUX(b, 11, 0x58, 14, periph)
/* pb11_scom1p3_out */
#define PB11_SCOM1P3_OUT MCHP_PINMUX(b, 11, 0x2e8, 4, periph)
/* pb11_tc0wo0g1_in */
#define PB11_TC0WO0G1_IN MCHP_PINMUX(b, 11, 0xb0, 14, periph)
/* pb11_tc0wo0_out */
#define PB11_TC0WO0_OUT MCHP_PINMUX(b, 11, 0x2e8, 15, periph)
/* pb11_tc0wo1g4_in */
#define PB11_TC0WO1G4_IN MCHP_PINMUX(b, 11, 0xbc, 6, periph)
/* pb11_tc1wo0g1_in */
#define PB11_TC1WO0G1_IN MCHP_PINMUX(b, 11, 0xc0, 14, periph)
/* pb11_tc1wo1_out */
#define PB11_TC1WO1_OUT MCHP_PINMUX(b, 11, 0x2e8, 16, periph)
/* pb11_tc2wo0g1_in */
#define PB11_TC2WO0G1_IN MCHP_PINMUX(b, 11, 0xc8, 14, periph)
/* pb11_tc2wo1g4_in */
#define PB11_TC2WO1G4_IN MCHP_PINMUX(b, 11, 0xd4, 6, periph)
/* pb11_tc2wo1_out */
#define PB11_TC2WO1_OUT MCHP_PINMUX(b, 11, 0x2e8, 17, periph)
/* pb11_tc3wo0g1_in */
#define PB11_TC3WO0G1_IN MCHP_PINMUX(b, 11, 0xd8, 14, periph)
/* pb11_tc3wo1g4_in */
#define PB11_TC3WO1G4_IN MCHP_PINMUX(b, 11, 0xe4, 6, periph)
/* pb11_tc3wo1_out */
#define PB11_TC3WO1_OUT MCHP_PINMUX(b, 11, 0x2e8, 18, periph)
/* pb11_tc4wo0g1_in */
#define PB11_TC4WO0G1_IN MCHP_PINMUX(b, 11, 0xe8, 14, periph)
/* pb11_tc4wo1g4_in */
#define PB11_TC4WO1G4_IN MCHP_PINMUX(b, 11, 0xf4, 6, periph)
/* pb11_tc4wo1_out */
#define PB11_TC4WO1_OUT MCHP_PINMUX(b, 11, 0x2e8, 19, periph)
/* pb11_tc5wo0g1_in */
#define PB11_TC5WO0G1_IN MCHP_PINMUX(b, 11, 0xf8, 14, periph)
/* pb11_tc5wo1g4_in */
#define PB11_TC5WO1G4_IN MCHP_PINMUX(b, 11, 0x104, 6, periph)
/* pb11_tc5wo1_out */
#define PB11_TC5WO1_OUT MCHP_PINMUX(b, 11, 0x2e8, 20, periph)
/* pb11_tc6wo0g1_in */
#define PB11_TC6WO0G1_IN MCHP_PINMUX(b, 11, 0x108, 14, periph)
/* pb11_tc6wo1g4_in */
#define PB11_TC6WO1G4_IN MCHP_PINMUX(b, 11, 0x114, 6, periph)
/* pb11_tc6wo1_out */
#define PB11_TC6WO1_OUT MCHP_PINMUX(b, 11, 0x2e8, 21, periph)
/* pb11_tc7wo0g1_in */
#define PB11_TC7WO0G1_IN MCHP_PINMUX(b, 11, 0x118, 14, periph)
/* pb11_tc7wo1g4_in */
#define PB11_TC7WO1G4_IN MCHP_PINMUX(b, 11, 0x124, 6, periph)
/* pb11_tc7wo1_out */
#define PB11_TC7WO1_OUT MCHP_PINMUX(b, 11, 0x2e8, 22, periph)
/* pb11_tcc0wo1_out */
#define PB11_TCC0WO1_OUT MCHP_PINMUX(b, 11, 0x2e8, 8, periph)
/* pb11_tcc0wo3_out */
#define PB11_TCC0WO3_OUT MCHP_PINMUX(b, 11, 0x2e8, 7, periph)
/* pb11_tcc0wo5_out */
#define PB11_TCC0WO5_OUT MCHP_PINMUX(b, 11, 0x2e8, 9, periph)
/* pb11_tcc1wo1_out */
#define PB11_TCC1WO1_OUT MCHP_PINMUX(b, 11, 0x2e8, 11, periph)
/* pb11_tcc1wo3_out */
#define PB11_TCC1WO3_OUT MCHP_PINMUX(b, 11, 0x2e8, 10, periph)
/* pb11_tcc1wo5_out */
#define PB11_TCC1WO5_OUT MCHP_PINMUX(b, 11, 0x2e8, 12, periph)
/* pb11_tcc2wo1_out */
#define PB11_TCC2WO1_OUT MCHP_PINMUX(b, 11, 0x2e8, 13, periph)
/* pb12_cclin0_in */
#define PB12_CCLIN0_IN MCHP_PINMUX(b, 12, 0x98, 7, periph)
/* pb12_cclin1_in */
#define PB12_CCLIN1_IN MCHP_PINMUX(b, 12, 0x9c, 14, periph)
/* pb12_cclin3_in */
#define PB12_CCLIN3_IN MCHP_PINMUX(b, 12, 0xa4, 7, periph)
/* pb12_cclin4_in */
#define PB12_CCLIN4_IN MCHP_PINMUX(b, 12, 0xa8, 14, periph)
/* pb12_cclout1_out */
#define PB12_CCLOUT1_OUT MCHP_PINMUX(b, 12, 0x2f0, 27, periph)
/* pb12_extint0_in */
#define PB12_EXTINT0_IN MCHP_PINMUX(b, 12, 0x0, 7, periph)
/* pb12_extint1_in */
#define PB12_EXTINT1_IN MCHP_PINMUX(b, 12, 0x4, 14, periph)
/* pb12_qd0_out */
#define PB12_QD0_OUT MCHP_PINMUX(b, 12, 0x2f0, 24, periph)
/* pb12_qd1_in */
#define PB12_QD1_IN MCHP_PINMUX(b, 12, 0x88, 7, periph)
/* pb12_qd2_in */
#define PB12_QD2_IN MCHP_PINMUX(b, 12, 0x8c, 14, periph)
/* pb12_qd2_out */
#define PB12_QD2_OUT MCHP_PINMUX(b, 12, 0x2f0, 26, periph)
/* pb12_qd3_out */
#define PB12_QD3_OUT MCHP_PINMUX(b, 12, 0x2f0, 25, periph)
/* pb12_qspics_out */
#define PB12_QSPICS_OUT MCHP_PINMUX(b, 12, 0x2f0, 23, periph)
/* pb12_scom0p0_in */
#define PB12_SCOM0P0_IN MCHP_PINMUX(b, 12, 0x40, 14, periph)
/* pb12_scom0p0_out */
#define PB12_SCOM0P0_OUT MCHP_PINMUX(b, 12, 0x2f0, 1, periph)
/* pb12_scom0p2_out */
#define PB12_SCOM0P2_OUT MCHP_PINMUX(b, 12, 0x2f0, 3, periph)
/* pb12_scom0p3_in */
#define PB12_SCOM0P3_IN MCHP_PINMUX(b, 12, 0x4c, 7, periph)
/* pb12_scom0p3_out */
#define PB12_SCOM0P3_OUT MCHP_PINMUX(b, 12, 0x2f0, 2, periph)
/* pb12_scom1p2_in */
#define PB12_SCOM1P2_IN MCHP_PINMUX(b, 12, 0x58, 7, periph)
/* pb12_scom1p2_out */
#define PB12_SCOM1P2_OUT MCHP_PINMUX(b, 12, 0x2f0, 6, periph)
/* pb12_scom1p3_in */
#define PB12_SCOM1P3_IN MCHP_PINMUX(b, 12, 0x5c, 14, periph)
/* pb12_scom1p3_out */
#define PB12_SCOM1P3_OUT MCHP_PINMUX(b, 12, 0x2f0, 5, periph)
/* pb12_tc0wo0g1_in */
#define PB12_TC0WO0G1_IN MCHP_PINMUX(b, 12, 0xb0, 7, periph)
/* pb12_tc0wo0g2_in */
#define PB12_TC0WO0G2_IN MCHP_PINMUX(b, 12, 0xb4, 14, periph)
/* pb12_tc0wo1_out */
#define PB12_TC0WO1_OUT MCHP_PINMUX(b, 12, 0x2f0, 15, periph)
/* pb12_tc1wo0g1_in */
#define PB12_TC1WO0G1_IN MCHP_PINMUX(b, 12, 0xc0, 7, periph)
/* pb12_tc1wo1g2_in */
#define PB12_TC1WO1G2_IN MCHP_PINMUX(b, 12, 0xc4, 14, periph)
/* pb12_tc1wo1_out */
#define PB12_TC1WO1_OUT MCHP_PINMUX(b, 12, 0x2f0, 16, periph)
/* pb12_tc2wo0g1_in */
#define PB12_TC2WO0G1_IN MCHP_PINMUX(b, 12, 0xc8, 7, periph)
/* pb12_tc2wo1g2_in */
#define PB12_TC2WO1G2_IN MCHP_PINMUX(b, 12, 0xd0, 14, periph)
/* pb12_tc2wo1_out */
#define PB12_TC2WO1_OUT MCHP_PINMUX(b, 12, 0x2f0, 17, periph)
/* pb12_tc3wo0g1_in */
#define PB12_TC3WO0G1_IN MCHP_PINMUX(b, 12, 0xd8, 7, periph)
/* pb12_tc3wo1g2_in */
#define PB12_TC3WO1G2_IN MCHP_PINMUX(b, 12, 0xe0, 14, periph)
/* pb12_tc3wo1_out */
#define PB12_TC3WO1_OUT MCHP_PINMUX(b, 12, 0x2f0, 18, periph)
/* pb12_tc4wo0g1_in */
#define PB12_TC4WO0G1_IN MCHP_PINMUX(b, 12, 0xe8, 7, periph)
/* pb12_tc4wo1g2_in */
#define PB12_TC4WO1G2_IN MCHP_PINMUX(b, 12, 0xf0, 14, periph)
/* pb12_tc4wo1_out */
#define PB12_TC4WO1_OUT MCHP_PINMUX(b, 12, 0x2f0, 19, periph)
/* pb12_tc5wo0g1_in */
#define PB12_TC5WO0G1_IN MCHP_PINMUX(b, 12, 0xf8, 7, periph)
/* pb12_tc5wo1g2_in */
#define PB12_TC5WO1G2_IN MCHP_PINMUX(b, 12, 0x100, 14, periph)
/* pb12_tc5wo1_out */
#define PB12_TC5WO1_OUT MCHP_PINMUX(b, 12, 0x2f0, 20, periph)
/* pb12_tc6wo0g1_in */
#define PB12_TC6WO0G1_IN MCHP_PINMUX(b, 12, 0x108, 7, periph)
/* pb12_tc6wo1g2_in */
#define PB12_TC6WO1G2_IN MCHP_PINMUX(b, 12, 0x110, 14, periph)
/* pb12_tc6wo1_out */
#define PB12_TC6WO1_OUT MCHP_PINMUX(b, 12, 0x2f0, 21, periph)
/* pb12_tc7wo0g1_in */
#define PB12_TC7WO0G1_IN MCHP_PINMUX(b, 12, 0x118, 7, periph)
/* pb12_tc7wo1g2_in */
#define PB12_TC7WO1G2_IN MCHP_PINMUX(b, 12, 0x120, 14, periph)
/* pb12_tc7wo1_out */
#define PB12_TC7WO1_OUT MCHP_PINMUX(b, 12, 0x2f0, 22, periph)
/* pb12_tcc0wo1_out */
#define PB12_TCC0WO1_OUT MCHP_PINMUX(b, 12, 0x2f0, 7, periph)
/* pb12_tcc0wo3_out */
#define PB12_TCC0WO3_OUT MCHP_PINMUX(b, 12, 0x2f0, 9, periph)
/* pb12_tcc0wo5_out */
#define PB12_TCC0WO5_OUT MCHP_PINMUX(b, 12, 0x2f0, 8, periph)
/* pb12_tcc1wo1_out */
#define PB12_TCC1WO1_OUT MCHP_PINMUX(b, 12, 0x2f0, 10, periph)
/* pb12_tcc1wo3_out */
#define PB12_TCC1WO3_OUT MCHP_PINMUX(b, 12, 0x2f0, 12, periph)
/* pb12_tcc1wo5_out */
#define PB12_TCC1WO5_OUT MCHP_PINMUX(b, 12, 0x2f0, 11, periph)
/* pb12_tcc2wo1_out */
#define PB12_TCC2WO1_OUT MCHP_PINMUX(b, 12, 0x2f0, 13, periph)
/* pb13_cclin1_in */
#define PB13_CCLIN1_IN MCHP_PINMUX(b, 13, 0x9c, 7, periph)
/* pb13_cclin2_in */
#define PB13_CCLIN2_IN MCHP_PINMUX(b, 13, 0xa0, 14, periph)
/* pb13_cclin4_in */
#define PB13_CCLIN4_IN MCHP_PINMUX(b, 13, 0xa8, 7, periph)
/* pb13_cclin5_in */
#define PB13_CCLIN5_IN MCHP_PINMUX(b, 13, 0xac, 14, periph)
/* pb13_cclout0_out */
#define PB13_CCLOUT0_OUT MCHP_PINMUX(b, 13, 0x2f8, 27, periph)
/* pb13_cclout1_out */
#define PB13_CCLOUT1_OUT MCHP_PINMUX(b, 13, 0x2f4, 27, periph)
/* pb13_extint1_in */
#define PB13_EXTINT1_IN MCHP_PINMUX(b, 13, 0x4, 7, periph)
/* pb13_extint2_in */
#define PB13_EXTINT2_IN MCHP_PINMUX(b, 13, 0x8, 14, periph)
/* pb13_qcs_out */
#define PB13_QCS_OUT MCHP_PINMUX(b, 13, 0x2f8, 23, periph)
/* pb13_qd0_out */
#define PB13_QD0_OUT MCHP_PINMUX(b, 13, 0x2f4, 24, periph)
/* pb13_qd1_out */
#define PB13_QD1_OUT MCHP_PINMUX(b, 13, 0x2f8, 24, periph)
/* pb13_qd2_in */
#define PB13_QD2_IN MCHP_PINMUX(b, 13, 0x8c, 7, periph)
/* pb13_qd2_out */
#define PB13_QD2_OUT MCHP_PINMUX(b, 13, 0x2f4, 26, periph)
/* pb13_qd3_in */
#define PB13_QD3_IN MCHP_PINMUX(b, 13, 0x90, 14, periph)
/* pb13_qd3_out */
#define PB13_QD3_OUT MCHP_PINMUX(b, 13, 0x2f4, 25, periph)
/* pb13_qspics_out */
#define PB13_QSPICS_OUT MCHP_PINMUX(b, 13, 0x2f4, 23, periph)
/* pb13_scom0p0_in */
#define PB13_SCOM0P0_IN MCHP_PINMUX(b, 13, 0x40, 7, periph)
/* pb13_scom0p0_out */
#define PB13_SCOM0P0_OUT MCHP_PINMUX(b, 13, 0x2f4, 1, periph)
/* pb13_scom0p2_out */
#define PB13_SCOM0P2_OUT MCHP_PINMUX(b, 13, 0x2f4, 3, periph)
/* pb13_scom0p3_out */
#define PB13_SCOM0P3_OUT MCHP_PINMUX(b, 13, 0x2f4, 2, periph)
/* pb13_scom1p0_in */
#define PB13_SCOM1P0_IN MCHP_PINMUX(b, 13, 0x50, 14, periph)
/* pb13_scom1p2_out */
#define PB13_SCOM1P2_OUT MCHP_PINMUX(b, 13, 0x2f4, 6, periph)
/* pb13_scom1p3_in */
#define PB13_SCOM1P3_IN MCHP_PINMUX(b, 13, 0x5c, 7, periph)
/* pb13_scom1p3_out */
#define PB13_SCOM1P3_OUT MCHP_PINMUX(b, 13, 0x2f4, 5, periph)
/* pb13_tc0wo0g2_in */
#define PB13_TC0WO0G2_IN MCHP_PINMUX(b, 13, 0xb4, 7, periph)
/* pb13_tc0wo0_out */
#define PB13_TC0WO0_OUT MCHP_PINMUX(b, 13, 0x2f8, 15, periph)
/* pb13_tc0wo1g3_in */
#define PB13_TC0WO1G3_IN MCHP_PINMUX(b, 13, 0xb8, 14, periph)
/* pb13_tc0wo1_out */
#define PB13_TC0WO1_OUT MCHP_PINMUX(b, 13, 0x2f4, 15, periph)
/* pb13_tc1wo0_out */
#define PB13_TC1WO0_OUT MCHP_PINMUX(b, 13, 0x2f8, 16, periph)
/* pb13_tc1wo1g2_in */
#define PB13_TC1WO1G2_IN MCHP_PINMUX(b, 13, 0xc4, 7, periph)
/* pb13_tc1wo1_out */
#define PB13_TC1WO1_OUT MCHP_PINMUX(b, 13, 0x2f4, 16, periph)
/* pb13_tc2wo0g3_in */
#define PB13_TC2WO0G3_IN MCHP_PINMUX(b, 13, 0xcc, 14, periph)
/* pb13_tc2wo0_out */
#define PB13_TC2WO0_OUT MCHP_PINMUX(b, 13, 0x2f8, 17, periph)
/* pb13_tc2wo1g2_in */
#define PB13_TC2WO1G2_IN MCHP_PINMUX(b, 13, 0xd0, 7, periph)
/* pb13_tc2wo1_out */
#define PB13_TC2WO1_OUT MCHP_PINMUX(b, 13, 0x2f4, 17, periph)
/* pb13_tc3wo0g3_in */
#define PB13_TC3WO0G3_IN MCHP_PINMUX(b, 13, 0xdc, 14, periph)
/* pb13_tc3wo0_out */
#define PB13_TC3WO0_OUT MCHP_PINMUX(b, 13, 0x2f8, 18, periph)
/* pb13_tc3wo1g2_in */
#define PB13_TC3WO1G2_IN MCHP_PINMUX(b, 13, 0xe0, 7, periph)
/* pb13_tc3wo1_out */
#define PB13_TC3WO1_OUT MCHP_PINMUX(b, 13, 0x2f4, 18, periph)
/* pb13_tc4wo0g3_in */
#define PB13_TC4WO0G3_IN MCHP_PINMUX(b, 13, 0xec, 14, periph)
/* pb13_tc4wo0_out */
#define PB13_TC4WO0_OUT MCHP_PINMUX(b, 13, 0x2f8, 19, periph)
/* pb13_tc4wo1g2_in */
#define PB13_TC4WO1G2_IN MCHP_PINMUX(b, 13, 0xf0, 7, periph)
/* pb13_tc4wo1_out */
#define PB13_TC4WO1_OUT MCHP_PINMUX(b, 13, 0x2f4, 19, periph)
/* pb13_tc5wo0g3_in */
#define PB13_TC5WO0G3_IN MCHP_PINMUX(b, 13, 0xfc, 14, periph)
/* pb13_tc5wo0_out */
#define PB13_TC5WO0_OUT MCHP_PINMUX(b, 13, 0x2f8, 20, periph)
/* pb13_tc5wo1g2_in */
#define PB13_TC5WO1G2_IN MCHP_PINMUX(b, 13, 0x100, 7, periph)
/* pb13_tc5wo1_out */
#define PB13_TC5WO1_OUT MCHP_PINMUX(b, 13, 0x2f4, 20, periph)
/* pb13_tc6wo0g3_in */
#define PB13_TC6WO0G3_IN MCHP_PINMUX(b, 13, 0x10c, 14, periph)
/* pb13_tc6wo0_out */
#define PB13_TC6WO0_OUT MCHP_PINMUX(b, 13, 0x2f8, 21, periph)
/* pb13_tc6wo1g2_in */
#define PB13_TC6WO1G2_IN MCHP_PINMUX(b, 13, 0x110, 7, periph)
/* pb13_tc6wo1_out */
#define PB13_TC6WO1_OUT MCHP_PINMUX(b, 13, 0x2f4, 21, periph)
/* pb13_tc7wo0g3_in */
#define PB13_TC7WO0G3_IN MCHP_PINMUX(b, 13, 0x11c, 14, periph)
/* pb13_tc7wo0_out */
#define PB13_TC7WO0_OUT MCHP_PINMUX(b, 13, 0x2f8, 22, periph)
/* pb13_tc7wo1g2_in */
#define PB13_TC7WO1G2_IN MCHP_PINMUX(b, 13, 0x120, 7, periph)
/* pb13_tc7wo1_out */
#define PB13_TC7WO1_OUT MCHP_PINMUX(b, 13, 0x2f4, 22, periph)
/* pb13_tcc0wo0_out */
#define PB13_TCC0WO0_OUT MCHP_PINMUX(b, 13, 0x2f8, 8, periph)
/* pb13_tcc0wo1_out */
#define PB13_TCC0WO1_OUT MCHP_PINMUX(b, 13, 0x2f4, 7, periph)
/* pb13_tcc0wo2_out */
#define PB13_TCC0WO2_OUT MCHP_PINMUX(b, 13, 0x2f8, 7, periph)
/* pb13_tcc0wo3_out */
#define PB13_TCC0WO3_OUT MCHP_PINMUX(b, 13, 0x2f4, 9, periph)
/* pb13_tcc0wo4_out */
#define PB13_TCC0WO4_OUT MCHP_PINMUX(b, 13, 0x2f8, 9, periph)
/* pb13_tcc0wo5_out */
#define PB13_TCC0WO5_OUT MCHP_PINMUX(b, 13, 0x2f4, 8, periph)
/* pb13_tcc1wo0_out */
#define PB13_TCC1WO0_OUT MCHP_PINMUX(b, 13, 0x2f8, 11, periph)
/* pb13_tcc1wo1_out */
#define PB13_TCC1WO1_OUT MCHP_PINMUX(b, 13, 0x2f4, 10, periph)
/* pb13_tcc1wo2_out */
#define PB13_TCC1WO2_OUT MCHP_PINMUX(b, 13, 0x2f8, 10, periph)
/* pb13_tcc1wo3_out */
#define PB13_TCC1WO3_OUT MCHP_PINMUX(b, 13, 0x2f4, 12, periph)
/* pb13_tcc1wo4_out */
#define PB13_TCC1WO4_OUT MCHP_PINMUX(b, 13, 0x2f8, 12, periph)
/* pb13_tcc1wo5_out */
#define PB13_TCC1WO5_OUT MCHP_PINMUX(b, 13, 0x2f4, 11, periph)
/* pb13_tcc2wo0_out */
#define PB13_TCC2WO0_OUT MCHP_PINMUX(b, 13, 0x2f8, 13, periph)
/* pb13_tcc2wo1_out */
#define PB13_TCC2WO1_OUT MCHP_PINMUX(b, 13, 0x2f4, 13, periph)

#endif /* MICROCHIP_PIC32CX5109BZ31048_PINCTRL_H_ */